[
  {
    "image_metadata": {
      "1": [
        "001.jpg",
        ".jpg",
        "RBI   Reserve Bank of India\\image_metadata\\001.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\RBI   Reserve Bank of India\\image_metadata\\001.jpg"
      ],
      "2": [
        "002.jpg",
        ".jpg",
        "RBI   Reserve Bank of India\\image_metadata\\002.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\RBI   Reserve Bank of India\\image_metadata\\002.jpg"
      ],
      "3": [
        "003.jpg",
        ".jpg",
        "RBI   Reserve Bank of India\\image_metadata\\003.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\RBI   Reserve Bank of India\\image_metadata\\003.jpg"
      ],
      "4": [
        "004.jpg",
        ".jpg",
        "RBI   Reserve Bank of India\\image_metadata\\004.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\RBI   Reserve Bank of India\\image_metadata\\004.jpg"
      ],
      "5": [
        "005.jpg",
        ".jpg",
        "RBI   Reserve Bank of India\\image_metadata\\005.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\RBI   Reserve Bank of India\\image_metadata\\005.jpg"
      ],
      "6": [
        "006.jpg",
        ".jpg",
        "RBI   Reserve Bank of India\\image_metadata\\006.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\RBI   Reserve Bank of India\\image_metadata\\006.jpg"
      ],
      "7": [
        "007.jpg",
        ".jpg",
        "RBI   Reserve Bank of India\\image_metadata\\007.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\RBI   Reserve Bank of India\\image_metadata\\007.jpg"
      ],
      "8": [
        "008.jpg",
        ".jpg",
        "RBI   Reserve Bank of India\\image_metadata\\008.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\RBI   Reserve Bank of India\\image_metadata\\008.jpg"
      ],
      "9": [
        "009.jpg",
        ".jpg",
        "RBI   Reserve Bank of India\\image_metadata\\009.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\RBI   Reserve Bank of India\\image_metadata\\009.jpg"
      ],
      "10": [
        "010.jpg",
        ".jpg",
        "RBI   Reserve Bank of India\\image_metadata\\010.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\RBI   Reserve Bank of India\\image_metadata\\010.jpg"
      ]
    },
    "keywords": {
      "keywords_TFIDF": [
        "bank",
        "rate",
        "commercial",
        "rbi",
        "reserve",
        "repo",
        "borrowing",
        "money",
        "cash",
        "ratio",
        "current",
        "india",
        "currency",
        "interest",
        "make",
        "time",
        "deposit",
        "policy",
        "demand",
        "charged"
      ]
    },
    "audio_transcript": "RBI   Reserve Bank of India\n\nHi guys welcome to my channel date 1 finance and in this video we would be looking after the reserve bank of india. So without wasting any time let's get started with this video. Basic introduction. Rbi is our central bank rbi central bank of india talk about this establishment year it was established on 1st april 1935. The current governor of rbi is mr shaktikanta das. The headquarter of rbi is. There in mumbai maharashtra. And the major function of rbi is supervision of commercial banks and issuance of currency so this is also mentioned there in the preamble of rbi which describe its main function as. Regulate the issue of banknotes and keeping of reserves with a view to securing monetary stability in india and chanderi to operate the currency and credit system of the country to its advantage. How rbi describe its main functioning that is to issue the bank notes. And to keep the reserves in order to keep a stability maintenance in the country's economy in the country's monetary policy is. And to operate the flow of currencies and credit to the public in an efficient way to its full advantage. Look at the functioning of rbi in a little bit more detail it controls and supervises the functioning of financial institutions commercial banks. Mpsc spice tableting certain sach rules and regulations to be followed. Janu rbi serves as a banker to all other banks. Ok so whether we talk about any financial institution whether we talk about any other scheduled or non scheduled bank. Any and all has to follow certain guidelines certain search rules and norms. Which is pre decided by the rbi and it is mandated it is obligatory to be followed by these rules and norms are made. These rules and norms are made to safeguard the interest of the public. Who are depositing the money was taking credit from the bank to have a look over all these functioning of banks to have a look over to have a control over all these functions are there comes into picture. Order wise to facilitate the issue and flow of current in the country by analysing economic structure and prevailing scenario to decide on the number of paper notes to be printed and circulated in the system. Rbi is solely responsible for the issuing of currency notes. So when we talk about to the currency in. Rbi who is authorised to print the paper notes. Rbi authorised to diesel currency notes in the system. Rbi. Printed paper currency coins minted by the government of india and rbi act as an agent for handling and distributing the coins. Idea i also keeps on upgrading the security features in currency to avoid any kind of counterfeiting of currency. News. Are the guidelines like to identify your currency originality you have to look after these all the features and these features are decided these features are. Provided by rbi in the currency notes to avoid the count of eating to avoid any kind of malpractices involved. Continuing with the previous slide. As a banker to the government by carrying out country's financial transactions efficiently by maintaining accounts of payments and systems. Rbi also serves as a banker to the government which is government itself is having. A lot of transactions on daily basis whether which of about these assets the payment being made the foreign transaction fee domestic transactions and all those transactions could be served by maintaining accounts within the rbi. Books bankers bank in a way that commercial banks hold their account in rbi deposit money borrows money as and when required on the prevailing interest rates. It also works as a bankers bank. When we have to take money we have to deposit money we go to any of the bank. Similarly when the banks are in need of money when the banks are in need of depositing money the go to rbi and they are also in a similar way to charge some kind of interest rate which is pre-determined. Its regulated foreign exchange transactions by facilitating foreign trade and maintaining foreign exchange market in india to create forex reserves synopsis domestic scenario rbi is also responsible for maintaining the foreign exchange reserve. Facility at various foreign trading with which is done within which is done from our country to other countries to other foreign nations. And all these trading purposes rbi was responsible for holding the reserves. Without holding could help in. Making the imports to the country and various other foreign trade. Aunty 2016 monetary policy was solely and the control of rbi b as in 2016 monetary policy committee had been formed to decide and fixed interest rate in india. Stock 2016 the monetary policy monetary policy is like to controlling the interest rate to control the economic scenario. This was only under the control of rbi but what happened in 2016 a separate monetary policy committee had been formed which is the authorised to determine to decide to determine a fixed interest rate the members of rbi are also involved in that but this is how a separate committee has been formed. Now let's have a look at the various policy rates we would be covering the repo rate and reverse repo rate which is two of the main policy rates and the bank rate also which is the main rates when we talk in concern of rbi and commercial bank. Rbi money commercial banks for short time period of less than 19 days. Ok so this rate is charged by rbi while lending money to commercial banks. As i said when we are in need of money we go to banks and we want a money similarly when the commercial banks are in need of money. Go to rbi and rbi provides the money required by them but the also charged a certain fixed rate of interest. And when this interest rate when this boring is for a shorter time period of less than 90 days. This is what to this is how repo rate comes into pictures it is the interest rate. Charge by rbi while lending to commercial banks for a shorter boring. Rbi wants to make borrowing money expensive for commercial banks is it simply increases the repo rate. Because increasing the repo rate would make borrowing by commercial bank commercial banks a little more difficult. And in the repo rate when it wants to make the borrowing by commercial banks cheaper. When we talk about the current repo rate for the current repo rate in our country 6.50%. Why is that dancer just have a look over here. Increase repo rate make borrowing costly for commercial banks as a result of which these commercial banks also increases the interest rate. Boring pipe public costlier please to less demand for loans reducing the money supply in economy to curb inflation. Oggy and the acid talk about the monetary policy in monetary policy controlling over the interest rate is done to have a control over the economic scenario so when we talked about the inflation in the country one way to control the inflation is also by increasing the repo rate. How does that happens because when repo rate is increased. Commercial banks the borrowing by commercial banks becomes costlier and as a result what does commercial banks to they also increased the interest rate on the wharf inspired the public. The borrowings on the interest rate increases for the public also the public. Tends to less demand for the loans no less for the loans. And that's what happens the money supply in the economy reduces the demand is control under control the supplies limited inflation is automatically controlled so this is how monetary policies are used. In order to curb various economic situation. Look at the reverse repo rate it wasn't first passed by commercial banks on rbi for borrowing money this following is used only for a short period of time current reverse repo rate is 6.25%. Ok so i'll be talked about repo rate it was commercial banks borrowing money from rbi. Similar hindi opposite manner when we talk when rbi has to borrow money from the commercial bank we call this as reverse repo rate so it happens like sometimes rbi is need is in the need of the money or it sometimes does it intentionally to reduce the liquidity in commercial banks any of the reason when rbi borrows money from commercial banks for a shorter period of time this is usually known as reverse repo rate the interest rate charged is known as reverse repo rate. And the current reverse repo rate is 6.25% now come in our country. It is an internationally by rbi to reduce the liquidity in commercial bank as i already told it is sometimes that intend to visit in commercial. This is you know when rbi borrows money from bank to the account of rbi and that in the commercial banks produces it is intentionally. When are you please banarasi is that the flow of money in the commercial banks is getting higher and that is not the required level. Talking about the bank rate is the interest rate charged by rbi on a long term borrowings by commercial banks. Ogi picture of the bank read it is for a longer term period in commercial banks borrows money from rbi for a longer period of time that is for more than 90 days useful in short period of time you were considering 90 days. The time period it would be called as the bank rate and the current bank rate is 6.75%. Look at the shoes. First one is cash reserve ratio it is mandatory to keep certain percentage of deposit as a cash reserve in rbi this obligatory deposit by commercial banks in rbi is known as cash reserve ratio. Currency rs 4%. Ok so whatever deposits are there with the commercial banks take used to. If a proportion a percentage of their deposit as reserves with the rbi in form of cash. And this is what we call as the cash reserve ratio it is obligatory this is done in order to safeguard various interest involving the public and the bank. All the banks have to follow this rule and they have to keep a deposit with the rbi that is what we call cash with of ratio and the current crr is 4% so if the banks are having a deposit of rupees hundred they would have to. Are provided rupees. What is statutory liquidity ratio it is proportion of net demand and time liabilities. Mandated to be maintained as liquid reserve usually in the form of cash and gold reserve by commercial banks in rbi current slr is 19.5%. Ok so it is somewhat similar to see at the only difference is that. Crr was maintaining reserves in the form of cache files the commercial banks has to maintain reserves with rbi in form of cash as well as cold and how this proportion is decided this is on the basis of net demand and time light time liabilities. Net demand here is referring to the current accounts by public the saving account. And presenting the fixed accounts the fixed deposits the actors. Hold by the public so the proportion of this is considered and that it is decided how much what percentage for promotion what proportion would be kept as liquid reserve. Rbi in form of this cash and gold. Current slr residency is 19.5% so this is the proportion of amount which is the banks are required to maintain cash reserve with rbi. Shuddh was all about this video we talked about rbi is we see various functions of rbi and then we moved to the policy rates where we covered the repo rate and reverse repo rate and bank rate. And finally we had a look at the reserve tissues which is the cash reserve ratio and statutory liquidity ratio i hope you understand this sweet you a little bit more about rbi how does it functions and in brief i tried to explain all the all those things i hope you like this video. What thing you like and share my video. Thank you all. ",
    "domain": "Finance",
    "video": {
      "Path": [
        "RBI   Reserve Bank of India\\keyframes\\RBI   Reserve Bank of India.mkv"
      ],
      "File_Name": [
        "RBI   Reserve Bank of India"
      ],
      "Video_URL_Path": [
        "RBI%20%20%20Reserve%20Bank%20of%20India.mkv"
      ],
      "Video_URL_FullPath": [
        "C%3A/Users/Makonis/PycharmProjects/newvrs/RBI%20%20%20Reserve%20Bank%20of%20India/keyframes/RBI%20%20%20Reserve%20Bank%20of%20India.mkv"
      ],
      "Full_Path": [
        "C:\\\\Users\\\\Makonis\\\\PycharmProjects\\\\newvrs\\\\RBI   Reserve Bank of India\\\\keyframes\\\\RBI   Reserve Bank of India.mkv"
      ],
      "Duration": [
        "00:14:42"
      ]
    },
    "title": "Reserve bank of India",
    "chapters_list": {
      "1": [
        "00:00:00",
        "00:00:10",
        "['Reserve', 'RBl', 'India', 'Bank']",
        "RBl- Reserve"
      ],
      "2": [
        "00:00:10",
        "00:01:23",
        "['NTRODUCTION', 'Bank', 'Reserve Bank', 'India', 'Bank Notes']",
        "NTRODUCTION"
      ],
      "3": [
        "00:01:23",
        "00:03:44",
        "['FUNCTIONS', 'RBI', 'currency', 'financial institutions', 'While RBI']",
        "FUNCTIONS OF RBI"
      ],
      "4": [
        "00:03:44",
        "00:06:23",
        "['FUNCTIONS', 'RBI', 'monetary policy', 'monetary', 'India']",
        "FUNCTIONS OF RBI"
      ],
      "5": [
        "00:06:23",
        "00:06:49",
        "['POLICY RATES', 'Repo Rate', 'Rate', 'commercial banks', 'POLICY']",
        "POLICY RATES"
      ],
      "6": [
        "00:06:49",
        "00:09:28",
        "['POLICY RATES', 'Repo Rate', 'Rate', 'POLICY', 'Repo']",
        "POLICY RATES"
      ],
      "7": [
        "00:09:28",
        "00:11:40",
        "['POLICY RATES', 'Repo Rate', 'Reverse Repo', 'Rate', 'Bank Rate']",
        "POLICY RATES"
      ],
      "8": [
        "00:11:40",
        "00:11:47",
        "['Cash Reserve', 'RESERVE', 'RESERVE RATIOS', 'Liquidity Ratio', 'Rbi']",
        "RESERVE RATIOS"
      ],
      "9": [
        "00:11:47",
        "00:14:33",
        "['Reserve Ratio', 'Cash Reserve', 'Ratio', 'RESERVE', 'Liquidity Ratio']",
        "RESERVE RATIOS"
      ],
      "10": [
        "00:14:33",
        "00:14:42",
        "['THANK', 'WATCHING', 'DEVTECH', 'FINANCE']",
        "THANK YOU FOR"
      ]
    },
    "faculty": "Singh",
    "video_ID": 0
  },
  {
    "image_metadata": {
      "1": [
        "001.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\001.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\001.jpg"
      ],
      "2": [
        "002.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\002.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\002.jpg"
      ],
      "3": [
        "003.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\003.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\003.jpg"
      ],
      "4": [
        "004.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\004.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\004.jpg"
      ],
      "5": [
        "005.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\005.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\005.jpg"
      ],
      "6": [
        "006.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\006.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\006.jpg"
      ],
      "7": [
        "007.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\007.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\007.jpg"
      ],
      "8": [
        "008.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\008.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\008.jpg"
      ],
      "9": [
        "009.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\009.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\009.jpg"
      ],
      "10": [
        "010.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\010.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\010.jpg"
      ],
      "11": [
        "011.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\011.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\011.jpg"
      ],
      "12": [
        "012.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\012.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\012.jpg"
      ],
      "13": [
        "013.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\013.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\013.jpg"
      ],
      "14": [
        "014.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\014.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\014.jpg"
      ],
      "15": [
        "015.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\015.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\015.jpg"
      ],
      "16": [
        "016.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\016.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\016.jpg"
      ],
      "17": [
        "017.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\017.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\017.jpg"
      ],
      "18": [
        "018.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\018.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\018.jpg"
      ],
      "19": [
        "019.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\019.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\019.jpg"
      ],
      "20": [
        "020.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\020.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\020.jpg"
      ],
      "21": [
        "021.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\021.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\021.jpg"
      ],
      "22": [
        "022.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\022.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\022.jpg"
      ],
      "23": [
        "023.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\023.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\023.jpg"
      ],
      "24": [
        "024.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\024.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\024.jpg"
      ],
      "25": [
        "025.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\025.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\025.jpg"
      ],
      "26": [
        "026.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\026.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\026.jpg"
      ],
      "27": [
        "027.jpg",
        ".jpg",
        "Indian National Movement\\image_metadata\\027.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Indian National Movement\\image_metadata\\027.jpg"
      ]
    },
    "keywords": {
      "keywords_TFIDF": [
        "indian",
        "thank",
        "british",
        "badruddin",
        "bengal",
        "social",
        "people",
        "leader",
        "chandra",
        "inc",
        "partition",
        "n",
        "gokhale",
        "congress",
        "dadabhai",
        "movement",
        "tyabji",
        "roy",
        "tilak",
        "national"
      ]
    },
    "audio_transcript": "Indian National Movement\n\nHello everyone. I am kiran joshi. Welcome you all in class 5 evs chapter indian national movement. The children you have learnt in the previous lesson. That the british rule caused discontent among indians. Indian 19th n in 1857 a massive revolt broke out against the british rule. After the initial success of the revolt it was suppressed by the british. After the revolt the rule of the east india company came to an end. The administration of india was taken over by the british government from the company. The governor general was henceforth known as the viceroy. As a direct represented of the british crown. During. This time. There were many social and religious practices prevailing in the society. For example one such bad practice was sati. The burning alive of women. On the funeral pyre of their husbands. Another ill practice was female infanticide. Children in many parts of india the birth of a girl child was considered as a curse and therefore. Open the female infants were deliberately killed. Then there was another in practice of child marriage. Specially the girls were married off auto very young age. When they were neither physically not emotionally ready for the marriage. Caste system was also a great curse that divided and affected the quality of indian society. Children there was some people. Who tried very hard to bring awareness amongst the people and the reform the society. Delayed many social reform movements for this purpose. They were known as social reformers. Raja ram mohan roy dayanand saraswati ishwar chandra vidyasagar sir syed ahmed khan. Some very renowned social reformers. You can see the images in front of you. Through the social reform movements of the social reformers. The word. To educate people and remove the evil social practices. The social reformers strongly opposed the practice of sati child marriage female infanticide and caste system. The work tirelessly to promote education among people and specially among girls. These social reformers also supported the idea of. Widow remarriage. The efforts of social reformers bor fruit. Slowly but great today indian society started changing. This was also the time when the feeling of nationalism was gradually spreading across the country. On 28 december 1885. Allan octavian hume you can see the image of this person in front of you. Two electron octavian hume a retired british civil officer founded the indian national congress. The first session of indian national congress. Was conducted in bombay. At the gokuldas tejpal sanskrit pathshala. From 28 december 230 1st december 1885. Wc bonnerjee. Full name was. Womesh chandra banerjee was the president of this first session of indian national congress. In which only 72 delegates participated. In the beginning the congress had quite moderate ins for example it wanted the british rule to be sensitive towards the problems and difficulties of the indian people and to listen to the demands of the people of india. The indian national congress waste. The british rule to involve indians. While taking administrative decisions. Related to india. The early leaders of the indian national congress was called the moderates who wanted gradual reforms and aimed at. Better association with the british rule. The prominent moderate leaders were surendra nath banerjee. Gopal krishna gokhale firoz shah mehta badruddin tyabji and dadabhai naoroji. Dada bhai naoroji is also called the grand old man of india. You know why. Because of his very long association with the indian freedom struggle. These moderate congress leaders head. Ulfat. The british would understand and remove their complaints. But. British ignore their demands and complete. Then some leaders. Realised that there was no point of appealing for requesting british government. They had no faith in the british sense of justice and fair play. They believed that their demands could only be heard by adopting forceful stronger measures. These leaders were known as extremists or radicals. Lala lajpat rai in punjab. Bal gangadhar tilak in maharashtra bipin chandra pal in bengal. What the prominent extremist leaders. They were called lal bal pal. The demanded for purna swaraj or complete independence. Bal gangadhar tilak meet of force full claim and gave the famous slogan. Freedom is my birthright and i shall have it. At the time bengal was the biggest state of british rule as well as the. Area of congress dominance. So. To weaken the stronghold of congress and to divide the hindus and the muslims. The british decided to divide bengal. So in 1905 lord curzon. You can see the image in front of you. Lord curzon the then governor general of india declared the partition of bengal. But opposite to what the british had imagine. The partition. Further give boost to the freedom struggle. The leaders of congress decided to boycott british goods and to use only indian goods. It was known as the swadeshi movement or swadeshi andolan. People gathered at crossroads made use bonfires and burnt the imported for in clothes and goods that they had. People from every section of the society. Given the students participated in this movement. Now to control this movement the british put many people including students in jail. But. This did not stop the indians from participating in the movement. And ultimately the british had to cancel the partition of bengal. Now to win back the goodwill of the indians the british introduced some reforms. By now the first world war. Broke out in 1914. The indian soldiers help the british during the war hoping that the british government would give more freedom and concession to indians. But the british begin to repress the indians even more than earlier. The pass the rowlatt act. On 6 february 1919 this at empowered the british government. Put anyone into jail without a trial. I am sure you all have heard about mahatma gandhi. The year 1999 was also the year when mahatma gandhi started to participate actively in the freedom struggle. His full name was mohandas karamchand gandhi was born in porbandar gujarat. He studied law in england and then went to south africa as a barrister. For almost 20 years. In south africa he saw the racial discrimination done towards the black and coloured people. He was moved by this ill-treatment and struggled against this injustice. In 1915 he returned to india. And started. Contributing to the nationalist movement. He had form belief in truth and nonviolence and he gave. A new direction to the freedom struggle. Because of his great contribution to the indian freedom struggle he was fondly called bapu aur mahatma. That's all for this chapter if you like the video and found it. Please like. Share and subscribe to the channel. Thank you. ",
    "domain": "History",
    "video": {
      "Path": [
        "Indian National Movement\\keyframes\\Indian National Movement.mkv"
      ],
      "File_Name": [
        "Indian National Movement"
      ],
      "Video_URL_Path": [
        "Indian%20National%20Movement.mkv"
      ],
      "Video_URL_FullPath": [
        "C%3A/Users/Makonis/PycharmProjects/newvrs/Indian%20National%20Movement/keyframes/Indian%20National%20Movement.mkv"
      ],
      "Full_Path": [
        "C:\\\\Users\\\\Makonis\\\\PycharmProjects\\\\newvrs\\\\Indian National Movement\\\\keyframes\\\\Indian National Movement.mkv"
      ],
      "Duration": [
        "00:09:32"
      ]
    },
    "title": "Indian National Movement",
    "chapters_list": {
      "1": [
        "00:00:00",
        "00:00:24",
        "['National Movement', 'Indian National', 'Movement', 'KIRAN JOSHI', 'National']",
        "Indian National Movement"
      ],
      "2": [
        "00:00:24",
        "00:00:51",
        "['British Government', 'took over', 'Government took', 'East India', 'India Company']",
        "British Government"
      ],
      "3": [
        "00:00:51",
        "00:01:47",
        "['Many social', 'Sati', 'religious practices', 'practices caused', 'caused much']",
        "Many social"
      ],
      "4": [
        "00:01:47",
        "00:01:51",
        "['Mohan Roy', 'reformers such', 'Ram Mohan', 'Raja Ram', 'Chandra Vidyasagar']",
        "Mohan Roy"
      ],
      "5": [
        "00:01:51",
        "00:03:01",
        "['Mohan Roy', 'reformers such', 'Ram Mohan', 'Raja Ram', 'Chandra Vidyasagar']",
        "Mohan Roy"
      ],
      "6": [
        "00:03:01",
        "00:03:25",
        "['CONGRESS', 'INDIAN', 'NATIONAL', 'named Allan', 'Allan']",
        "INDIAN NATIONAL CONGRESS"
      ],
      "7": [
        "00:03:25",
        "00:04:22",
        "['first session', 'presided over', 'Indian people', 'Bonnerjee', 'INC']",
        "The first session of INC"
      ],
      "8": [
        "00:04:22",
        "00:04:27",
        "['INC were', 'early leaders', 'INC', 'Badruddin Tyabji', 'Gopal Krishna']",
        "INC"
      ],
      "9": [
        "00:04:27",
        "00:04:57",
        "['INC were', 'early leaders', 'INC', 'Badruddin Tyabji', 'Gopal Krishna']",
        "INC"
      ],
      "10": [
        "00:04:57",
        "00:05:52",
        "['British remained', 'Congress leaders', 'remained indifferent', 'demands made', 'Lala Lajpat']",
        "British remained"
      ],
      "11": [
        "00:05:52",
        "00:06:02",
        "['Tilak gave', 'famous slogan', 'BIRTHRIGHT', 'ANDTSHALL', 'HAVEIT']",
        "Tilak gave"
      ],
      "12": [
        "00:06:02",
        "00:06:03",
        "['PARTITION', 'Lord Curzon', 'BENGAL', 'British decided', 'Curzon']",
        "PARTITION OF BENGAL"
      ],
      "13": [
        "00:06:03",
        "00:06:45",
        "['PARTITION', 'Lord Curzon', 'BENGAL', 'Curzon', 'British decided']",
        "PARTITION OF BENGAL"
      ],
      "14": [
        "00:06:45",
        "00:07:31",
        "['BENGAL', 'Swadeshi Andolan', 'only Indian', 'Indian goods', 'PARTITION']",
        "PARTITION OF BENGAL"
      ],
      "16": [
        "00:08:12",
        "00:09:26",
        "['COMING', 'GANDHLJ', 'Karamchand Gandhi', 'Mohandas Karamchand', 'South']",
        "COMING OE GANDHLJ"
      ],
      "17": [
        "00:09:26",
        "00:09:27",
        "['Thank']",
        "Thank"
      ],
      "18": [
        "00:09:27",
        "00:09:27",
        "['Thank']",
        "Thank"
      ],
      "19": [
        "00:09:27",
        "00:09:28",
        "['Thank']",
        "Thank"
      ],
      "20": [
        "00:09:28",
        "00:09:28",
        "['Thank', 'Lou']",
        "Thank"
      ],
      "21": [
        "00:09:28",
        "00:09:29",
        "['Thank']",
        "Thank"
      ],
      "22": [
        "00:09:29",
        "00:09:30",
        "['Thank']",
        "Thank"
      ],
      "23": [
        "00:09:30",
        "00:09:30",
        "['Thank']",
        "Thank"
      ],
      "24": [
        "00:09:30",
        "00:09:31",
        "['Thank']",
        "Thank"
      ]
    },
    "faculty": "Kumar",
    "video_ID": 2
  },
  {
    "image_metadata": {
      "1": [
        "001.jpg",
        ".jpg",
        "The Great Indian Desert\\image_metadata\\001.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Great Indian Desert\\image_metadata\\001.jpg"
      ],
      "2": [
        "002.jpg",
        ".jpg",
        "The Great Indian Desert\\image_metadata\\002.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Great Indian Desert\\image_metadata\\002.jpg"
      ],
      "3": [
        "003.jpg",
        ".jpg",
        "The Great Indian Desert\\image_metadata\\003.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Great Indian Desert\\image_metadata\\003.jpg"
      ],
      "4": [
        "004.jpg",
        ".jpg",
        "The Great Indian Desert\\image_metadata\\004.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Great Indian Desert\\image_metadata\\004.jpg"
      ],
      "5": [
        "005.jpg",
        ".jpg",
        "The Great Indian Desert\\image_metadata\\005.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Great Indian Desert\\image_metadata\\005.jpg"
      ],
      "6": [
        "006.jpg",
        ".jpg",
        "The Great Indian Desert\\image_metadata\\006.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Great Indian Desert\\image_metadata\\006.jpg"
      ],
      "7": [
        "007.jpg",
        ".jpg",
        "The Great Indian Desert\\image_metadata\\007.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Great Indian Desert\\image_metadata\\007.jpg"
      ],
      "8": [
        "008.jpg",
        ".jpg",
        "The Great Indian Desert\\image_metadata\\008.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Great Indian Desert\\image_metadata\\008.jpg"
      ],
      "9": [
        "009.jpg",
        ".jpg",
        "The Great Indian Desert\\image_metadata\\009.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Great Indian Desert\\image_metadata\\009.jpg"
      ],
      "10": [
        "010.jpg",
        ".jpg",
        "The Great Indian Desert\\image_metadata\\010.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Great Indian Desert\\image_metadata\\010.jpg"
      ],
      "11": [
        "011.jpg",
        ".jpg",
        "The Great Indian Desert\\image_metadata\\011.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Great Indian Desert\\image_metadata\\011.jpg"
      ],
      "12": [
        "012.jpg",
        ".jpg",
        "The Great Indian Desert\\image_metadata\\012.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Great Indian Desert\\image_metadata\\012.jpg"
      ],
      "13": [
        "013.jpg",
        ".jpg",
        "The Great Indian Desert\\image_metadata\\013.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Great Indian Desert\\image_metadata\\013.jpg"
      ],
      "14": [
        "014.jpg",
        ".jpg",
        "The Great Indian Desert\\image_metadata\\014.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Great Indian Desert\\image_metadata\\014.jpg"
      ],
      "15": [
        "015.jpg",
        ".jpg",
        "The Great Indian Desert\\image_metadata\\015.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Great Indian Desert\\image_metadata\\015.jpg"
      ],
      "16": [
        "016.jpg",
        ".jpg",
        "The Great Indian Desert\\image_metadata\\016.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Great Indian Desert\\image_metadata\\016.jpg"
      ],
      "17": [
        "017.jpg",
        ".jpg",
        "The Great Indian Desert\\image_metadata\\017.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Great Indian Desert\\image_metadata\\017.jpg"
      ]
    },
    "keywords": {
      "keywords_TFIDF": [
        "desert",
        "water",
        "thar",
        "region",
        "importance",
        "etc",
        "like",
        "many",
        "called",
        "canal",
        "sand",
        "beautiful",
        "rainfall",
        "sariska",
        "bird",
        "sandy",
        "little",
        "gangaur",
        "plant",
        "fast"
      ]
    },
    "audio_transcript": "The Great Indian Desert\n\nHello everyone. I am kiran joshi. Hope you all are. Welcome you all in class 5 evs chapter the great indian desert. This chapter will try to understand the location of the great indian desert. I will learn about its physical features. Its climate. The importance of the great indian desert. But first of all let's understand what is a desert. Such a desert is an area of land that is very dry because it gets very low amount of rainfall or no rain at rainfall at all. And therefore it has almost no water. Trees or plants. In this chapter we are learning about the great indian desert which is also known as the thar desert that means great indian desert and thar deserts are the name of. Simplest. Let's understand the extent of the great indian desert on the thar desert. Such that it stretches from the gujarat plains in the south. Up to the borders of punjab and haryana in the north. As you can see in the given image also. It means the gujarat plains make the southern border of the thar desert. And in the north the southern boundaries of punjab and haryana border it. The aravali range which is the oldest mountain range in india marks the eastern border of the thar desert. This was about the location of the great indian desert. Now let's understand its features. The great indian desert or the thar desert is very large dry region of saint and rocks. This large region is small small hills of sand which are known as sand dunes. So pasand yun is a small amount or hill of saint which is formed by the wind. Set children. That this region is very dry. It is because it's receives very little. Or you can say low rainfall. The luni river is the only river in the desert. It is a seasonal river and does not have much water throughout the year. A very obvious question that comes in our mind is how did people travel. Through the this vast desert. Children in the olden days people used camel to travel across the desert. In fact you might be knowing that camel is called the ship of the desert. You know why. It is because of its physical advantages which help camel to move in the desert easily. For example it has long padded feet. That help it to take long strides on hot sand and water easily. Camel stores food in its hump and can travel without water for many days. Due to these reasons camel is truly the ship of the desert. Nowadays jeeps are also used in cities as means of transport. Now as we know that that. There is very little or no rainfall in the thar desert. This great scarcity or shortage of water. Due to this water shortage very few plants grow here. Which plants do not need much water. To survive in the desert such as cactus ki qubool it sector. The desert plants. Have some special features. For example they are generally thorny and have long and deep roots. The thorns help preventing loss of water and the deep roots help plants take water from surface ground level. Dude region is usually drive with no or very little vegetation. In some places children in the desert there are oasis to. Oasis is a place in the desert where water comes up to the surface from deep underground. The presence of water makes the surrounding area green and fertile. So much green and fertile place in the desert is called a an oasis. Is this oasis provide suitable conditions for human settlements venue villages are developed around them. Is the desert area has great shortage of water the government has tried to solve this problem and provide water to the people of desert by building a canal. Canal is a human made waterway or you can say an artificial water way. That is used for irrigation travel and the water for a canal usually comes from a connecting river lake or ocean. So here a canal is built called indira gandhi canal. Which is named after the first woman prime minister of india mrs indira gandhi. This canal gets water from the river sutlej and beas. This is the longest canal of india. The indira gandhi canal has provided water for irrigation facilities. For drinking and industrial use. This irrigation has resulted in the increase in agricultural production as well as the cultivated area. Does this canal has transformed a vast area of barren desert into fertile and good fields. In many crops such as jwar bajara maize barley. And even wheat are produced here. A large number of people in the desert are nomads. Nomads are people who move from place to place. The banjaras are the nomadic people in the thar desert. Their main occupation is cattle rearing. So dikki on moving from place to from one place to another for the availability of water and pasture for grazing their animals. These nomads are considered to be expert in making goods of iron. Some moments are salt traders fortune tellers jugglers acrobats. Snake charmers grindstone makers and basket makers also. Children the handicraft work and the tie and dye of rajasthan is very popular not only in india but also in abroad. And is a great source of earning as well. This is one of the many important aspects of the thar desert. Let's understand some more points of importance of the great indian desert. So the first point is the beauty of this region. The tourists from within the country as well as from abroad. Come and visit this place attracted by its beauty. The desert is also very famous for its lively festivals such as teej gangor pushkar fair at 17. People visit here to witness and enjoy this festival. This region is also known for its vibrant colourful traditional clothing and attractive native jewelries. Jaipur jaisalmer jodhpur bikaner and udaipur are important cities of the thar desert. 10 places of many historical and tourist sites. Therefore many tourists from india and abroad visit here. Not only this the region is also has also many wildlife sanctuaries such as ranthambore sariska bharatpur. Which provide shelter to many wild animals as well as birds such as tigers panthers deer it sector. These wildlife sanctuaries are also a great attraction for people to visit here. The region is also quite popular for the beautiful historic grand palaces and forts. Which was built by the rajput kings. Does rajasthan becomes one of the most popular tourist destination of india where. Both domestic and international tourists arrive. Now let's understand. The climate of this region. Saathiya children the climate of the great indian desert is extremely hot in the summer and extremely cold during the winter. It is because of the presence of sand. The send has the feature that it absorbs heat very fast so the days are very hot. And in the same way it cools down very fast. Tu. Making the nights very cold. And the amount of rainfall in this in the desert is generally quite low. So this was about the thar desert or the great indian desert. Hope you liked the video and found it useful. Don't forget to subscribe the channel. Thank you. ",
    "domain": "Geography",
    "video": {
      "Path": [
        "The Great Indian Desert\\keyframes\\The Great Indian Desert.mkv"
      ],
      "File_Name": [
        "The Great Indian Desert"
      ],
      "Video_URL_Path": [
        "The%20Great%20Indian%20Desert.mkv"
      ],
      "Video_URL_FullPath": [
        "C%3A/Users/Makonis/PycharmProjects/newvrs/The%20Great%20Indian%20Desert/keyframes/The%20Great%20Indian%20Desert.mkv"
      ],
      "Full_Path": [
        "C:\\\\Users\\\\Makonis\\\\PycharmProjects\\\\newvrs\\\\The Great Indian Desert\\\\keyframes\\\\The Great Indian Desert.mkv"
      ],
      "Duration": [
        "00:09:59"
      ]
    },
    "title": "Indian Desert",
    "chapters_list": {
      "1": [
        "00:00:00",
        "00:00:25",
        "['GREATINDIAN DESERT', 'DESERT', 'KIRAN JOSHI', 'GREATINDIAN', 'PRESENTED']",
        "THE GREATINDIAN DESERT"
      ],
      "2": [
        "00:00:25",
        "00:01:44",
        "['little rainfall', 'receives very', 'very little', 'Great Indian', 'rainfall']",
        "A desert is an area"
      ],
      "3": [
        "00:01:44",
        "00:02:31",
        "['Thar desert', 'sand dunes', 'very vast', 'small hills', 'River Luni']",
        "Thar desert"
      ],
      "4": [
        "00:02:31",
        "00:03:31",
        "['people used', 'olden days', 'used camel', 'people', 'transport']",
        "people used"
      ],
      "5": [
        "00:03:31",
        "00:04:16",
        "['babool etc', 'Very few', 'like cactus', 'keekar', 'Very']",
        "Very few plants like"
      ],
      "6": [
        "00:04:16",
        "00:04:56",
        "['underground water', 'water comes', 'oases', 'places', 'surface']",
        "underground water"
      ],
      "7": [
        "00:04:56",
        "00:05:26",
        "['Indira Gandhi', 'Gandhi Canal', 'water shortage', 'Gandhi', 'Canal gets']",
        "Indira Gandhi"
      ],
      "8": [
        "00:05:26",
        "00:06:16",
        "['under cultivation', 'great extent', 'large area', 'brought under', 'canal water']",
        "cultivation"
      ],
      "9": [
        "00:06:16",
        "00:07:02",
        "['Many people', 'nomads here', 'here who', 'Many', 'move']",
        "Many people"
      ],
      "10": [
        "00:07:02",
        "00:07:22",
        "['Rajasthan', 'dye', 'known', 'handicrafts', 'tie']",
        "Rajasthan"
      ],
      "11": [
        "00:07:22",
        "00:07:24",
        "['THAR DESERT', 'IMPORTANCE', 'THAR', 'DESERT', 'Pushkar Fair']",
        "THAR DESERT - IMPORTANCE"
      ],
      "12": [
        "00:07:24",
        "00:07:54",
        "['THAR DESERT', 'IMPORTANCE', 'THAR', 'DESERT', 'Pushkar Fair']",
        "THAR DESERT - IMPORTANCE"
      ],
      "13": [
        "00:07:54",
        "00:08:20",
        "['THAR DESERT', 'IMPORTANCE', 'THAR', 'DESERT', 'Jaisalmer']",
        "THAR DESERT - IMPORTANCE"
      ],
      "14": [
        "00:08:20",
        "00:08:25",
        "['THAR DESERT', 'IMPORTANCE', 'THAR', 'DESERT', 'DELHS']",
        "THAR DESERT - IMPORTANCE"
      ],
      "15": [
        "00:08:25",
        "00:08:45",
        "['THAR DESERT', 'IMPORTANCE', 'THAR', 'DESERT', 'DELHE']",
        "THAR DESERT - IMPORTANCE"
      ],
      "16": [
        "00:08:45",
        "00:09:10",
        "['THAR DESERT', 'IMPORTANCE', 'THAR', 'DESERT', 'Rajput kings']",
        "THAR DESERT -IMPORTANCE"
      ],
      "17": [
        "00:09:10",
        "00:09:59",
        "['CLIMATE', 'extreme climate', 'Rainfall', 'extremely hot', 'very']",
        "CLIMATE"
      ]
    },
    "faculty": "Kumar",
    "video_ID": 0
  },
  {
    "image_metadata": {
      "1": [
        "001.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\001.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\001.jpg"
      ],
      "2": [
        "002.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\002.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\002.jpg"
      ],
      "3": [
        "003.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\003.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\003.jpg"
      ],
      "4": [
        "004.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\004.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\004.jpg"
      ],
      "5": [
        "005.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\005.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\005.jpg"
      ],
      "6": [
        "006.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\006.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\006.jpg"
      ],
      "7": [
        "007.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\007.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\007.jpg"
      ],
      "8": [
        "008.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\008.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\008.jpg"
      ],
      "9": [
        "009.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\009.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\009.jpg"
      ],
      "10": [
        "010.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\010.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\010.jpg"
      ],
      "11": [
        "011.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\011.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\011.jpg"
      ],
      "12": [
        "012.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\012.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\012.jpg"
      ],
      "13": [
        "013.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\013.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\013.jpg"
      ],
      "14": [
        "014.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\014.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\014.jpg"
      ],
      "15": [
        "015.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\015.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\015.jpg"
      ],
      "16": [
        "016.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\016.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\016.jpg"
      ],
      "17": [
        "017.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\017.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\017.jpg"
      ],
      "18": [
        "018.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\018.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\018.jpg"
      ],
      "19": [
        "019.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\019.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\019.jpg"
      ],
      "20": [
        "020.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\020.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\020.jpg"
      ],
      "21": [
        "021.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\021.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\021.jpg"
      ],
      "22": [
        "022.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\022.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\022.jpg"
      ],
      "23": [
        "023.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\023.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\023.jpg"
      ],
      "24": [
        "024.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\024.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\024.jpg"
      ],
      "25": [
        "025.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\025.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\025.jpg"
      ],
      "26": [
        "026.jpg",
        ".jpg",
        "Judiciary\\image_metadata\\026.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Judiciary\\image_metadata\\026.jpg"
      ]
    },
    "keywords": {
      "keywords_TFIDF": [
        "court",
        "judiciary",
        "judicial",
        "laxman",
        "review",
        "india",
        "state",
        "high",
        "law",
        "supreme",
        "sudha",
        "power",
        "right",
        "fundamental",
        "independent",
        "constitution",
        "structure",
        "explain",
        "term",
        "kumar"
      ]
    },
    "audio_transcript": "Judiciary\n\nHello everyone. I am kiran joshi. Hope you all are safe and sound. Children this is the first video of class 8 civics chapter 5 judiciary. As we have learnt previously that in india we have the rule of law means laws apply equally. And if a law is violated a certain set of fixed procedures need to be followed. Children for the enforcement of law we have a judicial system. This judicial system consists of courts and when a law is violated. Citizens can approach to these codes. Judiciary is an independent organ of the indian state. What is an indian what is an independent judiciary. And what is its role in democracy let's find out the answers of these questions. This video. There are numbers of issues or matters on which courts take decisions. The work of the judiciary or the judicial system can be divided into. 1. Dispute resolution. Second judicial review and third upholding the law and enforcing fundamental rights. Let's take the first point. That is dispute resolution. Are judicial system offers a mechanism for process. To resolve disputes. Which may occur. Between citizens. Between citizens and government and the government. Between two state governments. And between the centre and state governments. Now the second task of our judiciary that is. Judicial review. Children are judiciary is the final interpreter of the constitution. Therefore it has the power to cancel a law passed by the parliament. Declaring it. Is illegal and unenforceable if it believes that the law is not in accordance with the intention of the constitution. Aur it violates the basic structure of the constitution. It is called judicial review. The third task of the judiciary is to uphold the law and enforce. Fundamental rights. Children every citizen of india can move to the court if they believe that their fundamental rights have been violated. If you remember you learnt in class 7. The story of hakim sheikh. Who was severely injured after falling from a running train and who was denied to be admitted in several government hospitals. The supreme court ruled in his case that fundamental right. Of right to life. Also include right to health. And directed the west bengal government. To pay hacking hacking check. Compensation for the loss he suffered. This was the clear example of upholding the law and enforcing fundamental rights. By the judiciary. Now let's understand the meaning of an independent judiciary. Suppose there is a judicial system in which a politician has the power that he can appoint as well as dismiss a judge from. His office that means the jaj office. Now in such a system. If a powerful powerful politician. Encroaches on your land. And you take this case. Of encroachment to court. Definitely the judge would be partial to the politician. Because he has the control over the judge. Therefore the judge cannot take independent decision. Because the judge is not independent. And is under the control of the politician. It would force the judge to make all judgements. In favour of the politician. But in but the indian constitution protects against this kind of situation. By providing for the independence. Of the judiciary. One aspect of the independence of indian judiciary is the separation of powers. Which is a key feature of the constitution. It means. That the other two branches of the state. The legislature and the executive. Cannot interpret interfere in the work of judiciary. Judiciary is not under the government and does not act on their behalf. Now this separation of parts. Is effective only when the appointment of the judges in the high court and the supreme court. Is done without or with very little interference of the legislature and executive. After their appointment. The judges of high court and supreme court. Can not easily be removed from the office. Is the judiciary is independent and not under the influence of legislature and executive. The courts can play an important and main role. To ensure that these two branches of the government don't misuse their parts. The judiciary also plays an important role in protecting the fundamental rights of citizens. As mentioned i mentioned earlier that they can approach. The court if they believe. That their rights have been violated. Now let's understand the structure of indian judiciary. The judiciary is. Organised hierarchy. Which has three different levels. As shown here in front of you. At the top supreme court then high court and the lower level subordinate or district court. At the low level these are there are several codes these codes are called the a subordinate or district courts. Children the states are divided into districts and each district has a district court. The district court and the courts below it are called subordinate courts. These codes are of two types civil court which deal civil court switch deal with. Civil cases and criminal courts which deal with criminal cases. These codes are presided over by a district judge. Children most. People interact with this quotes. Vidya different kinds of cases. Most of the states have a high court. Which with which is the highest court. Of the state. The high court deals with all cases that are under the jurisdiction of the. State. At the top. Is the at the top of the hierarchy structure of judiciary is the supreme court. Which is the highest court in india. It is located in new delhi and is presided over by the chief justice of india that means. Chief justice of india is the head of the supreme court. The decisions given by the supreme court are binding on all other courts in india that means the judgement. Given has to be accepted by the other courts in of india. Children the indian judiciary is. Single. Integrated and unified. The different levels of courts are connected to each other. And the decisions made by higher courts are binding on the lower courts. This integration can also be understood by the appellate system. Apple system means if a person believes. That the judgement given by the lower court is not just. Aur a person is not satisfied with the judgement. Judgement given by a lower court. He or she can appeal to a higher court. Let's understand this applet system through a case. This case is. State delhi administration vs laxman kumar and others 1985. Which was. Tried from lower courts. To the supreme court. In february 1980 laxman kumar married sudha goel and live in a flat in delhi. With lakshman brothers and their families. On 2nd december 1980 sudha died in hospital due to burns. Sudhar family file decrease in the trial court. Trial court is another name for subordinate court. Photo hearing of the case. Ore of her neighbours were called. Call din as witnesses. Day told the court that on the night of 1st december when they heard sudha screen. They forced their way into lakshman flat and found sudha standing with her saree in flames. The neighbours stated that they read sudha in a gunny bag and and a blanket to extinguish the fire. Sudha told neighbours. That her mother in law shakuntala. Had poured kerosene oil on her and that her husband lakshman head the fire. ",
    "domain": "Law",
    "video": {
      "Path": [
        "Judiciary\\keyframes\\Judiciary.mkv"
      ],
      "File_Name": [
        "Judiciary"
      ],
      "Video_URL_Path": [
        "Judiciary.mkv"
      ],
      "Video_URL_FullPath": [
        "C%3A/Users/Makonis/PycharmProjects/newvrs/Judiciary/keyframes/Judiciary.mkv"
      ],
      "Full_Path": [
        "C:\\\\Users\\\\Makonis\\\\PycharmProjects\\\\newvrs\\\\Judiciary\\\\keyframes\\\\Judiciary.mkv"
      ],
      "Duration": [
        "00:12:50"
      ]
    },
    "title": "Judiciary",
    "chapters_list": {
      "2": [
        "00:00:11",
        "00:00:56",
        "['India,we have', 'law', 'India,we', 'rule', 'India democracy']",
        "India"
      ],
      "3": [
        "00:00:56",
        "00:01:18",
        "['ROLE', 'JUDICIARY', 'Law', 'Dispute', 'Judicial']",
        "ROLE OE THE JUDICIARY"
      ],
      "4": [
        "00:01:18",
        "00:01:40",
        "['DISPUTE RESOLUTION', 'RESOLUTION', 'resolving disputes', 'between', 'disputes between']",
        "DISPUTE RESOLUTION"
      ],
      "5": [
        "00:01:40",
        "00:01:45",
        "['JUDICIAL REVIEW', 'JUDICIAL', 'REVIEW', 'Constitution', 'final interpreter']",
        "JUDICIAL REVIEW"
      ],
      "6": [
        "00:01:45",
        "00:02:05",
        "['JUDICIAL REVIEW', 'JUDICIAL', 'REVIEW', 'Constitution', 'final interpreter']",
        "JUDICIAL REVIEW"
      ],
      "7": [
        "00:02:05",
        "00:02:13",
        "['JUDICIAL REVIEW', 'JUDICIAL', 'REVIEW', 'Constitution', 'final interpreter']",
        "JUDICIAL REVIEW"
      ],
      "8": [
        "00:02:13",
        "00:02:15",
        "['Enforcing', 'Law', 'Upholding', 'High Court', 'Court']",
        "Enforcing"
      ],
      "9": [
        "00:02:15",
        "00:02:20",
        "['Enforcing', 'Law', 'Upholding', 'High Court', 'Court']",
        "Enforcing"
      ],
      "10": [
        "00:02:20",
        "00:03:14",
        "['Enforcing', 'Law', 'Upholding', 'High Court', 'Court']",
        "Enforcing"
      ],
      "11": [
        "00:03:14",
        "00:04:22",
        "['INDEPENDENT JUDICIARY', 'Indian Constitution', 'JUDICIARY', 'independent decisions', 'INDEPENDENT']",
        "INDEPENDENT JUDICIARY"
      ],
      "12": [
        "00:04:22",
        "00:05:16",
        "['INDEPENDENT JUDICIARY', 'One aspect', 'cannot interfere', 'JUDICIARY', 'INDEPENDENT']",
        "INDEPENDENT JUDICIARY"
      ],
      "13": [
        "00:05:16",
        "00:05:53",
        "['INDEPENDENT JUDICIARY', 'Fundamental Rights', 'INDEPENDENT', 'JUDICIARY', 'courts play']",
        "INDEPENDENT JUDICIARY"
      ],
      "14": [
        "00:05:53",
        "00:06:17",
        "['STRUCTURE', 'INDIA', 'COURT', 'HIGH COURT', 'SUPREME']",
        "STRUCTURE OF COURTS IN INDIA"
      ],
      "15": [
        "00:06:17",
        "00:07:01",
        "['DISTRICTCOURT', 'SUBORDINATE', 'district', 'courts', 'level']",
        "SUBORDINATE/DISTRICTCOURT"
      ],
      "16": [
        "00:07:01",
        "00:07:21",
        "['HIGH COURT', 'COURT', 'HIGH', 'state', 'highest court']",
        "HIGH COURT"
      ],
      "17": [
        "00:07:21",
        "00:07:56",
        "['SUPREME COURT', 'SUPREME', 'New Delhi', 'Chief Justice', 'COURT']",
        "SUPREME COURT"
      ],
      "18": [
        "00:07:56",
        "00:08:38",
        "['India,we have', 'integrated judicial', 'different levels', 'judicial system', 'India,we']",
        "India"
      ],
      "19": [
        "00:08:38",
        "00:09:29",
        "['STATE', 'DELHLADMINISTRATION', 'LAXMAN KUMAR', 'LAXMAN', 'KUMAR']",
        "STATE (DELHLADMINISTRATION) VS"
      ],
      "20": [
        "00:09:29",
        "00:10:03",
        "['STATE', 'DELHLADMINISTRATION', 'Sudha', 'LAXMAN KUMAR', 'her']",
        "STATE (DELHLADMINISTRATION) VS"
      ],
      "21": [
        "00:10:03",
        "00:10:45",
        "['STATE', 'DELHLADMINISTRATION', 'Sudha', 'LAXMAN KUMAR', 'Subhash Chandra']",
        "STATE (DELHLADMINISTRATION) VS"
      ],
      "22": [
        "00:10:45",
        "00:11:05",
        "['STATE', 'DELHLADMINISTRATION', 'LAXMAN KUMAR', 'Court', 'LAXMAN']",
        "STATE (DELHLADMINISTRATION) VS"
      ],
      "23": [
        "00:11:05",
        "00:12:08",
        "['Supreme Court', 'High Court', 'Court', 'STATE', 'DELHLADMINISTRATION']",
        "STATE (DELHLADMINISTRATION) VS"
      ],
      "24": [
        "00:12:08",
        "00:12:12",
        "['Judicial Review', 'QUESTIONS', 'REVISION', 'term Judicial', 'Indian Judiciary']",
        "QUESTIONS FOR REVISION"
      ],
      "25": [
        "00:12:12",
        "00:12:42",
        "['Judicial Review', 'QUESTIONS', 'REVISION', 'Indian Judiciary', 'Explain']",
        "QUESTIONS FOR REVISION"
      ],
      "26": [
        "00:12:42",
        "00:12:50",
        "['Judicial Review', 'QUESTIONS', 'REVISION', 'Indian Judiciary', 'Explain']",
        "QUESTIONS FOR REVISION"
      ]
    },
    "faculty": "Sharma",
    "video_ID": 1
  },
  {
    "image_metadata": {
      "1": [
        "001.jpg",
        ".jpg",
        "The Coastal Plains and Islands\\image_metadata\\001.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Coastal Plains and Islands\\image_metadata\\001.jpg"
      ],
      "2": [
        "002.jpg",
        ".jpg",
        "The Coastal Plains and Islands\\image_metadata\\002.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Coastal Plains and Islands\\image_metadata\\002.jpg"
      ],
      "3": [
        "003.jpg",
        ".jpg",
        "The Coastal Plains and Islands\\image_metadata\\003.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Coastal Plains and Islands\\image_metadata\\003.jpg"
      ],
      "4": [
        "004.jpg",
        ".jpg",
        "The Coastal Plains and Islands\\image_metadata\\004.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Coastal Plains and Islands\\image_metadata\\004.jpg"
      ],
      "5": [
        "005.jpg",
        ".jpg",
        "The Coastal Plains and Islands\\image_metadata\\005.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Coastal Plains and Islands\\image_metadata\\005.jpg"
      ],
      "6": [
        "006.jpg",
        ".jpg",
        "The Coastal Plains and Islands\\image_metadata\\006.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Coastal Plains and Islands\\image_metadata\\006.jpg"
      ],
      "7": [
        "007.jpg",
        ".jpg",
        "The Coastal Plains and Islands\\image_metadata\\007.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Coastal Plains and Islands\\image_metadata\\007.jpg"
      ],
      "8": [
        "008.jpg",
        ".jpg",
        "The Coastal Plains and Islands\\image_metadata\\008.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Coastal Plains and Islands\\image_metadata\\008.jpg"
      ],
      "9": [
        "009.jpg",
        ".jpg",
        "The Coastal Plains and Islands\\image_metadata\\009.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Coastal Plains and Islands\\image_metadata\\009.jpg"
      ],
      "10": [
        "010.jpg",
        ".jpg",
        "The Coastal Plains and Islands\\image_metadata\\010.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Coastal Plains and Islands\\image_metadata\\010.jpg"
      ],
      "11": [
        "011.jpg",
        ".jpg",
        "The Coastal Plains and Islands\\image_metadata\\011.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Coastal Plains and Islands\\image_metadata\\011.jpg"
      ],
      "12": [
        "012.jpg",
        ".jpg",
        "The Coastal Plains and Islands\\image_metadata\\012.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Coastal Plains and Islands\\image_metadata\\012.jpg"
      ],
      "13": [
        "013.jpg",
        ".jpg",
        "The Coastal Plains and Islands\\image_metadata\\013.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Coastal Plains and Islands\\image_metadata\\013.jpg"
      ],
      "14": [
        "014.jpg",
        ".jpg",
        "The Coastal Plains and Islands\\image_metadata\\014.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Coastal Plains and Islands\\image_metadata\\014.jpg"
      ],
      "15": [
        "015.jpg",
        ".jpg",
        "The Coastal Plains and Islands\\image_metadata\\015.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Coastal Plains and Islands\\image_metadata\\015.jpg"
      ],
      "16": [
        "016.jpg",
        ".jpg",
        "The Coastal Plains and Islands\\image_metadata\\016.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Coastal Plains and Islands\\image_metadata\\016.jpg"
      ],
      "17": [
        "017.jpg",
        ".jpg",
        "The Coastal Plains and Islands\\image_metadata\\017.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Coastal Plains and Islands\\image_metadata\\017.jpg"
      ],
      "18": [
        "018.jpg",
        ".jpg",
        "The Coastal Plains and Islands\\image_metadata\\018.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Coastal Plains and Islands\\image_metadata\\018.jpg"
      ],
      "19": [
        "019.jpg",
        ".jpg",
        "The Coastal Plains and Islands\\image_metadata\\019.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Coastal Plains and Islands\\image_metadata\\019.jpg"
      ],
      "20": [
        "020.jpg",
        ".jpg",
        "The Coastal Plains and Islands\\image_metadata\\020.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Coastal Plains and Islands\\image_metadata\\020.jpg"
      ],
      "21": [
        "021.jpg",
        ".jpg",
        "The Coastal Plains and Islands\\image_metadata\\021.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Coastal Plains and Islands\\image_metadata\\021.jpg"
      ],
      "22": [
        "022.jpg",
        ".jpg",
        "The Coastal Plains and Islands\\image_metadata\\022.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\The Coastal Plains and Islands\\image_metadata\\022.jpg"
      ]
    },
    "keywords": {
      "keywords_TFIDF": [
        "plain",
        "coastal",
        "coast",
        "island",
        "eastern",
        "western",
        "many",
        "konkan",
        "along",
        "india",
        "gujarat",
        "sea",
        "bay",
        "indian",
        "west",
        "bengal",
        "port",
        "gulf",
        "nicobar",
        "water"
      ]
    },
    "audio_transcript": "The Coastal Plains and Islands\n\nHello everyone i am kiran joshi hope you all are fit and fine. Inner journey of physical divisions of india let's learn about the coastal plains and islands of india. This video. Look at the map in front of you. You will notice to strips of plains along the east and west coast of india. These are the coastal plains of india. Children a coast is the area or the land where it meets the sea or the ocean. You can also see that a ghost is a line that makes the boundary between the land and the sea or the ocean. So children our country has a long and beautiful coastline which extends for about 7,000 km from rann of kutch in the west. West bengal in the east. It means it stretches all around the indian peninsula. The coastal plains are broadly divided into the western coastal plains and the eastern coastal plains. So let's begin with the western coastal plains. The western coastal plains are located between the western ghats and the arabian sea. The western coastal plain is long and narrow. As shown in the image also. The western coastal plains have many small girls and bays. Girls and bays are the different types of water bodies. These girls and base on the western coast provide many natural harbours. Harbour is an area of the sea along the coast which is deep enough and partly and closed by the land so that the ships of the boats can be left there safely. Some famous natural harbours in the western coastal plains are mumbai in maharashtra vasco in goa and kochi in kerala. Also there are several ports on the western coastal plains. A port is a town or a city that develops around a harbour where ships load and unload their cargo and passengers. The western coastal plains can be divided into three parts. Gujarat coast. Konkan coast and the malabar coast. The northernmost part of the western coastal plains is the gujarat coast. If you look closely to the given image you will see children. That it is. Broadest between the gulf of kutch and the gulf of khambhat. As i said earlier that a girl is a type of water body. To make the term more clear to you i can see that a girl is a large area of sea or ocean water which is partly surrounded by land. To the south of the gujarat coast lies in the konkan coast. Konkan coast is stretched up to goa. Kumkum cost is. Quite narrow rocky and uneven. Therefore we find many lighthouses across the coast to warn the ships so that they may remain away from the rocks that lie just beneath the surface of the sea. You will be curious to know. The meaning of the term lighthouse so children look at the image in front of you. It is the image of a lighthouse. A lighthouse is a town or visit our autol building. With the powerful light on or near the sea to guide ships away from the danger. The konkan coast is rich in oil resources. And many oil wells such as bombay high court found here. 22 further south lies the malabar coast. The coastline here has an even edges. Malabar coast is known for its numerous lagoons or backwaters. Children a lagoon is a lake of salt water which gets separated from the sea by barrier islands or leaves. Now let's learn about the eastern coastal plains. The children the eastern coastal plains are located between the bay of bengal and the eastern ghats. The extent from ganga delta in the west bengal to kanyakumari in tamil nadu. The eastern coastal plains are comparatively broader than the western coastal plains. There are a number of southern rivers such as mahanadi godavari krishna and kaveri. That flow eastwards and fall into the bay of bengal. These rivers form deltas along the eastern coastal line. The learnt here is very fertile. Because of the mineral rich soil brought by these rivers. And a lot of rice is grown in this area. So just plane is also known as the rice bowl of india. The eastern coastal plains of india. Have many ports among which. Chennai and visakhapatnam aro. Great importance. The eastern coastal plains can be further divided into two parts the northern part is of the eastern coastal plain is called the northern circars and the southern part is called the coromandel coast. The eastern coastal plain and the western coastal plain meet at kanyakumari in tamil nadu. Kanyakumari is the southernmost point of the mainland of india. Another important fact about kanyakumari is. That at this place the three water bodies around india. The indian ocean the arabian sea and the bay of bengal meet. Two children. Sofa in this video we have learnt about the coastal plains of india. Now let's try to understand. Aur learn about the island groups of india. First of all let's understand the meaning of island. So and i let is a small piece of land. That is surrounded by water from all around such as a lake. River or sea. India has 2 island groups on both sides of the indian peninsula. These are the andaman and nicobar islands located in the bay of bengal and the lakshadweep island situated in the arabian sea. Andaman and nicobar islands. Lie in bay of bengal. Dr rafli 572 islands. Out of which. Only 38 islands are inhabited. A large part of the population consists of tribal groups. Port blair is the capital of andaman and nicobar islands. The famous cellular jail is also in andaman and nicobar islands. Andaman and nicobar islands are mostly hilly islands and are covered with forest. The lakshadweep islands lie in the arabian sea consisting of 36 islands. However only 11 islands are inhabited. Kavaratti is the capital of lakshadweep islands. The lakshadweep islands are generally flat these islands are well known for their coral deposits. You might be thinking of wondering what are corals so children corals are tiny sea creatures. With a hard body covering. Now let's learn about the importance of the indian coastal place and the island group. Several big and small ports are there along the coastal areas. D sports play an important role in the growth of natural a national and international trade. Then there are several harbours also. Then many coastal towns and cities are great attraction for tourists. Fishing is an is one of the important occupations for many people here. Many different types of crops are grown in this region for example rice coconut rubber et cetera. The island groups of india are very popular and attractive tourist spots. If we talk about the climate. This region has moderate climate. Because this region is quite close to the sea during the day it is warm and humid. How about the nights are mostly cool. The reason behind it is that at night the sea breeze blows. Towards the land from the sea. That's all for this chapter. Hope you found this video helpful. And if you like this video. Do remember to share and subscribe to the channel. Thank you. ",
    "domain": "Geography",
    "video": {
      "Path": [
        "The Coastal Plains and Islands\\keyframes\\The Coastal Plains and Islands.mkv"
      ],
      "File_Name": [
        "The Coastal Plains and Islands"
      ],
      "Video_URL_Path": [
        "The%20Coastal%20Plains%20and%20Islands.mkv"
      ],
      "Video_URL_FullPath": [
        "C%3A/Users/Makonis/PycharmProjects/newvrs/The%20Coastal%20Plains%20and%20Islands/keyframes/The%20Coastal%20Plains%20and%20Islands.mkv"
      ],
      "Full_Path": [
        "C:\\\\Users\\\\Makonis\\\\PycharmProjects\\\\newvrs\\\\The Coastal Plains and Islands\\\\keyframes\\\\The Coastal Plains and Islands.mkv"
      ],
      "Duration": [
        "00:09:06"
      ]
    },
    "title": "Coastal Plains and Islands",
    "chapters_list": {
      "1": [
        "00:00:00",
        "00:00:12",
        "['COASTAL PLAINS', 'COASTAL', 'ISLANDS', 'KIRAN JOSHI', 'PLAINS']",
        "COASTAL PLAINS AND ISLANDS"
      ],
      "2": [
        "00:00:12",
        "00:00:55",
        "['lie two', 'Coastal Plains', 'two strips', 'west coast', 'plains']",
        "lie two"
      ],
      "3": [
        "00:00:55",
        "00:00:56",
        "['Plains', 'Coastal', 'have', 'Western', 'Eastern']",
        "Plains"
      ],
      "4": [
        "00:00:56",
        "00:01:05",
        "['Plains', 'Coastal', 'have', 'Western', 'Eastern']",
        "Plains"
      ],
      "5": [
        "00:01:05",
        "00:01:28",
        "['WESTERN COASTAL', 'WESTERN', 'COASTAL PLAINS', 'COASTAL', 'Western Ghats']",
        "THE WESTERN COASTAL PLAINS"
      ],
      "6": [
        "00:01:28",
        "00:02:11",
        "['COASTAL PLAINS', 'WESTERN COASTAL', 'PLAINS', 'WESTERN', 'COASTAL']",
        "THE WESTERN COASTAL PLAINS"
      ],
      "7": [
        "00:02:11",
        "00:02:22",
        "['WESTERN COASTAL', 'COAST', 'WESTERN', 'COASTAL', 'PLAINS']",
        "WESTERN COASTAL"
      ],
      "8": [
        "00:02:22",
        "00:02:51",
        "['GUJARAT COAST', 'GUJARAT', 'COAST', 'gulf', 'Khambhat']",
        "GUJARAT COAST"
      ],
      "9": [
        "00:02:51",
        "00:03:03",
        "['KONKAN', 'KONKAN COAST', 'COAST', 'Goa', 'Coast extends']",
        "KONKAN COAST"
      ],
      "10": [
        "00:03:03",
        "00:03:04",
        "['COAST', 'KONKAN', 'KONKAN COAST', 'many', 'lighthouses along']",
        "KONKAN COAST"
      ],
      "11": [
        "00:03:04",
        "00:03:48",
        "['COAST', 'KONKAN', 'KONKAN COAST', 'many', 'lighthouses along']",
        "KONKAN COAST"
      ],
      "12": [
        "00:03:48",
        "00:04:11",
        "['MALABAR', 'MALABAR COAST', 'COAST', 'lagoons', 'backwaters']",
        "MALABAR COAST"
      ],
      "13": [
        "00:04:11",
        "00:04:28",
        "['EASTERN COASTAL', 'COASTAL PLAINS', 'EASTERN', 'COASTAL', 'Eastern Ghats']",
        "THE EASTERN COASTAL PLAINS"
      ],
      "14": [
        "00:04:28",
        "00:05:17",
        "['EASTERN COASTAL', 'COASTAL PLAINS', 'COASTAL', 'Krishna', 'Mahanadi']",
        "THE EASTERN COASTAL PLAINS"
      ],
      "15": [
        "00:05:17",
        "00:05:32",
        "['EASTERN COASTAL', 'COASTAL PLAINS', 'EASTERN', 'PLAINS', 'COASTAL']",
        "EASTERN COASTAL PLAINS"
      ],
      "16": [
        "00:05:32",
        "00:05:56",
        "['Western Coastal', 'Coastal Plains', 'Indian peninsula', 'southernmost point', 'Plains meet']",
        "Western Coastal"
      ],
      "17": [
        "00:05:56",
        "00:06:35",
        "['THEISLANDS', 'islands', 'INDIA', 'GROUPS', 'Small pieces']",
        "THEISLANDS"
      ],
      "18": [
        "00:06:35",
        "00:07:09",
        "['ANDAMAN', 'ISLANDS', 'NICOBAR ISLANDS', 'NICOBAR', 'Bengal']",
        "THE ANDAMAN AND NICOBAR ISLANDS"
      ],
      "19": [
        "00:07:09",
        "00:07:38",
        "['LAKSHADWEEP ISLANDS', 'Arabian Sea', 'LAKSHADWEEP', 'ISLANDS', 'Sea']",
        "THE LAKSHADWEEP ISLANDS"
      ],
      "20": [
        "00:07:38",
        "00:08:29",
        "['COASTAL PLAINS', 'IMPORTANCE', 'PLAINS', 'COASTAL', 'ISLANDS']",
        "IMPORTANCE OF THE COASTAL PLAINS"
      ],
      "21": [
        "00:08:29",
        "00:08:59",
        "['CLIMATE', 'moderate climate', 'coastal plains', 'plains have', 'have moderate']",
        "CLIMATE"
      ],
      "22": [
        "00:08:59",
        "00:09:06",
        "['Thank']",
        "Thank"
      ]
    },
    "faculty": "Singh",
    "video_ID": 4
  },
  {
    "image_metadata": {
      "1": [
        "001.jpg",
        ".jpg",
        "Constitution of india\\image_metadata\\001.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Constitution of india\\image_metadata\\001.jpg"
      ],
      "2": [
        "002.jpg",
        ".jpg",
        "Constitution of india\\image_metadata\\002.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Constitution of india\\image_metadata\\002.jpg"
      ],
      "3": [
        "003.jpg",
        ".jpg",
        "Constitution of india\\image_metadata\\003.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Constitution of india\\image_metadata\\003.jpg"
      ],
      "4": [
        "004.jpg",
        ".jpg",
        "Constitution of india\\image_metadata\\004.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Constitution of india\\image_metadata\\004.jpg"
      ],
      "5": [
        "005.jpg",
        ".jpg",
        "Constitution of india\\image_metadata\\005.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Constitution of india\\image_metadata\\005.jpg"
      ],
      "6": [
        "006.jpg",
        ".jpg",
        "Constitution of india\\image_metadata\\006.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Constitution of india\\image_metadata\\006.jpg"
      ],
      "7": [
        "007.jpg",
        ".jpg",
        "Constitution of india\\image_metadata\\007.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Constitution of india\\image_metadata\\007.jpg"
      ],
      "8": [
        "008.jpg",
        ".jpg",
        "Constitution of india\\image_metadata\\008.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Constitution of india\\image_metadata\\008.jpg"
      ],
      "9": [
        "009.jpg",
        ".jpg",
        "Constitution of india\\image_metadata\\009.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Constitution of india\\image_metadata\\009.jpg"
      ],
      "10": [
        "010.jpg",
        ".jpg",
        "Constitution of india\\image_metadata\\010.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Constitution of india\\image_metadata\\010.jpg"
      ],
      "11": [
        "011.jpg",
        ".jpg",
        "Constitution of india\\image_metadata\\011.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Constitution of india\\image_metadata\\011.jpg"
      ],
      "12": [
        "012.jpg",
        ".jpg",
        "Constitution of india\\image_metadata\\012.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Constitution of india\\image_metadata\\012.jpg"
      ],
      "13": [
        "013.jpg",
        ".jpg",
        "Constitution of india\\image_metadata\\013.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Constitution of india\\image_metadata\\013.jpg"
      ]
    },
    "keywords": {
      "keywords_TFIDF": [
        "constitution",
        "state",
        "amendment",
        "india",
        "assembly",
        "parliament",
        "government",
        "list",
        "structure",
        "federal",
        "act",
        "elected",
        "union",
        "legislative",
        "minister",
        "member",
        "part",
        "must",
        "passed",
        "majority"
      ]
    },
    "audio_transcript": "Constitution of india\n\nGood morning everyone. Today we are celebrating 73rd. Republic day. And i would like to wish each and everyone. Happy republic day. On this occasion i would like to present a powerpoint presentation on constitution of india structure and features. Flow of presentation background. Drafting structure. Paath said use and system of government. Silent features of the constitution of india. Changing the constitution. Background. The constitution of india was adopted on 26th november 1949. And came into effect on 26 january 1950. Proclaiming india to be a sovereign. Democratic republic the federal structure of government. Provincial autonomy. A bi carmel central legislature. Consisting of a federal assembly and council of states and the separation of legislative power between the centre and the state are some of the provinces of at which are present in the constitution of india. Drafting the constitution was drafted by the constituent assembly. Which was elected by the elected members of the provincial assemblies. Dr br ambedkar sanjay faki. Jawaharlal nehru c rajagopalachari. Rajendra prasad. Sardar vallabhbhai patel maulana abdul kalam azad was some important figures in the assembly. The members of the constituent assembly met for the first time on december 1946. On 29th august 1947 the drafting committee was appointed. Dr br ambedkar as the chairman along with other members assisted by a constitutional advisor. Structure of the constitution in its current form september 2012 consists of a parable. 25 parts containing 463 articles. 12 schedules to appendices and 97 amendments to date. Latest being related to cooperative societies added in part 9 b. In 2012. Indian constitution is federal in nature and also has a strong unitary bias 22 parts 395 articles 12 schedules to appendices 92 amendments system of government the basic form of the union government. And we says in the constitution. Federal structure three subject list. The union list state list and the concurrent list define the legislative power of each level of government. The union government reserves the right to make laws in areas specified on the union list the state governments allowed to make laws in areas specified on the state list. Parliamentary democracy. The president of india is elected by the parliament. And state legislative assembly. And not directly by the paper. The president is the head of state. And all the business of executive and laws of the parliament. Are in his her name. The prime minister and the council of ministers exercise their offices only as long as they enjoy a majority support in the lok sabha. The lower house of the parliament which consists of members directly elected by the people. A similar structure is present in state. Back the directly elected legislative assembly enjoys control over the chief minister and the state council of ministers. Independent judiciary. The judiciary of india is free of control from either the executive or the parliament the judiciary act as an interpreter of the constitution and as an intern. Intermediary in case of dispute between two states or between a state and the union. An act passed by the parliament or a legislative assembly is subject to judicial review. And can be declared unconstitutional by the judiciary if it feels that act violates the provinces of the constitution. Silent features of the constitution. There are. Live in silent features. Of the constitution in india. Number 1 longest written constitution. Number 2 best constitution number 3 a written and rigid constitution number 4. Based on adult search page number 5. It makes india a sovereign democratic republic number 6 it gives india a federal policy number 7 it establishes parliamentary form of government in india. Number 8 fundamental rights number 9 fundamental duties number 10 directive principle of state policy number 11 secular democracy. Changing the constitution. Amendments to the constitution are made by the parliament. The procedure for which is laid out in article 368. Amendment bill must be passed by both the houses of the parliament. By a two-thirds majority and voting. In addition to this certain amendment which treating to the federal nature of the constitution must be rectified by a majority of state legislature as of january 2012 there have been 115 amendment bills presented in the parliament. Out of which 97 have been passed to become amendment. Most of these amendments address issues dealt with price catches in other democracy. The supreme court has ruled in kesavar vandana bharati v state of kerala case that not every constitutional amendment his premise table. The amendment must respect the basic structure of the constitution. Which is immutable. In 2000 the national commission to review the working of the constitution was set up to look into updating the constitution. Thank you. And once again i would wish to. Happy republic day. Jay hind. ",
    "domain": "Law",
    "video": {
      "Path": [
        "Constitution of india\\keyframes\\Constitution of india.mkv"
      ],
      "File_Name": [
        "Constitution of india"
      ],
      "Video_URL_Path": [
        "Constitution%20of%20india.mkv"
      ],
      "Video_URL_FullPath": [
        "C%3A/Users/Makonis/PycharmProjects/newvrs/Constitution%20of%20india/keyframes/Constitution%20of%20india.mkv"
      ],
      "Full_Path": [
        "C:\\\\Users\\\\Makonis\\\\PycharmProjects\\\\newvrs\\\\Constitution of india\\\\keyframes\\\\Constitution of india.mkv"
      ],
      "Duration": [
        "00:07:08"
      ]
    },
    "title": "Constitution",
    "chapters_list": {
      "1": [
        "00:00:00",
        "00:00:23",
        "['COMSTTTUTIONOFINDA', 'STRUCTUREANDFEATURES']",
        "COMSTTTUTIONOFINDA"
      ],
      "2": [
        "00:00:23",
        "00:00:37",
        "['FLOW OFPRESENTATION', 'FLOW', 'OFPRESENTATION', 'Parts', 'Background']",
        "FLOW OFPRESENTATION"
      ],
      "3": [
        "00:00:37",
        "00:01:16",
        "['BACKGROUND', 'India', 'Constitution', 'democratic republic', 'November']",
        "BACKGROUND"
      ],
      "4": [
        "00:01:16",
        "00:02:02",
        "['Constituent Assembly.which', 'Constituent Assembly', 'Constituent', 'Rajendra Prasad', 'Maulana Abul']",
        "DRAFTING"
      ],
      "5": [
        "00:02:02",
        "00:02:43",
        "['STRUCTURE', 'Constitution', 'current formSeptember', 'latest being', 'Indian constitution']",
        "STRUCTURE"
      ],
      "6": [
        "00:02:43",
        "00:03:17",
        "['Union Government', 'Union', 'State list', 'government', 'list']",
        "System of government:"
      ],
      "7": [
        "00:03:17",
        "00:04:07",
        "['Parliamentary Democracy', 'Parliamentary', 'Democracy', 'Parliament', 'State']",
        ". Parliamentary Democracy"
      ],
      "8": [
        "00:04:07",
        "00:04:47",
        "['Independent Judiciary', 'Independent', 'Judiciary', 'Legislative Assembly', 'Parliament']",
        ". Independent Judiciary"
      ],
      "9": [
        "00:04:47",
        "00:05:23",
        "['Salient Features', 'Features', 'India', 'constitution', 'Written']",
        "Salient Features"
      ],
      "11": [
        "00:05:35",
        "00:06:20",
        "['Constitution', 'Constitution must', 'Parliament', 'amendment', 'Amendment Acts']",
        "Changing the Constitution"
      ],
      "12": [
        "00:06:20",
        "00:06:55",
        "['address issues', 'issues dealt', 'Supreme Court', 'Kesavananda Bharati', 'amendments address']",
        "address issues"
      ],
      "13": [
        "00:06:55",
        "00:07:08",
        "['hank']",
        "hank"
      ]
    },
    "faculty": "Sharma",
    "video_ID": 5
  },
  {
    "image_metadata": {
      "1": [
        "001.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\001.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\001.jpg"
      ],
      "2": [
        "002.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\002.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\002.jpg"
      ],
      "3": [
        "003.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\003.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\003.jpg"
      ],
      "4": [
        "004.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\004.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\004.jpg"
      ],
      "5": [
        "005.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\005.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\005.jpg"
      ],
      "6": [
        "006.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\006.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\006.jpg"
      ],
      "7": [
        "007.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\007.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\007.jpg"
      ],
      "8": [
        "008.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\008.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\008.jpg"
      ],
      "9": [
        "009.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\009.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\009.jpg"
      ],
      "10": [
        "010.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\010.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\010.jpg"
      ],
      "11": [
        "011.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\011.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\011.jpg"
      ],
      "12": [
        "012.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\012.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\012.jpg"
      ],
      "13": [
        "013.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\013.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\013.jpg"
      ],
      "14": [
        "014.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\014.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\014.jpg"
      ],
      "15": [
        "015.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\015.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\015.jpg"
      ],
      "16": [
        "016.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\016.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\016.jpg"
      ],
      "17": [
        "017.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\017.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\017.jpg"
      ],
      "18": [
        "018.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\018.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\018.jpg"
      ],
      "19": [
        "019.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\019.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\019.jpg"
      ],
      "20": [
        "020.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\020.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\020.jpg"
      ],
      "21": [
        "021.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\021.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\021.jpg"
      ],
      "22": [
        "022.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\022.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\022.jpg"
      ],
      "23": [
        "023.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\023.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\023.jpg"
      ],
      "24": [
        "024.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\024.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\024.jpg"
      ],
      "25": [
        "025.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\025.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\025.jpg"
      ],
      "26": [
        "026.jpg",
        ".jpg",
        "Mineral and Power Resources\\image_metadata\\026.jpg",
        "C:\\Users\\Makonis\\PycharmProjects\\newvrs\\Mineral and Power Resources\\image_metadata\\026.jpg"
      ]
    },
    "keywords": {
      "keywords_TFIDF": [
        "mineral",
        "iron",
        "ferrous",
        "copper",
        "ore",
        "non",
        "deposit",
        "gold",
        "manganese",
        "metallic",
        "contain",
        "metal",
        "lead",
        "world",
        "example",
        "found",
        "india",
        "pradesh",
        "rock",
        "producer"
      ]
    },
    "audio_transcript": "Mineral and Power Resources\n\nHello everyone i am kiran joshi. Hope you all are safe and sound. Here i am presenting the first video of class 8 geography chapter 3 mineral and power resources. First of all. We should know what is a mineral. So its definition is. A mineral is a naturally occurring. That has a definite chemical composition. It means. Minerals occur naturally and are not made by humans. They are solid substances. Which are made of one or more elements combined together. Minerals are unevenly distributed on the earth. They are concentrated in a particular area or rock formation. There are some minerals which are found in such places which are difficult to access. For example the arctic ocean bed and antarctica. Children in such. Inaccessible places the extraction of minerals becomes. Very expensive or technically difficult. Therefore becomes an profitable. Definition of minerals we have already learnt. That minerals are formed naturally without any human interference. They are formed in various geological environment under different conditions. Do frocks. Which contain enough minerals so that mining dam is economically suitable are known as coarse. Minerals are identified through their physical properties. Such as colour density hardness. And chemical properties such as solubility. Children there are nearly 3000 different minerals. These minerals. On the basis of composition are classified mainly as metallic and nonmetallic minerals. Metallic minerals can further be classified as ferrous and non ferrous minerals and non metallic minerals may be organic and inorganic minerals. Metallic minerals contain metals in raw form. Now what are metals. Suchandan metals are hard. That conduct heat and electricity. Metals have a characteristic lustre. Aur shine. Iron ore. Copper manganese are some examples of metallic minerals. As i said earlier metallic minerals may be ferrous or nonferrous. Dose metallic minerals. That contain iron ore called ferrous minerals for example iron ore manganese chromite at 17. Non ferrous minerals are those metallic minerals which do not contain iron but. They may contain some other metals. For example gold silver copper these are the examples of non ferrous minerals. This was about the metallic minerals now the non metallic minerals as the name itself explains do not contain metals. Some examples of non metallic minerals are. Limestone mica gypsum and mineral fuels like coal petroleum et cetera. Now the non-metallic minerals are either organic or inorganic by origin. Non metallic minerals that contain carbon are. Organic myntra. For example. Coal natural gas petroleum. Why inorganic minerals do not contain carbon. Such as mica limestone graphite. No the question is how are the minerals extracted. Extraction of minerals can be done by mining drilling or query. Mining can be open cast mining or shaft mining. First let's understand what is mining. So my name is the process of taking out minerals from rocks. Buried under under the earth surface. Mining can be open cast mining and shaft mining as i said earlier. When the minerals that lie at shallow depths are extracted by removing the surface layer it is called open cast mining. And to reach mineral deposits. That lie deep below the earth's surface deboss called shafts are to be made this is known as shaft mining. Is petroleum and natural gas occur for below the surface of the earth. So to take them out deep wells are bored. It is called drilling. Drilling is also done offshore. When the minerals that lie near the surface are simply dug out. The process is called query. No let's see the distribution of minerals over the earth. Min minerals occur in different types of rock. Such as. Igneous rocks metamorphic rocks and sedimentary rocks. Mostly metallic minerals are found in igneous or metamorphic rocks. Which mate large plateau. Iron ore in the chota nagpur plateau in india iron ore in north sweden copper and nickel deposits in ontario canada. An iron ore nickel platinum and chromite in south africa these are some examples of minerals found both in igneous and metamorphic rocks. No sedimentary rocks. Which are formed along the plains and young fold mountains have. Deposits of non metallic minerals. Which may be organic or inorganic in origin. Limestone deposits in the pocket-size mountain in france. Magnus deposits in ukraine and georgia georgia. And the phosphate belts of algeria are some example. Of non metallic minerals. Mineral fuels like coal and petroleum are also found in between layers of sedimentary rocks. No let's see the distribution of minerals in different continents. Let's begin with asia. In asia which iron ore deposits are found in china and india. Asia produces more than 50% of the world's tin. China malaysia and indonesia are included among the world's leading producers of tin. China leads in production of lead. Antimony and tungsten. Saudi arabia. Iran iraq kuwait. They have world's largest reserves of petroleum and natural gas. The continent that means the asia continent also has large deposits of magnesium bauxite nickel zinc and copper. No ip talk about europe. So europe is one of the leading producers of iron ore in the world. Russia ukraine sweden and france. These are the european countries which have large deposits of iron ore. In eastern europe and eastern russia copper lead zinc. Magnesium and nickel are found. The root value of germany is rich in coal deposits. No let's find which minerals are found in north america. In north america there are three major zones where mineral deposits are found. Dr the canadian region north of the great lakes. The appalachian region and the mountain ranges of the west. In the canadian shield region iron ore nickel gold uranium and copper are mined. Rich coal deposits are found in the appalachian region. Western toddler car dealers have vast deposits of copper lead zinc. Gold and silver. No in south america. In south america brazil is the largest producer of high grade iron ore in the world. Chile and peru are leading producers of copper. Brazil and bolivia are among the world's largest producers of. Large posits of gold silver zinc. Chromium. Magnesium bauxite mica platinum. Asbestos and diamond. Are also found in south america. Mexico. Venezuela. Argentina chile peru and colombia these countries are rich in mineral oil. Next continent is africa this continent is rich in mineral resources. Africa is the world's largest producer of the. Precious minerals like diamond gold silver and platinum. A fairly large part of the world's gold is produced by south africa. Z. Ent zimbabwe. Some of the other minerals found in africa copper iron ore. Chromium uranium cobalt and bauxite. Oil is also found in sorry oil is found in nigeria libya and angola. Then comes australia continent which is one of the largest exporters. Of minerals. For example. It is the world's leader in the production of bauxite. Iron ore. Call gold. Diamond tin and nickel. Australia is also quite rich. In magnesium copper lead and zinc. Cal guru sorry and. School garden areas of western australia. Have the largest deposits of gold. If we talk about antarctica so children. Geologists and geography was have identified the existence of a variety of minerals deposits. Among which. Some may be quite large. It is a it is forecasted that large deposits of coal in the trans antarctic mountains. And deposits of iron ore near the prince charles mountains. Of east antarctica may be found. Even gold silver and oil are present there in commercial amount. However children mining for commercial reasons. Is ben dear. Only researchers continue to do some mining here in order to find answers to their scientific queries. This was about the. Continent wise distribution of minerals. Now. Let's see the distribution of different minerals in india. Let's begin with iron. In india deposits of high grade iron ore are found. The mineral is found mainly in jharkhand odisha chhattisgarh madhya pradesh. There are also considerable deposits of iron ore in goa maharashtra and karnataka in south. Now the box the another mineral bauxite. The bauxite is the ore of the metal aluminium. In india odisha is the largest producer of bauxite. Other bauxite producing areas are jharkhand chhattisgarh madhya pradesh gujarat maharashtra and tamilnadu. India is the largest producer and exporter of mica in the world. Its deposits mainly occur in jharkhand bihar andhra pradesh and rajasthan. Another major mineral found in india is copper mainly produced in rajasthan madhya pradesh jharkhand karnataka and andhra pradesh. Magnus. Magnesium which is a ferrous mineral is mainly found in maharashtra madhya pradesh chhattisgarh odisha. Karnataka and telangana. Major limestone producing states in india include bihar jharkhand odisha madhya pradesh. Chhattisgarh rajasthan gujarat and tamilnadu. Now the another mineral is gold in india kolar in karnataka have the largest deposits of gold. This gold mines are very deep. In fact they are among the deepest in the world. Due to which meaning of this word that means gold is a very expensive process. Then comes the mineral salt. Which is obtained from seas lakes and rocks. India is one of the leading producers and exporters of salt. Gujarat tamil nadu and rajasthan are the leading states in salt production. If it talk about the uses of minerals then children. There would hardly be an industry where minerals are not used. Minerals are used for gems. Such minerals are usually hard. They are then set in different styles for jewellery. Copper is an indispensable metal in the electrical industry. Because it is widely used for making wires. Electric motors. Transformers and generators. Earlier it was used for making coins also. So we can see that copper is used in everything from coins to pipes. Silicon is another very important mineral which is used in computer industry and is obtained from. Quads. Then aluminium. Which is obtained from the from bauxite it is used to manufacture automobile automobiles automobiles. And aircraft. It is also used by industries which deal with construction furniture fittings and kitchenware at sector up. Minerals have and its uses. But we must remember that minerals are non renewable. Once exhausted day take a very long time. Seth thousands of years to develop and therefore they cannot be replenished immediately at the time of need. Because the rate of their formation is much much slower than the rate at which we consume these minerals. Therefore they have to be conserved and not be misused at all. It is necessary to reduce their wastage in the process of mining. Another way is the mineral in which the mineral resources can be conserved is. The recycling of. Metals. That's all for this video the rest part of the chapter will be covered in the next video. Till then try to solve the following questions. First mission. Describe briefly. Methods of extraction of minerals. Second question. Minerals occur in different types of rocks. Explain. Third question. Describe the mineral distribution in africa and australia. 4th question. Write the common uses of minerals. Why are minerals considered nonrenewable. Children. If you found this video helpful and wish to watch more of such content. Do consider subscribing to the channel. Also if you have any queries or comments. Please post them in the comments section below. Thank you. ",
    "domain": "Geography",
    "video": {
      "Path": [
        "Mineral and Power Resources\\keyframes\\Mineral and Power Resources.mkv"
      ],
      "File_Name": [
        "Mineral and Power Resources"
      ],
      "Video_URL_Path": [
        "Mineral%20and%20Power%20Resources.mkv"
      ],
      "Video_URL_FullPath": [
        "C%3A/Users/Makonis/PycharmProjects/newvrs/Mineral%20and%20Power%20Resources/keyframes/Mineral%20and%20Power%20Resources.mkv"
      ],
      "Full_Path": [
        "C:\\\\Users\\\\Makonis\\\\PycharmProjects\\\\newvrs\\\\Mineral and Power Resources\\\\keyframes\\\\Mineral and Power Resources.mkv"
      ],
      "Duration": [
        "00:17:12"
      ]
    },
    "title": "Mineral and Power Resources",
    "chapters_list": {
      "1": [
        "00:00:00",
        "00:00:13",
        "['POWER RESOURCES', 'MINERAL', 'RESOURCES', 'KIRAN JOSHI', 'POWER']",
        "MINERAL AND POWER RESOURCES"
      ],
      "2": [
        "00:00:13",
        "00:01:47",
        "['naturally occurring', 'occurring substance', 'chemical composition', 'definite chemical', 'composition']",
        "naturally occurring"
      ],
      "3": [
        "00:01:47",
        "00:02:11",
        "['TYPES', 'Non', 'MINERALS', 'Ferrous', 'Metallic']",
        "TYPES OF"
      ],
      "4": [
        "00:02:11",
        "00:02:16",
        "['Metals', 'Ferrous', 'iron', 'Ferrous Metals', 'copper']",
        "Ferrous Metals"
      ],
      "5": [
        "00:02:16",
        "00:02:21",
        "['Metals', 'Ferrous', 'iron', 'Ferrous Metals', 'copper']",
        "Ferrous Metals"
      ],
      "6": [
        "00:02:21",
        "00:03:08",
        "['Metals', 'Ferrous', 'iron', 'Ferrous Metals', 'copper']",
        "Ferrous Metals"
      ],
      "7": [
        "00:03:08",
        "00:03:49",
        "['Non-metallic minerals', 'minerals', 'Non-metallic', 'contain metals', 'etc']",
        "Nonmetallic minerals"
      ],
      "8": [
        "00:03:49",
        "00:04:04",
        "['Extraction', 'minerals', 'Mining', 'Drilling', 'Quarrying']",
        "Extraction of minerals"
      ],
      "9": [
        "00:04:04",
        "00:04:45",
        "['rocks buried', 'buried under', 'taking out', 'earth surface', 'mining']",
        "The process of taking out"
      ],
      "10": [
        "00:04:45",
        "00:05:08",
        "['natural gas', 'gas occur', 'occur far', 'far below', 'earth surface.Deep']",
        "o Petroleum and"
      ],
      "11": [
        "00:05:08",
        "00:05:51",
        "['Metallic minerals', 'north Sweden', 'Minerals occur', 'different types', 'rocks.Some examples']",
        "Metallic minerals"
      ],
      "12": [
        "00:05:51",
        "00:06:30",
        "['Sedimentary rock', 'non-metallic minerals', 'rock formations', 'formations have', 'have deposits']",
        "Sedimentary rock"
      ],
      "13": [
        "00:06:30",
        "00:07:24",
        "['India have', 'have large', 'large iron', 'iron ore', 'India']",
        "India"
      ],
      "14": [
        "00:07:24",
        "00:07:56",
        "['min eral', 'Mai', 'min', 'eral', 'resource']",
        "Mai or min eral fu el"
      ],
      "15": [
        "00:07:56",
        "00:08:41",
        "['NORTH AMERICA', 'America mineral', 'AMERICA', 'NORTH', 'ARCTIC OCEAN']",
        "NORTH AMERICA"
      ],
      "16": [
        "00:08:41",
        "00:09:27",
        "['SOUTH', 'SOUTH AMERICA', 'Ocean', 'AMERICA', 'Atlantic']",
        "SOUTH AMERICA"
      ],
      "17": [
        "00:09:27",
        "00:10:09",
        "['largest producer', 'world largest', 'Zaire produce', 'gold', 'Africa']",
        "Africa is the world's"
      ],
      "18": [
        "00:10:09",
        "00:10:49",
        "['iron ore', 'leading producer', 'Australia', 'largest producers', 'diamond']",
        "iron ore"
      ],
      "19": [
        "00:10:49",
        "00:11:43",
        "['probably large', 'have variety', 'mineral deposits', 'Prince Charles', 'East Antarctica']",
        "probably large"
      ],
      "20": [
        "00:11:43",
        "00:12:37",
        "['iron ore', 'grade iron', 'IRON', 'Odisha', 'Chhattisgarh']",
        "IRON- India has deposits"
      ],
      "21": [
        "00:12:37",
        "00:13:02",
        "['Bihar', 'Jharkhand', 'Andhra Pradesh', 'Pradesh', 'MICA-India']",
        "MICA-India is the largest"
      ],
      "22": [
        "00:13:02",
        "00:13:29",
        "['Madhya', 'Chhattisgarh', 'MANGANESE-India', 'Odisha', 'Pradesh']",
        "MANGANESE-India's"
      ],
      "23": [
        "00:13:29",
        "00:14:09",
        "['GOLD-Kolar', 'Karnataka', 'SALT', 'India', 'Maharashtra']",
        "GOLD-Kolar in"
      ],
      "24": [
        "00:14:09",
        "00:15:23",
        "['USES', 'Minerals used', 'used', 'MINERALS', 'generally hard']",
        "USES OF MINERALS"
      ],
      "25": [
        "00:15:23",
        "00:16:23",
        "['CONSERVATION OFMINERALS', 'CONSERVATION', 'OFMINERALS', 'Minerals', 'energy']",
        "CONSERVATION OFMINERALS"
      ],
      "26": [
        "00:16:23",
        "00:17:12",
        "['QUESTIONS', 'REVISION', 'minerals', 'Describe', 'Describe briefly']",
        "QUESTIONS FOR REVISION"
      ]
    },
    "faculty": "Sharma",
    "video_ID": 3
  }
]