[
  {
    "duration": "11:57 min",
    "video_url": "https://drive.google.com/file/d/1aCULSvbW_FLKDM05wQxrJe4PtMa3LOJL/preview?usp=share_link",
    "transcript": "Hello everyone this is bar no of ci si by unknown number 732. Today's my seminar topic is magnetism. It contains magnetism types of magnetism difference between dire para ferro antiferro. Paramagnetic materials. Mysterious origin of magnetic moment. What is magnetism it is nothing with the phenomenon of attraction between iron and steel nickel and cobalt and other materials. Magnetism is a force exerted by magnets when they attract or repel each other magnetism is caused by the motion of electric charges. Every substance is made up of tiny particles called atoms. Their movement generate an electric current and causes age electron to act like a microscopic magnet. Magnetization and demagnetization magnetization is nothing but conversion of non magnet to magnet. Nt magnetization is quite opposite of magnetisation which is conversion of magnets to non magnets. Different kinds of magnets therefore types of magnets. Natural and artificial temporary and permanent magnets. Natural magnet are nothing but which are available original in the universe like earth. Artificial magnets are prepared artificially by mind there are three types of artificial magnet by magnets disc shaped magnet. Horseshoe magnets. Temporary magnets are those which lose their magnetism property with external conditions. Permanent magnets are those which never lose magnetism properties for external conditions. Different properties of magnetism that different properties like dipole. Pole strength magnetic length magnetic moment magnetic flux magnetic flux density magnetic field magnetic constant and susceptibility. Magnetic dipole with two poles pole strength strength of each pole in a magnet magnetic length is nothing but the distance between the two poles in a bar magnet. Magnetic moment. Product of pole strength and magnetic length is a magnetic moment. Group of magnetic force lines that meeting from north to south pole is called magnetic flux. Magnetic flux density. Total magnetic flux passing through north to south pole of a bar magnet is called magnetic flux density. Magnetic field the region around the magnet until which its influence axis is called magnetic field. Magnetic constant is the ability of medium to permits magnetic flux lines. Types of magnetic constant its medium vacuum. Vacuum and relative. Susceptibility is the ratio of magnetisation and applied magnetic field is cal susceptibility. Differences between. There are different kinds of magnetic materials which are diamagnetic. Paramagnetic ferromagnetic and ferromagnetic materials paramagnetic materials. Diamagnetic materials are nothing but in which atomic dipoles absent. Why poles are aligned in opposite direction. Spontaneous magnetization is there is no spontaneous magnetization. No coupling is present magnetic nature is the week. Magnetic field nature is also weak. Magnetic flux is completely repaired susceptibility is negative and very small magnetization and physical 20 effect of temperature is in it is independent of temperature and independent of magnetic field examples of a conductor paramagnetic materials. Coming to paramagnetic materials. Atomic dipoles are present continuous miner ties asian there is no spontaneous magnetization no and even no exchange coupling. Magnetic nature is partially weak or partially strong magnetic field nature its even partially weak or partially storm. Magnetic flux its parcel a attracted susceptibility is positive and small. Magnetisation is slow. Effect of temperature here. She is the curie constant. Example of alkali and transition materials. Ferromagnetic materials. Here atomic dipoles are present. Magnetic nature is very strong magnetic nature is also very strong. Magnetic flux is very strong very strongly attractive. Susceptibility is positive and large. Magnetisation is high. Effect of temperature here c is curie constant is the curie temperature example iron steel nickel cobalt. Antiferromagnetic materials atomic dipoles are present there is no spontaneous magnetization knows no exchange coupling. Is it has strong magnetic nature and magnetic field nature it is very. Magnetic flux is very strongly attracted. Susceptibility is positive in small magnetisation is slow. Example of side lies. Paramagnetic materials here it amit ipods are present. There is no spontaneous magnetization or exchange of coupling. Here it has strong magnetic nature and magnetic field nature. Magnetic flux is strongly attracted susceptibility is positive and large. Magnetisation is. An example of this is sunrise. Hysteresis curve. It is a curve that shows the relationship between the magnetic flux density and magnetising field strength the curve is generated by measuring the magnetic flux coming out from the. Ferromagnetic substance while changing the external magnetising field. Here is a car. The magnetic flux density b is increase when the magnetic field strength is increased. Some 0 with the increasing magnetic field there is an increase in the value of magnetism and finally reaches point. Point a which is called saturation point where b is constant here a saturation point and 20 constant. With the decrease in the value of magnetic field there is decrease in the value of magnetism but at be. And h. Are equal to zero. Substance of material retain some amount of 90 cm is called retentivity or reschedule point. When there is a decrease in the magnetic field. Toward the negative sign magnetism also decreases. At point c the substance is completely demagnetized. The force required to remove the retentivity of the material is known as. Coercive force. In the opposite direction the cycle is continue or where the saturation point is the retentivity point and forces f. Get the forward and opposite direction crosses the cycle is complete and this cycle is called the hysteresis curve. Advantages of the system is cover. Small region of the hysteresis loop is. Indicator of loss of hysteresis. Hysteresis loop is proper. Provided. When is substance with the. Hysteresis loop provide a substance with the important importance of. Retentivity and coercivity therefore the way to select the write material to make permanent magnet. Is. Medsimplified. Heart of machines. President magnet magnetism can be calculated from the. Bh graph and. It is there for simple tissues material for electromagnet. Retentivity and coercivity retentivity the amount of magnetization present when the external magnetising field is remove. Is known as retentivity. It is a materials it is a materials ability to retain a certain amount of magnetic property by an external magnetizing field is removed. The value of b at point b in the. Hysteresis loop. Coercivity dam on top. Reverse negative head that is negative has external minor typing field required to completely d9 8a is a substance is known as a 50. Office absence. The value of b at point c in the hysteresis loop. What are the different here are the differences between soft and hard magnets. Soft magnets its. Status is area is no where ask for hard magnet its height. Magnetization is easier when i ask for hard magnet it's difficult. The magnetization is easy for software and its various difficult. Hard magnet retentivity is low for hearts of -1 iifa. Hard magnet it is also lo for minors and hai pahad magnet susceptibility is hypersoft - whereas loafer hard magnet. Relative permeability is hypothesis of -1 as loafer. Hard magnets applications are temporary magnets. Purpose of magnets and for hard magnetic permanent magnets. Where is domain theory of ferromagnetism the domain theory was proposed by proposed by wise in 1979. Ferromagnetic materials is divided into many regions each region is called mine size of each turbine is 10 power minus 6 and. Is domain has dipole magnetise in different directions. Ferromagnetic domain applications of magnetic field applications of very strong magnetic field was observed the diagram. Naples one moment is observed in the second one rotation is observed. Origin of magnetic moment every night i'm magnetized with three types of magnetic moments. Forces on orbit magnetic moment spin magnetic moment nuclear magnetic moment. Coming to orbit magnetic moment the orbital magnetic moment is. Norbert mina technoment is a measure of the strength of the magnetic field produced by the orbital angular momentum when you're not is equal to minus in ph by 4 p.m.. Spin magnetic moment is us which is equal to minus half inch by 45 mm. Nuclear magnetic moment is new and is equal to h by 45 and. Thank you this is my magnetism. Seminar thank you.",
    "keywords": "magnetic,magnets,magnetism,magnet,materials,flux,pole,magnetic field,magnetic moment,ferry,qdiagnetic,nature,dipole,hysteresis,magnetic flux",
    "domain": "physics",
    "title": "Physics - Magnetism",
    "faculty": "Singh"
  },
  {
    "duration": "9:53 min",
    "video_url": "https://drive.google.com/file/d/1u2dHvzNvAbwEQyRgWqg12CvlDcTqcZ9i/view?usp=share_link",
    "transcript": "Hello everyone myself amisha pandey student of shivaji science college amravati from bsc final year biotech. My seminar topic is raman spectroscopy. Contents are. Introduction principle instrumentation difference between raman versus our method. Types and application. When introduction. Raman spectroscopy was discovered by cv raman in 1928. It is a spectroscopic technique used to absorb vibrational rotational and other low frequency modes in a system. Raman spectroscopy is commonly used in the chemistry to provide a fingerprint by which molecules can we identify. When the radiation pass through the transparent medium the space is present status of fraction of been in all direction. Raman scattering result from the some type of. Quantities vibrational change associated with ir spectra. The difference in the wavelength in between the incident and scatter visible radiation corresponds to wavelength in mid hydrogen. Principal. When monochromatic radiation is incident upon a sample. Then this light will interact with the sample in some fashion. It may be reflect and absorb or scatter in some manner. It is a scattering of radiation that occurs which gives information about molecular structure. Raman is based on scattering. Scattering is defined as. The process in which electromagnetic radiation or particles are deflected or diffuse. Most of the radiation is elastically scattered. A small portion is inelastic scatter. Tamil ketta composed of stocks and enter stock version. The spectrum is measured with the laser line as a reference. Is the pics are measure has the ship from the laser length. The big position are determined by the vibrational energy is associated with bonds in a molecule. Of which the sample is composed. Because of this the spectrum end up looking very similar to an ir spectrum and it interpreted similarly. Polar points with high dipole moments the bands are in a raman spectrum. Are those that are due to the high polarizable bond purchase with pilot roles. When the immediate radiation is of the type. First stock scattering second and disturb scattering third ray scattering. It's the grammatical explanation of scattering. An instrumentation laser source sample cell. Wavelength selective radiation transducer and computer data system. First instrumentation. Instrumentation for modern raman spectroscopy consists of three components. Leather shoes sample illumination system two table spectrometer. Main source. The source in a modern spectrometry are nearly always lasers because their high intensity is necessary to produce the raman scattering of sufficient intensity to be measured with a reasonable single to noise ratio. Because the incense intensity of raman scattering arises as the fourth power of frequency had gone and krypton ion sources that emit in a blue and. Green reason of spectrum have. Have an advantage over the other sources. Some common laser sources for raman spectroscopy. Laser type and welding. Adg 948 8.0 or 5.4.5. Crypto 95 30.9 aur 64 7.1. Helium neon 632.8 785 aur 830. Antivirus. 1064. Then second sample illumination system. Liquid samples. A major advantage of sample handling in raman spectroscopy compared with infrared arises because water is a vikram a scatter but a strong absorb of infrared radiation. Does aqua solution can be studied by raman spectroscopy but. Not interested. This advantage is particularly important for biological and inorganic system and its studies dealing with water pollution problem. 2nd solid samples. Raman spectra of solid sample are of an aqua by filling a small cavity with the sample. After it has been ground to a fine border. Third gas sample. Gas are normally container glass to 122 cm in diameter. Gases can also be seen in a small capital it tubes. Then third raman spectrometers. Raman spectrometer square similar in design and use the some type of components as a classical ultraviolet-visible dispersing instruments. Most employed double grating system to minimise the radiation reaching the transducer. Now raman spectrometer being marketed as either fluid transfer instrument with cool germanium transducer or a multichannel instrument based upon charge coupled device. Then difference between raman and infrared. In raman it is due to the scattering of light by the vibrating molecules. In internet it it is result of absorption of light by vibrating molecules. In roman the vibration is raman active if it. Causes of change in polarizability in infrared vibration is are active if there is change in dipole moment. Hina aman not process of permanent dipole moment in infrared the vibration constant should have a change in a dipole moment to do the due to that vibration. Cinnamon water can be used as a solvent in infrared water cannot be used to to the intensive sop of fire. In a raman sample preparation is not very elaborate it can be in any state. In infrared sample preparation is elaborate gases sample can really be used. In a raman gives an indication of covalent character in the molecule. In infrared gives an indication of ionic character in the molecule. The last one is in infrared cost of instrumentation is very high. Uninor internet comparatively inexpensive. Then raman spectrum lot of single intensity versus roman shape. Raman shift in cm -1 equals to energy of photon in energy of photon out is diagrammatically explanation of raghuvanshi. Din different types of raman spectroscopy. There are four types. Resonance raman spectroscopy rs. Surface-enhanced raman spectroscopy scrs. Micro raman spectroscopy. And last nonlinear raman spectroscopic techniques. Then application. The roman technique is superior to infrared for spectroscopy investigation in organic system because aqua solution can be employed. Raman spectra of inorganic spaces. In addition the vibrational energies of metal ligand bond are generally in a range of. Hundred to 787 inside that is experimental difficult to study. These vibration are frequently raman active. Raman studies are potentially useful source of information composition structure and stability of coordination compounds. Din raman spectra of organic spaces. Raman spectra are similar to infrared spectra in that they have resolved that are useful for functional group detection and fingerprint region. That permit the identification of specific compounds. Raman spectra more information about certain types of organic compounds. Then do their infrared. Counterparts. Quantitative application. Raman spectra tend to be less kurta with pics than infrared spectra. Pick overlap in mixture is less likely and quantity two measurements are simpler. In addition raman sampling devices are not subject to attack by moisture and small amount of water in a sample do not interfere. The last one is biological application of raman spectroscopy. Raman spectroscopy has been applied widely for the study of biological system. Second the advantage of this technique include the small sample requirements the minimum sensitivity towards interference by water. The spectre details and the. Conformational and environmental sensitivity. Thank you.",
    "keywords": "roman,sample,spectroscopy,roman spectroscopy,scatter,infrared,spectra,source,radiation,ramon,instrumentation,roman scatter,water,study,roman spectra",
    "domain": "Physics",
    "title": "Physics - Raman Spectroscopy",
    "faculty": "David"
  },
  {
    "duration": "6:24 min",
    "video_url": "https://drive.google.com/file/d/1qLOoSObz9-u7H7arJi2G6dscCIrCodQh/preview?usp=share_link",
    "transcript": "Hello everyone. I am the student of shri shivaji science college amravati. Class bsc 3rd year 5th sem. Group m design. Today's my seminar topic is pesticides. So let's get started. We will see here. What is pesticides. The classification benefits of pesticides. And disadvantages of pesticides. First. What is pesticides. Simply. Suicide sir chemical compounds that are used to kill base including. Students insects fun joy and unwanted plants. Pesticides are applied to crops. Weather for after harvest. To protect them during state and transport storage and transport. Now pay classification. Pesticides are classified into main in classes. Depending. On different criteria. But some of the subclass says of pesticides are. Insecticides herbicides fungicides and. Prudent sites. Phosphorus insecticides. These are pesticides which are used to destroy insects. This can be. Two types. Organic origin and inorganic origin. So organic v insecticides. Organic insecticides. Control and manage insects in organic farming. These are stable to light and heat. Examples. Ddt benzene hexachloride. Chloride apple tree. Second. Prospect. Insecticides. It is. Oregano for phosphorus insecticides. Har chemicals. These are very poisonous to insect. Does insecticide destroy harmful as well as useful insects. Example. Mela tune and paratha. Now is organic origin insecticide. Inorganic in stick insect asides are compounds. Data not carbon. They are stable chemicals. Which to not operate and are frequently soluble in water. These insecticides are not used in modern production agriculture. Examples. Flooring compound. In the form of sodium. Calcium and barium. Close silicate. Arsenic compound like. Units of calcium and lead. Mercury mercury chloride. And kilometre act as insecticides. Second one is. Herbicides. Pesticides which are used to restore unwanted b in the crop are called herbicide. Selective herbicides kill specific weights and leave. The desired crop. On ham. Some plant are produced natural herbicides. Herbicides are widely used in agriculture. Kyon herbicides regulate screw thommen of the plants. The act on the cell membrane and. Are effective in control of dicot plants. Examples. 2 4 d. Is synthetic auxin herbicides. And 240. Fungicides. This there are many fun joy. Which are responsible for producing plant diseases. Chemical which destroyed. Sach panja cal fungicides. Example body ears. Which is mixture of fly. You are so for and water. Sanjay can cause serious damage in the agriculture resulting in losses of pil. Quality and profit. Fungicides are used both in agriculture and to fight against fungal infection in animals example. Tea tree oil. Second one. Cinemala aldehyde. Third cinnamon essential oil. Phone jojoba oil. Face neem oil 6 rosemary and milk. Fourth one is. Rodent pic site. Couldn't sites are pest control chemical which are used to kill rodents. Students are usually difficult to kill with poison because their feeding habit are like. Avengers. An effective rodenticides must be tasteless and odourless. Little concentrations and have a delayed effect. Student suicide. Are so dangerous that if given in single sweet pay. The rodent is ke in fore stores only. Now benefits of pesticides. They are used in public health programs. To control the vector borne diseases. They are used to protect stored food grain. The protect the standing crop in the field. Do not increase the crop like fertilizers by protect. The crow from the first. Sunday can be used to control the household pest. Now disadvantages of pesticides. Open are they often clean the non-target species. Pesticide residue on crop. Pesticides and environment affect animal up. Food chain. People working closely with pesticides at risk of health problems. Thank you.",
    "keywords": "pesticides,insecticides,insects,crop,herbicides,organic,plant,fungicides,diseases,chemical,chemicals,weed,pesticides use,rodenticides,agriculture",
    "domain": "Chemistry",
    "title": "Chemistry - Pesticides",
    "faculty": "Kalaam"
  },
  {
    "duration": "14:42 min",
    "video_url": "https://drive.google.com/file/d/1PmkrPDKpx0m6nTeypLAxQSi8gF9wnO3F/preview?usp=share_link",
    "transcript": "Hi guys welcome to my channel date 1 finance and in this video we would be looking after the reserve bank of india. So without wasting any time let's get started with this video. Basic introduction. Rbi is our central bank rbi central bank of india talk about this establishment year it was established on 1st april 1935. The current governor of rbi is mr shaktikanta das. The headquarter of rbi is. There in mumbai maharashtra. And the major function of rbi is supervision of commercial banks and issuance of currency so this is also mentioned there in the preamble of rbi which describe its main function as. Regulate the issue of banknotes and keeping of reserves with a view to securing monetary stability in india and chanderi to operate the currency and credit system of the country to its advantage. How rbi describe its main functioning that is to issue the bank notes. And to keep the reserves in order to keep a stability maintenance in the country's economy in the country's monetary policy is. And to operate the flow of currencies and credit to the public in an efficient way to its full advantage. Look at the functioning of rbi in a little bit more detail it controls and supervises the functioning of financial institutions commercial banks. Mpsc spice tab using certain such rules and regulations to be followed. Janu rbi serves as a banker to all other banks. Ok so whether we talk about any financial institution whether we talk about any other scheduled or non scheduled bank. Any and all has to follow certain guidelines certain search rules and norms. Which is pre decided by the rbi and it is mandated it is obligatory to be followed by these rules and norms are made. These rules and norms are made to safeguard the interest of the public. Who are depositing the money was taking credit from the bank to have a look over all these functioning of banks to have a look over to have a control over all these functions are there comes into picture. Order wise to facilitate the issue and flow of current in the country by analysing economic structure and prevailing scenario to decide on the number of paper notes to be printed and circulated in the system. Rbi is solely responsible for the issuing of currency notes. So when we talk about to the currency in. Rbi who is authorised to print the paper notes. Rbi authorised to diesel currency notes in the system. Rbi. Printed paper currency coins minted by the government of india and rbi act as an agent for handling and distributing the coins. Idea i also keeps on upgrading the security features in currency to avoid any kind of counterfeiting of currency. News. Are the guidelines like to identify your currency originality you have to look after these all the features and these features are decided these features are. Provided by rbi in the currency notes to avoid the count of eating to avoid any kind of malpractices involved. Continuing with the previous slide. As a banker to the government by carrying out country's financial transactions efficiently by maintaining accounts of payments and systems. Rbi also serves as a banker to the government which is government itself is having. A lot of transactions on daily basis whether which of about these assets the payment being made the foreign transaction fee domestic transactions and all those transactions could be served by maintaining accounts within the rbi. Books bankers bank in a way that commercial banks hold a account in rbi deposit money borrows money as and when required on the prevailing interest rates. It also works as a bankers bank. When we have to take money we have to deposit money we go to any of the bank. Similarly when the banks are in need of money when the banks are in need of depositing money the go to rbi and they are also in a similar way to charge some kind of interest rate which is pre-determined. Its regulated foreign exchange transactions by facilitating foreign trade and maintaining foreign exchange market in india to create forex reserves synopsis domestic scenario rbi is also responsible for maintaining the foreign exchange reserve. Facility at various foreign trading with which is done within which is done from our country to other countries to other foreign nations. And all these trading purposes rbi was responsible for holding the reserves. Without holding could help in. Making the imports to the country and various other foreign trade. Aunty 2016 monetary policy was solely and the control of rbi b as in 2016 monetary policy committee had been formed to decide and fixed interest rate in india. Stock 2016 the monetary policy monetary policy is like to controlling the interest rate to control the economic scenario. This was only under the control of rbi but what happened in 2016 a separate monetary policy committee had been formed which is the authorised to determine to decide to determine a fixed interest rate the members of rbi are also involved in that but this is how a separate committee has been formed. Now let's have a look at the various policy rates we would be covering the repo rate and reverse repo rate which is two of the main policy rates and the bank rate also which is the main rates when we talk in concern of rbi and commercial bank. Rbi money commercial banks for short time period of less than 19 days. Ok so this rate is charged by rbi while lending money to commercial banks. As i said when we are in need of money we go to banks and we want a money similarly when the commercial banks are in need of money. Go to rbi and rbi provides the money required by them but the also charged a certain fixed rate of interest. And when this interest rate when this boring is for a shorter time period of less than 90 days. This is what to this is how repo rate comes into pictures it is the interest rate. Charge by rbi while lending to commercial banks for a shorter boring. Rbi wants to make borrowing money expensive for commercial banks is it simply increases the repo rate. Because increasing the repo rate would make borrowing by commercial bank commercial banks a little more difficult. And in the repo rate when it wants to make the borrowing by commercial banks cheaper. When we talk about the current repo rate for the current repo rate in our country 6.50%. Why is that dancer just have a look over here. Increase repo rate make borrowing costly for commercial banks as a result of which these commercial banks also increases the interest rate. Boring pipe public costlier please to less demand for loans reducing the money supply in economy to curb inflation. Oggy and the acid talk about the monetary policy in monetary policy controlling over the interest rate is done to have a control over the economic scenario so when we talked about the inflation in the country one way to control the inflation is also by increasing the repo rate. How does that happens because when repo rate is increased. Commercial banks the borrowing by commercial banks becomes costlier and as a result what does commercial banks to they also increased the interest rate on the wharf inspired the public. The borrowings on the interest rate increases for the public also the public. Tends to less demand for the loans no less for the loans. And that's what happens the money supply in the economy reduces the demand is control under control the supplies limited inflation is automatically controlled so this is how monetary policies are used. In order to curb various economic situation. Look at the reverse repo rate it wasn't first passed by commercial banks on rbi for borrowing money this following is used only for a short period of time current reverse repo rate is 6.25%. Ok so i'll be talked about repo rate it was commercial banks borrowing money from rbi. Similar hindi opposite manav when we talk when rbi has to borrow money from the commercial bank we call this as reverse repo rate so it happens like sometimes rbi is need is an the need of the money or it sometimes does it intentionally to reduce the liquidity in commercial banks any of the reason when rbi borrows money from commercial banks for a shorter period of time this is usually known as reverse repo rate the interest rate charged is known as reverse repo rate. And the current reverse repo rate is 6.25% now come in our country. It is an internationally by rbi to reduce the liquidity in commercial bank as i already told it is sometimes that intend to visit in commercial. This is you know when rbi borrows money from bank to the account of rbi and that in the commercial banks produces it is intentionally. When are you please banarasi is that the flow of money in the commercial banks is getting higher and that is not the required level. Talking about the bank rate is the interest rate charged by rbi on a long term borrowings by commercial banks. Ogi picture of the bank read it is for a longer term period in commercial banks borrows money from rbi for a longer period of time that is for more than 90 days useful in short period of time you were considering 90 days. The time period it would be called as the bank rate and the current bank rate is 6.75%. Look at the shoes. First one is cash reserve ratio it is mandatory to keep certain percentage of deposit as a cash reserve in rbi this obligatory deposit by commercial banks in rbi is known as cash reserve ratio. Currency rs 4%. Ok so whatever deposits are there with the commercial banks take used to. If a proportion a percentage of their deposit as reserves with the rbi in form of cash. And this is what we call as the cash reserve ratio it is obligatory this is done in order to safeguard various interest involving the public and the bank. All the banks have to follow this rule and they have to keep a deposit with the rbi that is what we call cash with of ratio and the current crr is 4% so if the banks are having a deposit of rupees hundred they would have to. Are provided rupees. What is statutory liquidity ratio it is proportion of net demand and time liabilities. Mandated to be maintained as liquid reserve usually in the form of cash and gold reserve by commercial banks in rbi current slr is 19.5%. Ok so it is somewhat similar to see at the only difference is that. Crr was maintaining reserves in the form of cache files the commercial banks has to maintain reserves with rbi in form of cash as well as cold and how this proportion is decided this is on the basis of net demand and time light time liabilities. Net demand here is referring to the current accounts by public the saving account. And presenting the fixed accounts the fixed deposits the actors. Hold by the public so the proportion of this is considered and that it is decided how much what percentage for promotion what proportion would be kept as liquid reserve. Rbi in form of this cash and gold. Current slr residency is 19.5% so this is the proportion of amount which is the banks are required to maintain as reserve with rbi. Shuddh was all about this video we talked about rbi is we see various functions of rbi and then we moved to the policy rates where we covered the repo rate and reverse repo rate and bank rate. And finally we had a look at the reserve tissues which is the cash reserve ratio and statutory liquidity ratio i hope you understand this sweet you a little bit more about rbi how does it functions and in brief i tried to explain all the all those things i hope you like this video. What thing you like and share my video. Thank you all.",
    "keywords": "rbi,commercial,commercial bank,bank,reserve,repo,repo rate,interest rate,india,currency,borrow,policy,financial,foreign,borrow money",
    "domain": "Finance",
    "title": "Reserve Bank of India",
    "faculty": "Singh"
  },
  {
    "duration": "7:08 min",
    "video_url": "https://drive.google.com/file/d/1aczx8kV8ubyo8fe4pOsYU38G-rl9Z4Kr/view?usp=share_link",
    "transcript": "Good morning everyone. Today we are celebrating 73rd. Republic day. And i would like to wish each and everyone. Happy republic day. On this occasion i would like to present a powerpoint presentation on constitution of india structure and features. Flow of presentation background. Drafting structure. Paath said use and system of government. Silent features of the constitution of india. Changing the constitution. Background. The constitution of india was adopted on 26th november 1949. And came into effect on 26 january 1950. Proclaiming india to be a sovereign. Democratic republic the federal structure of government. Provincial autonomy. A bi carmel central legislature. Consisting of a federal assembly and council of states and the separation of legislative power between the centre and the state are some of the provinces of at which are present in the constitution of india. Drafting the constitution was drafted by the constituent assembly. Which was elected by the elected members of the provincial assemblies. Dr br ambedkar sanjay faki. Jawaharlal nehru c rajagopalachari. Rajendra prasad. Sardar vallabhbhai patel maulana abdul kalam azad was some important figures in the assembly. The members of the constituent assembly met for the first time on december 1946. On 29th august 1947 the drafting committee was appointed. Dr br ambedkar as the chairman along with other members assisted by a constitutional advisor. Structure of the constitution in its current form september 2012 consists of a parable. 25 parts containing 463 articles. 12 schedules to appendices and 97 amendments to date. Latest being related to cooperative societies added in part 9 b. In 2012. Indian constitution is federal in nature and also has a strong unitary bias 22 parts 395 articles 12 schedules to appendices 92 amendments system of government the basic form of the union government. And we says in the constitution. Federal structure three subject list. The union list state list and the concurrent list define the legislative power of each level of government. The union government reserves the right to make laws in areas specified on the union list the state governments allowed to make laws in areas specified on the state list. Parliamentary democracy. The president of india is elected by the parliament. And state legislative assembly. And not directly by the paper. The president is the head of state. And all the business of executive and laws of the parliament. Are in his her name. The prime minister and the council of ministers exercise their offices only as long as they enjoy a majority support in the lok sabha. The lower house of the parliament which consists of members directly elected by the people. If similar structure is present in state. Back the directly elected legislative assembly enjoys control over the chief minister and the state council of ministers. Independent judiciary. The judiciary of india is free of control from either the executive or the parliament the judiciary act as an interpreter of the constitution and as an intern. Intermediary in case of dispute between two states or between a state and the union. An act passed by the parliament or a legislative assembly is subject to judicial review. And can be declared unconstitutional by the judiciary if it feels that act violates the provinces of the constitution. Silent features of the constitution. There are. Live in silent features. Of the constitution in india. Number 1 longest written constitution. Number 2 best constitution number 3 a written and rigid constitution number 4. Based on adult search page number 5. It makes india a sovereign democratic republic number 6 it gives india a federal policy number 7 it establishes parliamentary form of government in india. Number 8 fundamental rights number 9 fundamental duties number 10 directive principle of state policy number 11 secular democracy. Changing the constitution. Amendments to the constitution are made by the parliament. The procedure for which is laid out in article 368. Amendment bill must be passed by both the houses of the parliament. By a two-thirds majority and voting. In addition to this certain amendment which treating to the federal nature of the constitution must be rectified by a majority of state legislature as of january 2012 there have been 115 amendment bills presented in the parliament. Out of which 97 have been passed to become amendment. Most of these amendments address issues dealt with price catches in other democracy. The supreme court has ruled in kesavar vandana bharati v state of kerala case that not every constitutional amendment his premise table. The amendment must respect the basic structure of the constitution. Which is immutable. In 2000 the national commission to review the working of the constitution was set up to look into updating the constitution. Thank you. And once again i would wish to. Happy republic day. Jay hind.",
    "keywords": "constitution,india,federal,structure,parliament,legislative,republic,council,e11,policy,elect,government,di1 ect,ect,people",
    "domain": "Constitution",
    "title": "Indian Constitution",
    "faculty": "David"
  },
  {
    "duration": "15:27 min",
    "video_url": "https://drive.google.com/file/d/1Jc3exDU1da0fAoAkEu3ZgofJWqdn04xe/preview?usp=share_link",
    "transcript": "Hello everyone. I am kiran joshi. Hope you all are safe and sound. Welcome to class 6 geography chapter 8. India. Climate vegetation and wildlife. Is it is clear from the title of the chapter that we are going to learn about the climate of india its vegetation and wildlife in this chapter. Let's begin with the climate of india. But before that let's understand the various terms used in this connection. I am hurt. And used the word weather quite often. Children weather is the daily state in the atmosphere. It includes day to day changes in temperature rainfall and sunshine it sector. The weather could be hotter and hotter cold cloud your windy sunny aur vate. When certain fixed weather patterns continue over a few weeks or months. They are called season. India experiences for mains major seasons in a year that follow each other in a cycle. The first one the cold weather season or the winter season. Extends from december to february. Then the hot weather season or the summer season. Extends from. March to me. Then the southwestern monsoon season or the rainy season or the advancing monsoon season extends from june to september. In the fourth season is the season of retreating monsoon or the autumn season extends from october and november. As i said the first season is the cold weather season or the winter season. It falls between the months of december and february. During the winter season sun rays do not fall directly in the region. Winter is more severe in north india where the temperature drops very low the coastal areas experience winter. After the winter season comes the summer season which extends from march to me. In the season the sun rays. Fall the sun's rays falls rays fall direct vertically in the region. Causing a short increase in temperature. Strong hot and dry winds called loo blow during the day in the northern plains and north western part of india. Next in the cycle is the southwest monsoon season that lasts from june to september. The moisture laden winds of southwest monsoon enter india from the arabian sea and the bay of bengal. As you can see from the map also. The. The onset of southwest monsoon occurs each year around the first week of june the monsoon for the advances to the north and by 15 july the entire country comes under the spell of monsoon. Then comes the season of retreating monsoon. Aur autumn. By the. Early october the monsoon starts withdrawing or retreating from north india. The retreating monsoon season is spread over october and november. As you can see. From the map. The retreating monsoon brings heavy rainfall to tamilnadu and parts of andhra pradesh karnataka and kerala. This was the explanation of the four main seasons of india. However the term climate means the average weather condition of a place measured over many years. India is said to have a tropical monsoon type of climate. The term monsoon is derived from the arabic word mausim meaning season. India is located in the tropical region as you can see in the map at the back. Therefore most of the rain that india receives is brought by monsoon winds. India is an agricultural land as we all know and indian agriculture depends upon the monsoon good monsoon means adequate rate and a good crop. There are various factors that affect the climate of a place. Such as the location of the place altitude. Distance from the sea and relief. Is india is a vast land that stretches from the himalayas to the indian ocean therefore india has a wide range of climatic conditions that different addition. For example jaisalmer and bikaner in the desert of rajasthan. Are very hot. Drugs and kargil and leh ladakh are extremely cold and mumbai and kolkata or any coastal area have moderate climate. Mawsynram in meghalaya is the words. Highest rainfall receiving place while it is quite possible that in a particular year jaisalmer and rajasthan mein receive no rain at all. No from the little letters move our attention towards the natural vegetation of india. You might have seen and may be sometimes grown also a variety of plant life such as grass shrubs bushes trees at 17. When the plant life grows on its own in an area without any human interference or efforts it is called natural vegetation. Natural vegetation is also called flora of a region. Natural vegetation varies with relief and climate it means the natural vegetation found on mountains is different. From that found on the plains and the plants found in the desert very from those. Found in wet and humid places. India has a variety of climatic conditions a large range of natural vegetation is found here. Which can be divided into five types. Tropical rainforest. Tropical deciduous forest. Thorny bushes mountain vegetation. And mangrove forest. Tropical rain forests are found in the regions which are warm and receive heavy rainfall. These forests with. Several metre tall trees are so dense. That very little sun sunlight reaches the ground. These forests have different species of trees that shed their leaves at different periods of the year. Therefore. This forest always appear to be. Green. This is the reason that they are also called evergreen forest. The major species found in these forests are ebony mahogany rosewood sincona and jamun. In india the rain forests are found in the western slopes of western ghats. Assam meghalaya west bengal odisha and the andaman and nicobar islands. Tropical deciduous forest. Which are also called monsoon forests are found in a large part of india. The trees in these forests are usually not as close together as in the tropical rainforest. They have a definite leaf shedding period also. From six to eight weeks in a year. Major trees of deciduous forests are. Sal. Sheesham. Sandalwood people and name these forests are found in madhya pradesh chhattisgarh jharkhand bihar odisha uttar pradesh tamil nadu and maharashtra. The third type of vegetation found in india is the thorny bushes that occur in dry regions of the country. They are also referred to as desert vegetation. The needle like leaves and some plants have leaves in the form of spines. And that is to prevent loss of water. Major species of trees found in these forests are kept uses. Hair ki qubool by date palm and half. Deer found in the states of rajasthan gujarat. Punjab haryana parts of madhya pradesh eastern slopes of western ghats and central rocky regions of the deccan plateau. The fourth type of vegetation is the mountain forest. They consist of different types of vegetation depending on the altitude. As the altitude increases temperature goes down. In the high reaches between 1500 metres and 2500 we find coniferous forest the trees. Conical in shape. Important trees found in these forests include cicd in silver for devda and spruces. Now the fifth type of vegetation that is mangrove forest. They can survive in saline or salty water. They are found mainly in the sundarbans in west bengal. Pichavaram in tamil nadu near chilka in odisha and in the andaman and nicobar islands. The sundari tree is a common species of mangrove forests and sundarbans are named after this sundari tree only. Now let's find out. The significance of forest. Forest perform various functions. Day in hell carbon dioxide that we at sale and in return release or oxygen the life-giving gas. Then their roots hold the soil formly together and prevent soil erosion. They provide produce products like. Timber for furniture fuel wood for the leg gum honey fruits medicinal plants and herbs at 17. Forest provide natural habitats for wildlife. The enable percolation of water into the ground. But children. A large part of natural vegetation has been destroyed due to the deforestation. There is an urgent need. To check deforestation. So more and more trees should be planted and the existing ones should be protected. It's high time. For the people to be aware of the importance of trees. Programs like van mahotsav can be very helpful in this direction. As mentioned earlier that forest are natural home for a variety of wildlife. Wildlife refers to all those animals that have not been tamed or domesticated by. Wildlife is also called fauna. Our country has a rich and varied wildlife. That includes a large variety of mammals reptiles amphibians birds worms and insect. Tiger national animal is found in different parts of our country. Mainly in the wildlife reserve. Set up by the government. Asiatic lions are found in the gir forest of gujarat. The only remaining habitat of this majestic animal. The elephants the elephant is found in the forests of gujarat assam. Kerala karnataka tamil nadu and west bengal. One horned rhinoceros are found in the kaziranga national park of assam. Camels are found mainly in the great indian desert. Wild assess drill in the marshy rann of kutch of gujarat. Wild goats. No leopard. Bear true at 17 are found in the himalayan region. Other than these many other animals are there such as monkey wolf jack all leopard wild board. Chital blackbuck. Spotted deer nilgai at sacrum. India is also rich in bird life. Peacock india's national bird is our pride. The other birds found in india include. Parrots pigeons mena giese ducks hornbills bulbuls cranes herons at 17. The government has set up many bird sanctuaries. 2 pro provide the birds their natural habitat and to. Give protection from hunters. Among them bharatpur bird sanctuary which is now known as. Keval radio. National park is considered the largest in asia. Several varieties of snakes are also found in india. For example cobras. Create swipers at 17. Deforestation on a large scale has affected our wildlife directly. Hunting is responsible for many species of wildlife to be on the verge of extinction at a large number of animals are already extinct. To protect our wildlife the government has created a number of national parks wildlife sanctuaries and biosphere reserves. The government has also initiated many animal specific projects to prevent them from becoming extinct. Suggest. Project tiger launched in 1973 and project elephant launched in 1992. No how can the common mass contribute in conserving wildlife. Children you must be knowing that several parts of the bodies of animals are used to make different things. So we can do our bit to conserve wildlife by refusing to purchase such things. Murga the first week of october is observed as wildlife week every year in order to develop awareness about protecting the natural habitats of the animal kingdom. That's all for the chapter. Now there are some questions for you to revise the topic. First question explain different types of seasons found in india. Second question mention different types of vegetation found in india. How are forests important for us. 4th question what should we do to conserve wildlife. If you found this video helpful and wish to watch more of such content do consider subscribing to the channel. And also if you have any queries or questions. Please write in the comment section below thank you.",
    "keywords": "india,vegetation,wildlife,natural,forest,season,different,climate,monsoon,hot,animals,different type,species,bird,weather",
    "domain": "Geography",
    "title": "India - climate,vegetation and wildlife",
    "faculty": "Sharma"
  },
  {
    "duration": "12:50 min",
    "video_url": "https://drive.google.com/file/d/1QaXfh9aXC9oM5-YvTeyhkTn5sIXflWak/preview?usp=share_link",
    "transcript": "Hello everyone. I am kiran joshi. Hope you all are safe and sound. Children this is the first video of class 8 civics chapter 5 judiciary. As we have learnt previously that in india we have the rule of law means laws apply equally. And if a law is violated a certain set of fixed procedures need to be followed. Children for the enforcement of law we have a judicial system. This judicial system consists of courts and when a law is violated. Citizens can approach to these codes. Judiciary is an independent organ of the indian state. What is an indian what is an independent judiciary. And what is its role in democracy let's find out the answers of these questions. This video. There are numbers of issues or matters on which courts take decisions. The work of the judiciary or the judicial system can be divided into. 1. Dispute resolution. Second judicial review and third upholding the law and enforcing fundamental rights. Let's take the first point. That is dispute resolution. Are judicial system offers a mechanism for process. To resolve disputes. Which may occur. Between citizens. Between citizens and government and the government. Between two state governments. And between the centre and state governments. Now the second task of our judiciary that is. Judicial review. Children are judiciary is the final interpreter of the constitution. Therefore it has the power to cancel a law passed by the parliament. Declaring it. Is illegal and unenforceable if it believes that the law is not in accordance with the intention of the constitution. Aur it violates the basic structure of the constitution. It is called judicial review. The third task of the judiciary is to uphold the law and enforce. Fundamental rights. Children every citizen of india can move to the court if they believe that their fundamental rights have been violated. If you remember you learnt in class 7. The story of hakim sheikh. Who was severely injured after falling from a running train and who was denied to be admitted in several government hospitals. The supreme court ruled in his case that fundamental right. Of right to life. Also include right to health. And directed the west bengal government. To pay hacking hacking check. Compensation for the loss he suffered. This was the clear example of upholding the law and enforcing fundamental rights. By the judiciary. Now let's understand the meaning of an independent judiciary. Suppose there is a judicial system in which a politician has the power that he can appoint as well as dismiss a judge from. His office that means the jaj office. Now in such a system. If a powerful powerful politician. Encroaches on your land. And you take this case. Of encroachment to court. Definitely the judge would be partial to the politician. Because he has the control over the judge. Therefore the judge cannot take independent decision. Because the judge is not independent. And is under the control of the politician. It would force the judge to make all judgements. In favour of the politician. But in but the indian constitution protects against this kind of situation. By providing for the independence. Of the judiciary. One aspect of the independence of indian judiciary is the separation of powers. Which is a key feature of the constitution. It means. That the other two branches of the state. The legislature and the executive. Cannot interpret interfere in the work of judiciary. Judiciary is not under the government and does not act on their behalf. Now this separation of parts. Is effective only when the appointment of the judges in the high court and the supreme court. Is done without or with very little interference of the legislature and executive. After their appointment. The judges of high court and supreme court. Can not easily be removed from the office. Is the judiciary is independent and not under the influence of legislature and executive. The courts can play an important and main role. To ensure that these two branches of the government don't misuse their parts. The judiciary also plays an important role in protecting the fundamental rights of citizens. As mentioned i mentioned earlier that they can approach. The court if they believe. That their rights have been violated. Now let's understand the structure of indian judiciary. The judiciary is. Organised hierarchy. Which has three different levels. As shown here in front of you. At the top supreme court then high court and the lower level subordinate or district court. At the low level these are there are several codes these codes are called the a subordinate or district courts. Children the states are divided into districts and each district has a district court. The district court and the courts below it are called subordinate courts. These codes are of two types civil court which deal civil court switch deal with. Civil cases and criminal courts which deal with criminal cases. These codes are presided over by a district judge. Children most. People interact with this quotes. Vidya different kinds of cases. Most of the states have a high court. Which with which is the highest court. Of the state. The high court deals with all cases that are under the jurisdiction of the. State. At the top. Is the at the top of the hierarchy structure of judiciary is the supreme court. Which is the highest court in india. It is located in new delhi and is presided over by the chief justice of india that means. Chief justice of india is the head of the supreme court. The decisions given by the supreme court are binding on all other courts in india that means the judgement. Given has to be accepted by the other courts in of india. Children the indian judiciary is. Single. Integrated and unified. The different levels of courts are connected to each other. And the decisions made by higher courts are binding on the lower courts. This integration can also be understood by the appellate system. Apple system means if a person believes. That the judgement given by the lower court is not just. Aur a person is not satisfied with the judgement. Judgement given by a lower court. He or she can appeal to a higher court. Let's understand this applet system through a case. This case is. State delhi administration vs laxman kumar and others 1985. Which was. Tried from lower courts. To the supreme court. In february 1980 laxman kumar married sudha goel and live in a flat in delhi. With lakshman brothers and their families. On 2nd december 1980 sudha died in hospital due to burns. Sudhar family file decrease in the trial court. Trial court is another name for subordinate court. Photo hearing of the case. Ore of her neighbours were called. Call din as witnesses. Day told the court that on the night of 1st december when they heard sudha screen. They forced their way into lakshman flat and found sudha standing with her saree in flames. The neighbours stated that they read sudha in a gunny bag and and a blanket to extinguish the fire. Sudha told neighbours. That her mother in law shakuntala. Had poured kerosene oil on her and that her husband lakshman head the fire.",
    "keywords": "court,layman,sha,high court,delhi,india,supreme,supreme court,layman kumar,kumar,judiciary,judicial,state delhi,state delhi administration,delhi administration",
    "domain": "Constitution",
    "title": "India - Judiciary",
    "faculty": "David"
  },
  {
    "duration": "9:32 min",
    "video_url": "https://drive.google.com/file/d/1I7x6LOUaomnddk_i-1Gw1TrEUv0SGF6A/preview?usp=sharing",
    "transcript": "Hello everyone. I am kiran joshi. Welcome you all in class 5 evs chapter indian national movement. The children you have learnt in the previous lesson. That the british rule caused discontent among indians. Indian 19th n in 1857 a massive revolt broke out against the british rule. After the initial success of the revolt it was suppressed by the british. After the revolt the rule of the east india company came to an end. The administration of india was taken over by the british government from the company. The governor general was henceforth known as the viceroy. As a direct represented of the british crown. During. This time. There were many social and religious practices prevailing in the society. For example one such bad practice was sati. The burning alive of women. On the funeral pyre of their husbands. Another ill practice was female infanticide. Children in many parts of india the birth of a girl child was considered as a curse and therefore. Open the female infants were deliberately killed. Then there was another in practice of child marriage. Specially the girls were married off auto very young age. When they were neither physically not emotionally ready for the marriage. Caste system was also a great curse that divided and affected the quality of indian society. Children there was some people. Who tried very hard to bring awareness amongst the people and the reform the society. Delayed many social reform movements for this purpose. They were known as social reformers. Raja ram mohan roy dayanand saraswati ishwar chandra vidyasagar sir syed ahmed khan. Some very renowned social reformers. You can see the images in front of you. Through the social reform movements of the social reformers. The word. To educate people and remove the evil social practices. The social reformers strongly opposed the practice of sati child marriage female infanticide and caste system. The work tirelessly to promote education among people and specially among girls. These social reformers also supported the idea of. Widow remarriage. The efforts of social reformers bor fruit. Slowly but great today indian society started changing. This was also the time when the feeling of nationalism was gradually spreading across the country. On 28 december 1885. Allan octavian hume you can see the image of this person in front of you. Two electron octavian hume a retired british civil officer founded the indian national congress. The first session of indian national congress. Was conducted in bombay. At the gokuldas tejpal sanskrit pathshala. From 28 december 230 1st december 1885. Wc bonnerjee. Full name was. Womesh chandra banerjee was the president of this first session of indian national congress. In which only 72 delegates participated. In the beginning the congress had quite moderate ins for example it wanted the british rule to be sensitive towards the problems and difficulties of the indian people and to listen to the demands of the people of india. The indian national congress waste. The british rule to involve indians. While taking administrative decisions. Related to india. The early leaders of the indian national congress was called the moderates who wanted gradual reforms and aimed at. Better association with the british rule. The prominent moderate leaders were surendra nath banerjee. Gopal krishna gokhale firoz shah mehta badruddin tyabji and dadabhai naoroji. Dada bhai naoroji is also called the grand old man of india. You know why. Because of his very long association with the indian freedom struggle. These moderate congress leaders head. Ulfat. The british would understand and remove their complaints. But. British ignore their demands and complete. Then some leaders. Realised that there was no point of appealing for requesting british government. They had no faith in the british sense of justice and fair play. They believed that their demands could only be heard by adopting forceful stronger measures. These leaders were known as extremists or radicals. Lala lajpat rai in punjab. Bal gangadhar tilak in maharashtra bipin chandra pal in bengal. What the prominent extremist leaders. They were called lal bal pal. The demanded for purna swaraj or complete independence. Bal gangadhar tilak meet of force full claim and gave the famous slogan. Freedom is my birthright and i shall have it. At the time bengal was the biggest state of british rule as well as the. Area of congress dominance. So. To weaken the stronghold of congress and to divide the hindus and the muslims. The british decided to divide bengal. So in 1905 lord curzon. You can see the image in front of you. Lord curzon the then governor general of india declared the partition of bengal. But opposite to what the british had imagine. The partition. Further give boost to the freedom struggle. The leaders of congress decided to boycott british goods and to use only indian goods. It was known as the swadeshi movement or swadeshi andolan. People gathered at crossroads made use bonfires and burnt the imported for in clothes and goods that they had. People from every section of the society. Given the students participated in this movement. Now to control this movement the british put many people including students in jail. But. This did not stop the indians from participating in the movement. And ultimately the british had to cancel the partition of bengal. Now to win back the goodwill of the indians the british introduced some reforms. By now the first world war. Broke out in 1914. The indian soldiers help the british during the war hoping that the british government would give more freedom and concession to indians. But the british begin to repress the indians even more than earlier. The pass the rowlatt act. On 6 february 1919 this at empowered the british government. Put anyone into jail without a trial. I am sure you all have heard about mahatma gandhi. The year 1999 was also the year when mahatma gandhi started to participate actively in the freedom struggle. His full name was mohandas karamchand gandhi was born in porbandar gujarat. He studied law in england and then went to south africa as a barrister. For almost 20 years. In south africa he saw the racial discrimination done towards the black and coloured people. He was moved by this ill-treatment and struggled against this injustice. In 1915 he returned to india. And started. Contributing to the nationalist movement. He had form belief in truth and nonviolence and he gave. A new direction to the freedom struggle. Because of his great contribution to the indian freedom struggle he was fondly called bapu aur mahatma. That's all for this chapter if you like the video and found it. Please like. Share and subscribe to the channel. Thank you.",
    "keywords": "british,indian,leaders,people,bengal,india,indians,partition,partition bengal,inc,gandhi,british government.moderate,sarah,indian people",
    "domain": "History",
    "title": "Indian National Movement",
    "faculty": "Kalaam"
  },
  {
    "duration": "12:05 min",
    "video_url": "https://drive.google.com/file/d/1IgcEqv1eMRPmiT5B-jt9wHtLo47wIPFB/preview?usp=share_link",
    "transcript": "Hello everyone i am kiran joshi hope you all are safe and sound. Welcome to class 8 civics chapter 10 law and social justice. Children one of the many objectives of the government is to establish social justice. And to achieve it the government has to regulate economic activities of the market through laws. Let's try to understand why it is important. And how it is done through the issue of workers wages. You know children that all in the market. Whether they are private companies contractors or business persons wants to gain maximum profit. And in this desire it is quite possible. The day refused to give workers their rights. For example not pay their wages. For their work. Aur. Cut their images. Do it is against the law. To protect the workers from being underpaid. There is a law on minimum wages. According to this law a worker has to be paid not less than the minimum wage. The minimum wages or not fixed at a level forever rather they are revised and increased time to time. Is the law on minimum wages. Protect. The interest of workers. Similarly there are also the laws that protect the interests of producers and consumers. For example there is a law that requires adequate safety measures in workplaces. Another law that says that quality of goods have to meet certain prescribed standards. What do you think that the government responsibility gets over or the workers producers and consumers interest. Can be protected. Only by making laws. Certainly not. Therefore it is. Also the responsibility of the government to ensure that the laws are executed or enforced. Because these laws are meant to protect those who are weak. And cannot fight for their right themselves. For example to ensure the workers that the workers are paid properly regular inspections should be done. At the work site. And those who violate the law should be punished. In most of the cases workers are poor or powerless and desperately need work. They have no bargaining power. So they have no choice other than to accept low wages. Udaipur it is important that the laws are enforced. The government makes. Implements and upholds. These laws in this way it can put a check. On the unfair and unjust activities of individuals or private companies in order to promote social justice. Many such laws are based on the fundamental rights of the. Let's take the example of the fundamental right against. Exploitation. That prohibits. Forced work for low wages or slavery. The fundamental right against exploitation also states. That employing children below the age of 14 years in any factory or mines or in any other hazardous work. Is a punishable offence. In october 2016 the government amended the child labour prevention act. Bending children under 14 years of age from working domestic working as domestic servants or as workers in dhaba and restaurant st shop 67. But. Despite of the law against child labour it is a fact. That 74% of child domestic workers are under the age of 16. Show the important. Questions that arise. Are. Whether these laws are actually press practiced. And how much successful they are in ensuring social justice. I am sure you all must have heard about one of the world's worst industrial tragedy that took place in 3rd on 3rd december 1984 in bhopal. Union carbide. An american company had a factory in bhopal in which it produce pesticides. At midnight on 2nd december 1984. Highly poisonous. Methyl isocyanate gas started leaking from the pesticide factory of union carbide. This leakage of poisonous gas. Cause numerous deaths. Those who survived develop serious disorders and ailments. Most of those exposed to the poisonous gas were from poor working class families. Now the question arises. Why foreign companies like union carbide set up the their plants in india. So the first reason is the availability of cheap labour. The wages for workers in countries like usa are very high. However in countries like india the companies get workers. Who get ready to work for low wages even for long hours of work. Companies expenses on housing facilities for workers are also very less here. In this way the companies in india can save cost. And gain high profit. Drive to earn more profit the companies try to cut cost by giving lower working conditions including lower safety measures. As was done in union carbide factory where the safety devices were insufficient and malfunctioning. The required workers were reduced from 12 to 6 workers in the methyl isocyanate plant and evening the safety training period for workers was cut. From 6 months to 15 days only. This all was. Practicing being practice. To earn more and more profit on the cost of the safety of the workers. However the same companies plant in the usa was maintaining. Safety standards. So what were the reasons for such differences across countries. What is the worth of an indian worker. So children in india there is so much unemployment that despite of unsafe working conditions workers accept to work. To earn money and one worker can easily replace another. The employees take advantage of it and ignore workers safety in workplaces. This is the reason children that every now and then we hear the reports of accidents in construction in construction sites. Here it is the responsibility of the government to ensure that safety laws are enforced. The government has to see that the right to life under article 21 of the constitution. Is not violated. At the time when bhopal gas tragedy occurred the safety laws in india were very weak. And those two were not and forced. Like the government officials didn't recognise the union carbide plant as hazardous. And allow it to be established in a crowded area. Some municipal officials objected that it was a safety violation. But the government argued that it would provide jobs. Even after repeated incidents of leaks from the plant it got continuous approval from the government inspector. This was one of the many examples which show that. The interests of the people and their safety were neglected or denied both by the government and by private companies. In 1984 in india not only the safety laws were weak but the laws protecting the environment but also very few and hardly enforced. Actually the environment was considered a thing for free. That could be polluted the air and water could be polluted by any industry. Indicate as in the case of union carbide it didn't have to spend any money to clean up the pollution. After the bhopal gas disaster the issue of environment protection was highlighted people realised that the existing laws were inadequate. As the environment list. Pressure increased the indian government made new laws on the environment. And the polluter was to be made answerable for the damage done to the environment. The bhopal the people share the environment. Over generations. So it is its destruction on the name of industrial development could not be accepted. In many judgements the courts upheld the right to a healthy environment as essential part of the fundamental right to life. And made the government responsible to make laws and procedures that can check pollution. Clean rivers and impose heavy fines for the polluters. But children. There is another aspect also of the environmental issue. And that is. While on one hand the courts have come out with strong orders on environmental issue. On the other hand these orders have badly affected many people's livelihoods. How. For example the coats directed many industries in delhi which were this discharging. Polluted water in the river yamuna to close down or shift out of the city. But. Due to the closure of industries many workers lost their jobs or were forced to move to far off places where these factories had. Relocated. Does this growing concern for the environment. Is often at the cost of the poor. Therefore the present requirement is to find solutions where all people can benefit from a clean environment and workers interest can also be protected so that the right to life is a cheap for all. One way through which it can be done is that the factories should gradually shift to clean our technologies and processes. In this the government should encourage and support such factories. And find those who cause harm to the environment. Now children. To check your understanding of the topic here are some questions. First question what is the role of government in ensuring social justice. Second question what do you know about bhopal gas tragedy. Discuss the role of government in this regard. Third question what is the worth of an indian worker. 4th write the adverse effects of orders on environmental issues given by courts. If you found this video helpful and wish to watch more of such content do consider subscribing to the channel. If you have any queries or comments. Please post them in the comments sectin below thank you.",
    "keywords": "laws,ensure,government,safety,company,people,workers,india,uc plant,bhopalplant,exploitation,laws protect,ensure social,ensure social justice",
    "domain": "Social",
    "title": "Law and Social Justice",
    "faculty": "Singh"
  },
  {
    "duration": "9:59 min",
    "video_url": "https://drive.google.com/file/d/1q-Dn8vhEIpiGuFIAMeQC6FYC7Nfa3GQ9/preview?usp=share_link",
    "transcript": "Hello everyone. I am kiran joshi. Hope you all are. Welcome you all in class 5 evs chapter the great indian desert. This chapter will try to understand the location of the great indian desert. I will learn about its physical features. Its climate. The importance of the great indian desert. But first of all let's understand what is a desert. Such a desert is an area of land that is very dry because it gets very low amount of rainfall or no rain at rainfall at all. And therefore it has almost no water. Trees or plants. In this chapter we are learning about the great indian desert which is also known as the thar desert that means great indian desert and thar deserts are the name of. Simplest. Let's understand the extent of the great indian desert on the thar desert. Such that it stretches from the gujarat plains in the south. Up to the borders of punjab and haryana in the north. As you can see in the given image also. It means the gujarat plains make the southern border of the thar desert. And in the north the southern boundaries of punjab and haryana border it. The aravali range which is the oldest mountain range in india marks the eastern border of the thar desert. This was about the location of the great indian desert. Now let's understand its features. The great indian desert or the thar desert is very large dry region of saint and rocks. This large region is small small hills of sand which are known as sand dunes. So pasand yun is a small amount or hill of saint which is formed by the wind. Set children. That this region is very dry. It is because it's receives very little. Or you can say low rainfall. The luni river is the only river in the desert. It is a seasonal river and does not have much water throughout the year. A very obvious question that comes in our mind is how did people travel. Through the this vast desert. Children in the olden days people used camel to travel across the desert. In fact you might be knowing that camel is called the ship of the desert. You know why. It is because of its physical advantages which help camel to move in the desert easily. For example it has long padded feet. That help it to take long strides on hot sand and water easily. Camel stores food in its hump and can travel without water for many days. Due to these reasons camel is truly the ship of the desert. Nowadays jeeps are also used in cities as means of transport. Now as we know that that. There is very little or no rainfall in the thar desert. This great scarcity or shortage of water. Due to this water shortage very few plants grow here. Which plants do not need much water. To survive in the desert such as cactus ki qubool it sector. The desert plants. Have some special features. For example they are generally thorny and have long and deep roots. The thorns help preventing loss of water and the deep roots help plants take water from surface ground level. Dude region is usually drive with no or very little vegetation. In some places children in the desert there are oasis to. Oasis is a place in the desert where water comes up to the surface from deep underground. The presence of water makes the surrounding area green and fertile. So much green and fertile place in the desert is called a an oasis. Is this oasis provide suitable conditions for human settlements venue villages are developed around them. Is the desert area has great shortage of water the government has tried to solve this problem and provide water to the people of desert by building a canal. Canal is a human made waterway or you can say an artificial water way. That is used for irrigation travel and the water for a canal usually comes from a connecting river lake or ocean. So here a canal is built called indira gandhi canal. Which is named after the first woman prime minister of india mrs indira gandhi. This canal gets water from the river sutlej and beas. This is the longest canal of india. The indira gandhi canal has provided water for irrigation facilities. For drinking and industrial use. This irrigation has resulted in the increase in agricultural production as well as the cultivated area. Does this canal has transformed a vast area of barren desert into fertile and good fields. In many crops such as jwar bajara mein barley. And even wheat are produced here. A large number of people in the desert are nomads. Nomads are people who move from place to place. The banjaras are the nomadic people in the thar desert. Their main occupation is cattle rearing. So dikki on moving from place to from one place to another for the availability of water and pasture for grazing their animals. These nomads are considered to be expert in making goods of iron. Some moments are salt traders fortune tellers jugglers acrobats. Snake charmers grindstone makers and basket makers also. Children the handicraft work and the tie and dye of rajasthan is very popular not only in india but also in abroad. And is a great source of earning as well. This is one of the many important aspects of the thar desert. Let's understand some more points of importance of the great indian desert. So the first point is the beauty of this region. The tourists from within the country as well as from abroad. Come and visit this place attracted by its beauty. The desert is also very famous for its lively festivals such as teej gangor pushkar fair at 17. People visit here to witness and enjoy this festival. This region is also known for its vibrant colourful traditional clothing and attractive native jewelries. Jaipur jaisalmer jodhpur bikaner and udaipur are important cities of the thar desert. 10 places of many historical and tourist sites. Therefore many tourists from india and abroad visit here. Not only this the region is also has also many wildlife sanctuaries such as ranthambore sariska bharatpur. Which provide shelter to many wild animals as well as birds such as tigers panthers deer it sector. These wildlife sanctuaries are also a great attraction for people to visit here. The region is also quite popular for the beautiful historic grand palaces and forts. Which was built by the rajput kings. Does rajasthan becomes one of the most popular tourist destination of india where. Both domestic and international tourists arrive. Now let's understand. The climate of this region. Saathiya children the climate of the great indian desert is extremely hot in the summer and extremely cold during the winter. It is because of the presence of sand. The send has the feature that it absorbs heat very fast so the days are very hot. And in the same way it cools down very fast. Tu. Making the nights very cold. And the amount of rainfall in this in the desert is generally quite low. So this was about the thar desert or the great indian desert. Hope you liked the video and found it useful. Don't forget to subscribe the channel. Thank you.",
    "keywords": "desert,water,rainfall,importance,little,indian,indian desert,beautiful,canal,sand,etc,desert area,desert area receive,area receive,area receive little",
    "domain": "Geography",
    "title": "Indian Desert",
    "faculty": "David"
  },
  {
    "duration": "17:12 min",
    "video_url": "https://drive.google.com/file/d/1-2mFuQM3UQSBxfWUkNungJJ7gAaew7Tu/preview?usp=share_link",
    "transcript": "Hello everyone i am kiran joshi. Hope you all are safe and sound. Here i am presenting the first video of class 8 geography chapter 3 mineral and power resources. First of all. We should know what is a mineral. So its definition is. A mineral is a naturally occurring. That has a definite chemical composition. It means. Minerals occur naturally and are not made by humans. They are solid substances. Which are made of one or more elements combined together. Minerals are unevenly distributed on the earth. They are concentrated in a particular area or rock formation. There are some minerals which are found in such places which are difficult to access. For example the arctic ocean bed and antarctica. Children in such. Inaccessible places the extraction of minerals becomes. Very expensive or technically difficult. Therefore becomes an profitable. Definition of minerals we have already learnt. That minerals are formed naturally without any human interference. They are formed in various geological environment under different conditions. Do frocks. Which contain enough minerals so that mining dam is economically suitable are known as coarse. Minerals are identified through their physical properties. Such as colour density hardness. And chemical properties such as solubility. Children there are nearly 3000 different minerals. These minerals. On the basis of composition are classified mainly as metallic and nonmetallic minerals. Metallic minerals can further be classified as ferrous and non ferrous minerals and non metallic minerals may be organic and inorganic minerals. Metallic minerals contain metals in raw form. Now what are metals. Suchandan metals are hard. That conduct heat and electricity. Metals have a characteristic luster. Aur shine. Iron ore. Copper manganese are some examples of metallic minerals. As i said earlier metallic minerals may be ferrous or nonferrous. Dose metallic minerals. That contain iron ore called ferrous minerals for example iron ore manganese chromite at 17. Non ferrous minerals are those metallic minerals which do not contain iron but. They may contain some other metals. For example gold silver copper these are the examples of non ferrous minerals. This was about the metallic minerals now the non metallic minerals as the name itself explains do not contain metals. Some examples of non metallic minerals are. Limestone mica gypsum and mineral fuels like coal petroleum et cetera. Now the non-metallic minerals are either organic or inorganic by origin. Non metallic minerals that contain carbon are. Organic myntra. For example. Coal natural gas petroleum. Why inorganic minerals do not contain carbon. Such as mica limestone graphite. No the question is how are the minerals extracted. Extraction of minerals can be done by mining drilling or query. Mining can be open cast mining or shaft mining. First let's understand what is mining. So my name is the process of taking out minerals from rocks. Buried under under the earth surface. Mining can be open cast mining and shaft mining as i said earlier. When the minerals that lie at shallow depths are extracted by removing the surface layer it is called open cast mining. And to reach mineral deposits. That lie deep below the earth's surface deboss called shafts are to be made this is known as shaft mining. Is petroleum and natural gas occur for below the surface of the earth. So to take them out deep wells are bored. It is called drilling. Drilling is also done offshore. When the minerals that lie near the surface are simply dug out. The process is called query. No let's see the distribution of minerals over the earth. Min minerals occur in different types of rock. Such as. Igneous rocks metamorphic rocks and sedimentary rocks. Mostly metallic minerals are found in igneous or metamorphic rocks. Which mate large plateau. Iron ore in the chota nagpur plateau in india iron ore in north sweden copper and nickel deposits in ontario canada. An iron ore nickel platinum and chromite in south africa these are some examples of minerals found both in igneous and metamorphic rocks. No sedimentary rocks. Which are formed along the plains and young fold mountains have. Deposits of non metallic minerals. Which may be organic or inorganic in origin. Limestone deposits in the pocket-size mountain in france. Magnus deposits in ukraine and georgia georgia. And the phosphate belts of algeria are some example. Of non metallic minerals. Mineral fuels like coal and petroleum are also found in between layers of sedimentary rocks. No let's see the distribution of minerals in different continents. Let's begin with asia. In asia which iron ore deposits are found in china and india. Asia produces more than 50% of the world's tin. China malaysia and indonesia are included among the world's leading producers of tin. China leads in production of lead. Antimony and tungsten. Saudi arabia. Iran iraq kuwait. They have world's largest reserves of petroleum and natural gas. The continent that means the asia continent also has large deposits of magnesium bauxite nickel zinc and copper. No ip talk about europe. So europe is one of the leading producers of iron ore in the world. Russia ukraine sweden and france. These are the european countries which have large deposits of iron ore. In eastern europe and eastern russia copper lead zinc. Magnesium and nickel are found. The root value of germany is rich in coal deposits. No let's find which minerals are found in north america. In north america there are three major zones where mineral deposits are found. Dr the canadian region north of the great lakes. The appalachian region and the mountain ranges of the west. In the canadian shield region iron ore nickel gold uranium and copper are mined. Rich coal deposits are found in the appalachian region. Western toddler car dealers have vast deposits of copper lead zinc. Gold and silver. No in south america. In south america brazil is the largest producer of high grade iron ore in the world. Chile and peru are leading producers of copper. Brazil and bolivia are among the world's largest producers of. Large posits of gold silver zinc. Chromium. Magnesium bauxite mica platinum. Asbestos and diamond. Are also found in south america. Mexico. Venezuela. Argentina chile peru and colombia these countries are rich in mineral oil. Next continent is africa this continent is rich in mineral resources. Africa is the world's largest producer of the. Precious minerals like diamond gold silver and platinum. A fairly large part of the world's gold is produced by south africa. Z. Ent zimbabwe. Some of the other minerals found in africa copper iron ore. Chromium uranium cobalt and bauxite. Oil is also found in sorry oil is found in nigeria libya and angola. Then comes australia continent which is one of the largest exporters. Of minerals. For example. It is the world's leader in the production of bauxite. Iron ore. Call gold. Diamond tin and nickel. Australia is also quite rich. In magnesium copper lead and zinc. Cal guru sorry and. School garden areas of western australia. Have the largest deposits of gold. If we talk about antarctica so children. Geologists and geography was have identified the existence of a variety of minerals deposits. Among which. Some may be quite large. It is a it is forecasted that large deposits of coal in the trans antarctic mountains. And deposits of iron ore near the prince charles mountains. Of east antarctica may be found. Even gold silver and oil are present there in commercial amount. However children mining for commercial reasons. Is ben dear. Only researchers continue to do some mining here in order to find answers to their scientific queries. This was about the. Continent wise distribution of minerals. Now. Let's see the distribution of different minerals in india. Let's begin with iron. In india deposits of high grade iron ore are found. The mineral is found mainly in jharkhand odisha chhattisgarh madhya pradesh. There are also considerable deposits of iron ore in goa maharashtra and karnataka in south. Now the box the another mineral bauxite. The bauxite is the ore of the metal aluminium. In india odisha is the largest producer of bauxite. Other bauxite producing areas are jharkhand chhattisgarh madhya pradesh gujarat maharashtra and tamilnadu. India is the largest producer and exporter of mica in the world. Its deposits mainly occur in jharkhand bihar andhra pradesh and rajasthan. Another major mineral found in india is copper mainly produced in rajasthan madhya pradesh jharkhand karnataka and andhra pradesh. Magnus. Magnesium which is a ferrous mineral is mainly found in maharashtra madhya pradesh chhattisgarh odisha. Karnataka and telangana. Major limestone producing states in india include bihar jharkhand odisha madhya pradesh. Chhattisgarh rajasthan gujarat and tamilnadu. Now the another mineral is gold in india kolar in karnataka have the largest deposits of gold. This gold mines are very deep. In fact they are among the deepest in the world. Due to which meaning of this word that means gold is a very expensive process. Then comes the mineral salt. Which is obtained from seas lakes and rocks. India is one of the leading producers and exporters of salt. Gujarat tamil nadu and rajasthan are the leading states in salt production. If it talk about the uses of minerals then children. There would hardly be an industry where minerals are not used. Minerals are used for gems. Such minerals are usually hard. They are then set in different styles for jewellery. Copper is an indispensable metal in the electrical industry. Because it is widely used for making wires. Electric motors. Transformers and generators. Earlier it was used for making coins also. So we can see that copper is used in everything from coins to pipes. Silicon is another very important mineral which is used in computer industry and is obtained from. Quads. Then aluminium. Which is obtained from the from bauxite it is used to manufacture automobile automobiles automobiles. And aircraft. It is also used by industries which deal with construction furniture fittings and kitchenware at sector up. Minerals have and its uses. But we must remember that minerals are non renewable. Once exhausted day take a very long time. Seth thousands of years to develop and therefore they cannot be replenished immediately at the time of need. Because the rate of their formation is much much slower than the rate at which we consume these minerals. Therefore they have to be conserved and not be misused at all. It is necessary to reduce their wastage in the process of mining. Another way is the mineral in which the mineral resources can be conserved is. The recycling of. Metals. That's all for this video the rest part of the chapter will be covered in the next video. Till then try to solve the following questions. First mission. Describe briefly. Methods of extraction of minerals. Second question. Minerals occur in different types of rocks. Explain. Third question. Describe the mineral distribution in africa and australia. 4th question. Write the common uses of minerals. Why are minerals considered nonrenewable. Children. If you found this video helpful and wish to watch more of such content. Do consider subscribing to the channel. Also if you have any queries or comments. Please post them in the comments section below. Thank you.",
    "keywords": "minerals,iron,deposit,iron ore,ore,copper,mineral,india,rock,pradesh,manganese,gold,nickel,metallic,producers",
    "domain": "Geography",
    "title": "Minerals and Power Resources",
    "faculty": "Kalaam"
  },
  {
    "duration": "9:06 min",
    "video_url": "https://drive.google.com/file/d/16UruczqCh_OwXB4CgBhz8r2Vo-cZPq3V/preview?usp=share_link",
    "transcript": "Hello everyone i am kiran joshi hope you all are fit and fine. Inner journey of physical divisions of india let's learn about the coastal plains and islands of india. This video. Look at the map in front of you. You will notice to strips of plains along the east and west coast of india. These are the coastal plains of india. Children a coast is the area or the land where it meets the sea or the ocean. You can also see that a ghost is a line that makes the boundary between the land and the sea or the ocean. So children our country has a long and beautiful coastline which extends for about 7,000 km from rann of kutch in the west. West bengal in the east. It means it stretches all around the indian peninsula. The coastal plains are broadly divided into the western coastal plains and the eastern coastal plains. So let's begin with the western coastal plains. The western coastal plains are located between the western ghats and the arabian sea. The western coastal plain is long and narrow. As shown in the image also. The western coastal plains have many small girls and bays. Girls and bays are the different types of water bodies. These girls and base on the western coast provide many natural harbours. Harbour is an area of the sea along the coast which is deep enough and partly and closed by the land so that the ships of the boats can be left there safely. Some famous natural harbours in the western coastal plains are mumbai in maharashtra vasco in goa and kochi in kerala. Also there are several ports on the western coastal plains. A port is a town or a city that develops around a harbour where ships load and unload their cargo and passengers. The western coastal plains can be divided into three parts. Gujarat coast. Konkan coast and the malabar coast. The northernmost part of the western coastal plains is the gujarat coast. If you look closely to the given image you will see children. That it is. Broadest between the gulf of kutch and the gulf of khambhat. As i said earlier that a girl is a type of water body. To make the term more clear to you i can see that a girl is a large area of sea or ocean water which is partly surrounded by land. To the south of the gujarat coast lies in the konkan coast. Konkan coast is stretched up to goa. Kumkum cost is. Quite narrow rocky and uneven. Therefore we find many lighthouses across the coast to warn the ships so that they may remain away from the rocks that lie just beneath the surface of the sea. You will be curious to know. The meaning of the term lighthouse so children look at the image in front of you. It is the image of a lighthouse. A lighthouse is a town or visit our autol building. With the powerful light on or near the sea to guide ships away from the danger. The konkan coast is rich in oil resources. And many oil wells such as bombay high court found here. 22 further south lies the malabar coast. The coastline here has an even edges. Malabar coast is known for its numerous lagoons or backwaters. Children a lagoon is a lake of salt water which gets separated from the sea by barrier islands or leaves. Now let's learn about the eastern coastal plains. The children the eastern coastal plains are located between the bay of bengal and the eastern ghats. The extent from ganga delta in the west bengal to kanyakumari in tamil nadu. The eastern coastal plains are comparatively broader than the western coastal plains. There are a number of southern rivers such as mahanadi godavari krishna and kaveri. That flow eastwards and fall into the bay of bengal. These rivers form deltas along the eastern coastal line. The learnt here is very fertile. Because of the mineral rich soil brought by these rivers. And a lot of rice is grown in this area. So just plane is also known as the rice bowl of india. The eastern coastal plains of india. Have many ports among which. Chennai and visakhapatnam aro. Great importance. The eastern coastal plains can be further divided into two parts the northern part is of the eastern coastal plain is called the northern circars and the southern part is called the coromandel coast. The eastern coastal plain and the western coastal plain meet at kanyakumari in tamil nadu. Kanyakumari is the southernmost point of the mainland of india. Another important fact about kanyakumari is. That at this place the three water bodies around india. The indian ocean the arabian sea and the bay of bengal meet. Two children. Sofa in this video we have learnt about the coastal plains of india. Now let's try to understand. Aur learn about the island groups of india. First of all let's understand the meaning of island. So and i let is a small piece of land. That is surrounded by water from all around such as a lake. River or sea. India has 2 island groups on both sides of the indian peninsula. These are the andaman and nicobar islands located in the bay of bengal and the lakshadweep island situated in the arabian sea. Andaman and nicobar islands. Lie in bay of bengal. Dr rafli 572 islands. Out of which. Only 38 islands are inhabited. A large part of the population consists of tribal groups. Port blair is the capital of andaman and nicobar islands. The famous cellular jail is also in andaman and nicobar islands. Andaman and nicobar islands are mostly hilly islands and are covered with forest. The lakshadweep islands lie in the arabian sea consisting of 36 islands. However only 11 islands are inhabited. Kavaratti is the capital of lakshadweep islands. The lakshadweep islands are generally flat these islands are well known for their coral deposits. You might be thinking of wondering what are corals so children corals are tiny sea creatures. With a hard body covering. Now let's learn about the importance of the indian coastal place and the island group. Several big and small ports are there along the coastal areas. D sports play an important role in the growth of natural a national and international trade. Then there are several harbours also. Then many coastal towns and cities are great attraction for tourists. Fishing is an is one of the important occupations for many people here. Many different types of crops are grown in this region for example rice coconut rubber et cetera. The island groups of india are very popular and attractive tourist spots. If we talk about the climate. This region has moderate climate. Because this region is quite close to the sea during the day it is warm and humid. How about the nights are mostly cool. The reason behind it is that at night the sea breeze blows. Towards the land from the sea. That's all for this chapter. Hope you found this video helpful. And if you like this video. Do remember to share and subscribe to the channel. Thank you.",
    "keywords": "coastal,coastal plain,plain,islandscoast,eastern,western,india,eastern coastal,western coastal,western coastal plain,water,coastline,eastern coastal plain,gulf",
    "domain": "Geography",
    "title": "Geography - Coastal plains and Islands",
    "faculty": "Singh"
  },
  {
    "duration": "16:51 min",
    "video_url": "https://drive.google.com/file/d/1qLOoSObz9-u7H7arJi2G6dscCIrCodQh/preview?usp=share_link",
    "transcript": "Hope you are fine. Michael super welcome to the geography chapter agriculture for class 8. Food mood. To understand about the various kinds of. When we can find economic activity there are three major. Primary secondary inter. Primary amine. We are using the product which comes from neet. Hunting gathering. Example. Aadhaar. Nature. Secondary active. It will be difficult in the later chapter. Looking for skin primer. What is sericulture. Medical treatment of rock and domestication of animals. Play a significant role in our mind. Cultivation of crop one of the select sorry. Workonic. Law of the land. Chaudhari. Provide water to the free. Look up the growth of plant and find and harvest. Sperm is 13. Hindi film agriculture human being. Letter try to understand the term. Letter to writing word that. Jigar + culture. Culture means cutting. Today more than total world population are depend on agriculture. Why. India population engaged in agriculture. Direct directory in education. Simple frock. Blouse. Which light show. Examples of agricultural activities. Sunflower oil from and earring. Let's discuss about the components of agriculture sector. So. It is the times of cultivation on the soil raising crops. Second one. Horticulture. The art of going with flowers. Fruits for commercial use. Sericulture. Science of commercial rearing of silkworm. 481. The art of breeding of fish in sanskrit. Viticulture. It is the art of. Cultivation of grapes. 9 letters understand what are the factors influencing agricultural activities. Effective. Vaswani metrocast. Other one man made. It's about metro factory. Diya. Water and. Understand. The first national factories release. What is relief. Control in agricultural activities. And lowlands are motu table for agriculture. Complaint. This is because in the india. Left for time in the problem of soil erosion is high. On the contrary that problem are absent in the plant area. We provide. Best conditioner for agriculture. Most of the early civilization and clean area. The second one is drawing. City of music and ganpati. What is the basis of any form of agriculture. What is the meaning of moisture and food for decline. Acceptable only for the growth of varieties of crop. I do not support the growth of plant. What. What are you official for the growth of plant for example. Provide food crop production as compared to those who live in the gradation prosperity. Plant that. The british control or the arable land of the world. The land on which. The crops are grown is known as. Temperature in false not given for the farming activity. Now we will moon to magnet. Machine. In the farming activity. Song. Both the chemical to get more production in the farm. Use of fertilizers and charm of soil and also their production. Agricultural activities. Public importance board ceiling. Video of labour force save from and. Market and transport. Transport for the movement of agriculture product from agriculture field. To market. Market production by the farm. Now you're going to be. System. Output control. Sofa vineet. Machinery and labour. Let me what we do with input how we use it. Slogan. Show me reading. What we give from the applet. Dairy product. Wallpaper. Not the most important topic of the chapter types of farming. Category. Satnam swami ki commission. Show me the picture. We are not using for our own purpose. But. For how to write purpose. Meet the need. Abhi pharma sanam. By using low level of technology and houses. The needs of the car. What are the features of. The sun. Production consumer id form. Variety of crops are grown by the farmer. The use low level of technology multi and household table. Production is relatively low and the farmers originally. Are you fine. 10 lakh in surface production. Primitive. Song. Intensive cultivation. Small plot of land. Simple and treatment tools are used in agriculture. Number of labourers. Small plot of land provide only one crop anjali. Only manthan region of india. Shifting cultivation examples. Discuss about shifting cultivation is also known as slash and burn agriculture. Cutting burning. Then that is of the boundary of the mix with the soil. Different types of crops are grown. But when did it the form of another. Education ameen. Potato name. Crops grown under 15 cultivation. Done by the tribal people living in the tropical forest. Forested areas of amazon basin tropical africa. 514 southeast asia aadami ingredients ravishing cultivation extract. Nomadic herding for livestock farming. Different culture operation. Hindi story hot man moved from one place to another with this animal. Did you show in search of water in for the pending. Folder definition. Goat camel adhiniyam in the human body. To get wool. I need another. Jammu and kashmir and in parts of central asia. Commercial farming. And don't forget to send. Market. About the features of the commercial form. Can be intensive or extensive agriculture. More profit is the main motive of the communication it is done on use plot of land. Modern techniques and tools are used in the farm. Both sides of abdomen in commercial form. About commercial farming. Which is factors on the large farm reading over hundreds of. 4000. Magic quality and modern techniques are used in. Type of farming. The crops are grown for selling purpose. Effective in the temperate grasslands of asia europe and north america. Mi. The second type. Funny life of along with the farming of food and fodder crop. Both activities are practiced on the same formula. Hindustani table. Alpha. Arjun animal. The diary animals and poetry. App to get milk and milk products and meat. The ages of the farmers to maintain a high standard of living. The animal. Also help to maintain the fertility of the soil by providing a natural manual. Which type of farming is practised in south africa south east australia europe. Usa. Plantation crop of burger king ki copy banana cotton rubber. Aur kaisi drone. Plant compressor crop top industries and then translated in water. Jyada non veg. Captain america shield wallpaper. In the form. Nearby. Plant efficient and synthetic methods of farming are used in. Culture. Mere dialogue transport network is very special. Plantation agriculture with more mostly practice in the tropical and subtropical areas of the world. Common india. Sri lanka malaysia. Brazil. Remove the last section of the chapter agriculture in indian and other name. Morning shift be taken to achieve this. Man used to obtain higher. Chemical fertilizers and pesticides. City of the digits of a drag area and the number of crop. Drone should be in two should be improved. Modern tools of agriculture should be used to get more production and profit. Food security. Is the condition of the street in which all people at all times have access to sufficient space hygienic food to meet the drive me. Different country have different levels of agriculture development. Countries like usa canada australia platform. Which countries are you in advance in modern techniques in agriculture electric. Population and small farm tractors in agriculture of the family are we can keep that both the developing and developed country have to front. Aaj tak ka parichay. Nothing but the following steps should be taken in order to meet the demand of our growing population. Children. Please do the working. Thank you.",
    "keywords": "agriculture,farm,subsistence,activities,cultivation,crop,increase,commercial,subsistence farm,primary,commercial farm,labour,intensive,activity,rear",
    "domain": "Geography",
    "title": "Agriculture",
    "faculty": "Sharma"
  },
  {
    "duration": "8:40 min",
    "video_url": "https://drive.google.com/file/d/197mC0tulj0DMpEXbBlM9rVWqWGnHRGFJ/preview?usp=share_link",
    "transcript": "Hello everyone. I am kiran joshi. Hope you all are safe and sound. Welcome to class 6 geography chapter 2. Blue latitude and longitudes. Look at the image in front of your children. I am sure you'll you all will be familiar with the name of this image. Yes it is a globe a miniature form of the earth. A globe is a three dimensional or you can say true model of the earth because it gives a better idea about the earth. It provides us the correct shape and size of the continents and countries. It also shows the distances and directions without distortion. Globes are available in different sizes and types such as big small and inflatable pocket globes. Now the question arises. How to locate a place on the globe. Children we need some points of reference and lines to find out the location of places. Now. What are these things. Children look at the image of globe in front of you once again. You will see a needle fixed through it in a tilted manner. It is called its axis. Axis is an imaginary line. And the earth spins around this axis. Do you ever wonder why the globe is shown in a tilted manner. It is to show that in real the earth is tilted at an angle of 23 and half degree to the vertical. I am sure you will understand it better with this image. Now look at the two endpoints of the axis. These are the north pole and the south pole. Our earth moves around its axis from. West to east. As the axis is an imaginary line. Imaginary line that run around the globe is equator. As it is visible here children the equator divides the earth into two equal halves the northern half is called an other hemisphere and the southern half is called the southern hemisphere. This imaginary circular line which is called equator is an important reference point to locate places on the globe. Payal circles. From equator up to the poles post means north pole and south pole. Two parallel circles up to equator. Are known as parallels of latitudes of lines of latitude. They are measured in degrees. The equator is the 0 degree latitude. As we know that it is a it divides the earth into 2 into the northern and southern hemisphere. Therefore all the parallels to the north of the equator are termed as north latitude. And all the parallels to the south of the equator are termed as south latitude. The letters in and as are used to indicate the north and south. Latitude respectively. The north pole is measured as 90 degree north latitude. And the and 90 degrees south latitude mark is marked as the south pole. If you look at the figure in front of you once again children you will notice that the equator is the longest parallel. And as we move away from the equator to the poles the size of the parallels of latitude decreases. The north pole that is the 90 degree north latitude and the south pole that is the 90 degrees south latitude. 8 just dots. Now let's learn about the important parallels of latitudes. So far we have learnt about three important latitude. Bihar the equator 0 degree latitude the north pole 90 degree north latitude and the south pole 90 degrees south latitude. Besides these there are 4 other important parallels of latitude. Among which. To lie in the northern hemisphere. Dr the tropic of cancer at an angular distance of 23 and half degree north from the equator. At the arctic circle at an angular distance of 66 and half degree north from the equator. The other two parallels of latitude are in the southern hemisphere. They are the tropic of capricorn at an angular distance of 23 and half degree south from the equator. The antarctic circle at an angular distance of 66 and half degree south from the equator. Children overall there are 181 degrees of latitude. 90 in the northern hemisphere 90 in the southern hemisphere and the equator. This parallels of latitude help us to differentiate the temperature zones are the heat zones of the earth. Children you know that the earth is tilted on its axis. Due to the sitting at the surface of the earth receives an equal heat or solar energy. On the basis of the amount of heat on solar energy received. We can say that the earth has three heat zones or temperature zones. Diya the torrid zone the temperate zone and the frigid zone. Let learn about the torrid zone first. Children the mid day sun shines overhead at least once a year on all the latitude that are located between the tropic of cancer and the tropic of capricorn. This area is shown in red colour in the image in front of you. Therefore all these latitudes get the direct rays of the sun. Meeting this zone the hottest zone. This one is named as torrid zone or tropical zone. Do you know children that most of southern india falls into the torrid zone. Children dress no latitude beyond the tropic that gets direct rays of the sun. Now the latitude that lie between the tropic of cancer and the arctic circle in the northern hemisphere and those that lie between the tropic of capricorn and the antarctic circle in the southern hemisphere get the incline rays of the sun. These areas are shown in this image in green colour. These areas have moderate heat or moderate temperature. They are called temperate zones. The angle of the sun's rays goes on decreasing towards the poles. Pause me the north pole and south pole. Dell latitude between the arctic circle and the north pole in the northern hemisphere and the latitudes between the antarctic circle and the south pole in the southern hemisphere receives very little heat of the sun. This area is shown in blue colour in this image. The sun's rays are always slanting in these areas making these regions extremely cold. Therefore these areas are called frigid zone or polar regions. Now to find out how much you have learnt so far in this video just try to answer the following questions. Question 1. Define a globe. How is it useful. Define these. Latitude. Longitude. Third question name the important latitudes with their latitudinal value. 4th question. Write short note on different heat zones. So children. That's all for this video. To understand the remaining part of the chapter remember to watch the second video of this chapter. Thank you.",
    "keywords": "pole,latitudes,equator,circle,hemisphere,south,south pole,earth,zone,heat,latitude,heat zone,north pole,globe,north",
    "domain": "Geography",
    "title": "Globe - Latitudes and Longitudes",
    "faculty": "Sharma"
  },
  {
    "duration": "17:35 min",
    "video_url": "https://drive.google.com/file/d/1UiXKLiLnLRraBGAIrEjL0yXzOg5Nfs_G/preview?usp=share_link",
    "transcript": "Hello everyone. I am kiran joshi. Hope you all are safe and sound. Welcome to class 8 geography chapter 6. Human resources. We have learnt earlier that. The utility of an object makes it a resource and it is people only that turn these objects or substances into resources with their knowledge and skill. Does. People are the special resource. Latest human resources. Healthy educated and motivated people develop resources as per their need and contribute to the growth of a nation. Is the other resources are not equally distributed. You are the human resources to. They also differ in their educational level. Age and sex. Day number and composition also keep changing. This change is recorded through a process called sensor. In india the census is taken every 10 years. Now let us take a look at the distribution of population. Children. The way in which the population is distributed across the word is called the pattern of population distribution. And this distribution of population in the world is highly uneven. More than 90% of the world's population lives in about. 30% of land surface. It means. That there are regions in the world which are thickly populated because they have equable climate. The get adequate rainfall the land is flat and soil is fertile for example places like south and southeast asia europe and north eastern north america. However population is low in regions where the climate is inhospitable like the high altitude regions extremely cold regions. Cold regions and tropical deserts also and in the dense forest of equatorial regions. Another fact about the pattern of population distribution is that more people live in north of equator or in the northern hemisphere. Then in the. Southern hemisphere. Almost three by fourth population of the world is concentrated in only two continents asia and africa. Another factors that about 60% of the world's people live in just 10 countries. You can see here that these countries have more than 100 million people. One more fact is that more than one third of the world's population live in india and china. No let's learn about density of population. Children density of population is the number of people living per square unit of area or the earth. Earth surface usually it is expressed as per square kilometre. The density of population also varies over the surface of the earth the average population density of the entire word is 51 persons per square kilometre. South central asia has the highest density of population then there are regions of east asia and southeast asia which have higher density of population. India's population density as the as a whole is 382 people per square kilometre. Now let's understand the various factors. That are responsible for the uneven distribution of population. These factors can be can be broadly be classified into two groups. 1 geographical factors. Which include topography climate soil water mineral. And second social. Cultural and economic factors. If we talk about topography so plains have high density of population in comparison to mountains and plateaus. You noted that plains are suitable for farming for manufacturing and service activities. For example the indo-gangetic plains are among the most densely populated areas of the word whereas the himalayas the alps. The andes have low density of population. Then climate of a place also affects the population distribution. Areas with equable and moderate climate have high density of population while areas of extreme climate like sahara desert polar regions of russia canada and antarctica. Are preferred. Are not preferred by people for permanent settlements. Another geography geographical factor is soil. People prefer to live in places with fertile soil as they are suitable for agriculture. Therefore fertile plains like ganga and brahmaputra in india. When he. Change the young in china and the nile in egypt are densely populated. Then water is another very important factor affecting the population density. People always prefer to live in those regions where freshwater is easily available. For example the major river valleys of the world are densely populated wild deserts which are dry have. Parsley population. Sparsh population. Availability of mineral resources and other geographical factor that affect the population distribution like areas rich in mineral deposits. Tend to be more populated. Regions around diamond mines of south africa and areas rich in oil in the middle east are such examples. Other than geographical factors some social cultural and economic factors also play important role in affecting population density. Social factors include education health and housing facilities. Areas with better such facilities have dense population for example pune in india. If we say cultural factor then places having religious significance or cultural importance. Tend to be heavily populated. For example varanasi vatican city jerusalem. Then economic factors also affect significantly on the distribution of population. Places with industries that provide employment opportunities. And places that have good infrastructural facilities like efficient transport network and electricity attract more number of people to settle there. Osaka in japan and mumbai in india are examples of such areas. Now comes the topic population change. This refers to change in the number of people during a specific period of time. If you look closely to the given figure you will see that the world population has grown immensely over the years. The main reason of this population change is due to the difference in difference between the number of births and deaths. Param very long period till before 1800. The word population grew in a slow peace. Reason was many babies died soon after their birth because of less medical facilities. More about production of food was not sufficient to meet the food requirements of all people. Due to all these reasons total population growth was quite low. Then in the year 1804 w population was marked as 1 billion. Then after 155 years only in 1959 what population grew to 3 billion. Such rapid growth of population is called population explosion. Then in 1999 this 3 billion population doubled to 6 billion just within 40 years of a short span. This reason the reason was that due to improve food supplies and better medical facilities the number of deaths. Reduced. However the number of births continued to stay high. Here it is important to tell your children that the number of birds are measured using birthday. Children birth rate refers to number of live births. 1000 people. Similarly deaths are measured using death rate that is the number of deaths per thousand people. The difference between the birth rate and the death rate of a country is called the natural growth rate of population of that country. And the main reason of the increase in the world's population is the fast increase in natural growth rate. Here are the three images. 1 inch yellow second and pink and third in light blue that show the population change due to due to the difference between birth rate and death rate. The first image shows that when birth date is more than the death rate it results in population increase. The second image depends. If birth date and death rate are equal population remains. Study. And as it is clear from the third image. When birth date is less than the death rate the population decreases. Birth and death are the natural causes of population change. However population change also occurs due to migration. Migration refers to the movement of people in and out of an area. This movement can be within a country from one state to another or from one region to another. Aur between countries. Those who leave a country as shown here through a person in green. Are called emigrants. In those who arrive in a country is in the picture hear the person is in red. Are referred to as immigrants. Usa and australia have gained population because in migration or immigration. While students population has decreased due to out migration or immigration. Usually people migrate from one from underdeveloped countries to more developed countries to find. A better job opportunities. Similarly people move within the country from rural areas to urban areas to get employment education or health care facilities. The growth rate of population differ in various countries. While overall overall population of the world is growing. All the countries are not experiencing this growth. Let's tik tik sample of countries like. Kenya that have high population growth rates. Earlier it head birth rates and death rates. However now due to improvement in health care the death rates have decreased. But the birth dates are still high there for the rates of population growth. In such countries are very high. On the other hand. Some countries are experiencing slow rates of population growth. For example united kingdom where both death and birth rates are low resulting slow growth of population. Children many of us has a misconception that. Population always hampers the economic growth of the country. It's not always correct. For example both bangladesh in japan are densely populated countries. But in terms of economic growth japan is far ahead of bangladesh. So to study the role of people as a resource it is necessary to know. More about the composition of the population. Children composition of population or we can say structure of the population refers to the different characteristics of a population in terms of age sex literacy level health condition occupation and income level. It means with the help of the composition of population we get to know the number of males and females. The age group. They belong to. About their educational level. Their occupation. Their income level about their health status at 17. We can understand the population composition of a country with the help of a population pyramid. It is also known as age sex pyramid because it expresses two things simultaneously. 18 shows the total population divided into different age groups such as 529 years 10 to 14 years and so on. Second it shows the percentage of the total population subdivided into males and females in each of the age groups. The shape of the population pyramid of a country reveals to measure details of its people. Dear age group. And sex ratio that is number of females. Per 1000 males. The number of children below 15 years are shown at the bottom. The number of aged people above 65 years are shown at the top. These two age groups that is people below 15 years and people above 65 years are considered as dependents. On economic li. Active working population which was between 15 and 64 years of age. Here. This working population is shown between two blue lines. If a country has both high birth and death rate. Its population pyramid is broad at the base. Rapidly narrows at the top. The reason is despite of the birth of many children most of them die at their early age or infancy. If you become adults ever and even fewer reach to old age. The population pyramid shows here is shown here off kenya is one such example. In some countries like india death rates. Specially of infants are decreasing. The population pyramid is broad at the younger age group as more infant survive. And become adults. Is the population pyramid of india reflects here you can also notice that a large population is of young people which is the indication of active working population. Now let's focus at the population pyramid of japan. The pyramid is narrow at the base due to low birth rates. Is the death rates are also low in japan more number of people reach old age. Children. The future of any country depends on its. Skilled energetic and hopeful young people. And in india we have such a resource. This resource can be highly productive if more investment is done towards the health education and skill development of young people. And they are provided with more opportunities to explore. Now we have come to the end of the chapter. But wait. Some questions are there to check your learning. So the first question is. How to various geographical factors affect the population distribution. Second describe the social cultural and economic factors that affect the population distribution. Explain the factors that affect the population change in a region. Fourth. What is population pyramid. What is its significance. What information can it game. Children. If you found this video helpful and wish to watch more of such content. Do consider subscribing to the channel. If you have any queries or comments please post them in the comments section below thank you.",
    "keywords": "population,people,change,bln,birth,pyramid,population pyramid,population change,death,distribution,deaths,world population,age,death rate,country",
    "domain": "Geography",
    "title": "Human Resource",
    "faculty": "Chopra"
  },
  {
    "duration": "7:07 min",
    "video_url": "https://drive.google.com/file/d/16rTb027NXFSmJ1xmbiA7-Ammn6kNSSiP/preview?usp=share_link",
    "transcript": "Hey guys welcome to eta technology. Manas navjot singh jadeja and we are back with the data mining. Tutorial series. And as you can see today we are going to discuss. Min max normalisation technique. Min max normalisation is part of data pre processing. With the normalisation technique and now the question arises before learning how to apply min max. I want to ask you guys like to understand why normalisation is required if you understand that the process of calculating normalisation. Wire technique would be much more easier. So many machine learning algorithms. Attempt to find trends in data by comparing features of data points. However there is an issue when the features are on drastically different scales. So let's understand what do you mean by the. Basically normalisation is a set of techniques we apply on the data. Especially when they are coming from different scales. Otherwise admin read into errors and decision making or inappropriate decisions because its not matching up in the scale. Example says some of the date of birth we have my b in mi. Some date of which might be there in km and units are different but the numbers are there i will try to compare female lead into inappropriate the season the law of the case is similar to this where normalisation is required to be scaled down to a in a smaller number a range where all the numbers can be incorporated and that is known as normalisation. Understand this weather simple example. Show the simple normalisation technique which will fit the data. A n a predefined boundary or to be more specific a predefined interval. So here we are talking about normalisation which refers to a scaling of data in numeric variable in the range of 0 to 1. And the formula is. Vedas on the data which we want to transform. Is equal to v minus. Vi - main. / max minus min. Into pneumax minus new man + newman. Ceo at the same mathematical formula maybe you don't understand it right away or remember this is an easier way to work it out with an example so let's see that. So let's learn it by a solved example which i'll be doing so here i have range of. A particular product and tuples. Write the increasing order. Supreme 13 272 as you can see a. Agar aditya which is 13 15 16 16 19 up to all the way to 72. Write an award to apply min max normalisation on the value what if i write. What is onto the range which is 02172 transform the whole set of numbers on the scale of 0 to 1 would i do that let us understand. So in order to do this we would require the question. The range of the numbers and also the number to be transformed. Going back to the formula what do we need we 10 is equal to b minus mean. Max minus man. Write into new max minus new men last human. So here we is the value which we want to transform. Write this particular value is the value which we want to transform in here equation it is modified. So we would be knowing that down plus we have a defined range so what we will be doing is. About the question what values we have. Baby listing out here are the given ranges 021. Date on which we want to transform v is equal to 45. Min value which we required here is 13. Wife will also require max which is. 72. New mal s0 and pneumax is 1. So when we gather all this data which is listed here. Into. The formula which is there above it will look something like this. We have the formula which is. V minus main sau vs 45 as we know. So what if i minus main with 13. So as you can see it here. It is 45 - 13. Maximum number in the range 72. So the denominator is 72 -. 13. Now new max new max is one as you can see it here. Right so 1 - 0 is one which is. In here. And you mean which is nothing but. Again. 0. Witches. Zero in here. So 45 - 13 by 72 - 13 into 1 + 0 it is nothing but this particular term. When we mathematically calculate this the result and value is. Zero point. 5423 on the scale range of 0 to 1. Show the new transform point of modify on the scale of 0 to 1 using the given set of value is point 54 23. Anasuya family latest new one more example so you guys can understand it well. So now we have the another set of values we still have the same in maths. Write all of the new values. To the new men and new max is. 0 and 1 the range of value here is. If you can see properly is 200 to 1000. Why so that is the set of values we have. So data with i'll be taking up too transformers 320 can see we have the given range which is. Let me show ada yeh the given ranges. Hero no 1. Data breach of chosen is from the range itself. 300. New. Main is hero old -200. Old max ace 1000. New max ace. 1. Right. Subah how we - ben 300 - 200. Divide by max is 1000 - main which is 200 that comes out 800. Into 1 + 0 to basically we get 100 800 is equal to 0.1 25. Why. And that's the answer for this particular staff. This is how we can get all different values of different ranges into the value of a particular inner transformation range. And this helps the data mining or decision making for machine learning algorithms to work with the data much better. So i hope you would understand this with the sample sounds which we are done. You can practice more and if you can give the feedback to us. Write thank you so much.",
    "keywords": "range,normalization,newman,min max,example,min,data-transform,min max normalization,max normalization,v-min,newman-newman,transform point,example min,example min max,pre define",
    "domain": "Mathematics",
    "title": "Min-Max Normalization",
    "faculty": "Kohli"
  },
  {
    "duration": "5:31 min",
    "video_url": "https://drive.google.com/file/d/1cM8fz-Bwt7XestSaVIzUxpkQevlT2Gz-/preview?usp=share_link",
    "transcript": "Good morning. Start the chapter metric. Genetic fields of numbers for function. And these numbers of functions are college elements or entries of a matrix which can be noted by capital letters a b c and d. Encircled the rows of a matrix and columns of a matrix. In our example c the first matrix is having. 23 rose and. Two columns. And the second matrix is having. Roshan three columns. Citizen hotel a rectangular arrangement of numbers for functions. Hindi film basa functions are called entries or elements of a matrix. Eating limited by using the capital letter. Lines of elements are called the rows and vertical lines of elements are called. Problems of. What is a message to serving ambrose and n columns. It is called the matrix of order in bi. Seat matrix of order mba. General form of a matrix is a 11 a 1219. A11 means that is the first row first column. A1 tumi first row second column. 19 means element of first row into column. 81. Elemental second roop festival of second row and column. 31 may. 32 second wala. A m manish into first column. N2 is a second volume means that is an element of the young through and into. Can element general element that is. Means that is an element in the i throw and get the value of a lies between 1 and m. Value of the lies between 1 and. The number of elements in a number in matrices in into n. Ladies for examination i am having three rows and columns then it will have. 300 26 elements. Discuss about different type of mattress. The first one is 1 km km means a matrix having only one column. Only elements. One column. Then romatic se mattresses having only one row. Square matrix. Soch number of rows and number of columns are equal. It is. M m and n are equal in a number for m is equal to n. What is the square metric. Charges for matrix of order them or other. Diagonal matrix a square matrix is a diagonal matrix. If all the elements in its new diagonal elements are 0. Diagonal elements means like in a square. Diagonal. Elements in the diagonal path that are the diagonal elements. And hindi. All the non diagonal elements are zero. Then. Diagrammatic that is elements will be there in only hindi diagonal all other elements will be. Scalar matrix. Diagonal matrix is a scalar matrix is diagonal of a square. Diagonal matrix means only the diagonal elements will be there and all the other elements will be zero in the scalar matrix means in that diagonal elements all the elements will be equal. Matric. Identity matrix me. What is the most important metric fear. This means it is a square matrix. Then ki style mein tric. It is a scalar matrix work in a scalar matrix if all the equal elements. Identity matrix. This is for your mattress whose diagonal elements are one and all the other elements is it is usually denoted by i. All the elements. Two matrices are said to be equal if they are of the same same order. Send bihari school is there of the same order. Element of a is equal to the corresponding element of p that is. First row first element is equal to first row first element of the other methods. Second row second element is equal to. Second second element of this mathematics.",
    "keywords": "elements,matrix,diagonal,matrix order,columns,diagonal elements,example,matrices,square,square matrix,men,elements zero,identity,identity matrix,denote",
    "domain": "Mathematics",
    "title": "Matrix",
    "faculty": "Kohli"
  },
  {
    "duration": "6:12 min",
    "video_url": "https://drive.google.com/file/d/1T2lNWmtfwR3cz_mKY3FpigWHyKMAXeYe/preview?usp=share_link",
    "transcript": "My name is kushboo. I am going to present my seminar presentation on introduction of machine learning. Where is the table of contents. introduction types of machine learning. algorithm concept of learning system application of machine learning and conclusion. Introduction of machine learning machine learning is a application of artificial intelligence that provide system the ability to automatically learn and improve from experience without being explicitly programmed machine learning focus on the development of computer programs that can accept data. And here is the vs ml vs deep learning is a subset of ai and artificial intelligence is a trend final output machine which mimic like human brain example of artificial intelligence us amazon alexa and son and machine learning machine learning is a subset of artificial intelligence it is a technique to achieve artificial intelligence example of machine learning is spam detection and deep learning deep learning is a subset of ml and it is a technique to achieve complex example is deep learning is number plate detection. And here are the types of machine learning and algorithm there are three types of machine learning algorithm first is supervised unsupervised and reinforcement learning. Supervised learning based on two parts classification and regression and unsupervised learning based on the clustering and reinforcement learning based on collaborative filtering. Supervised learning supervised learning use classification algorithm and regression techniques to develop predictive models. Classification separate the data and the regression fit the data. Is the algorithm of supervised learning linear regression logistic regression decision tree random forest and naive bayes classifier. Linear equation means linear regression is a machine learning algorithm based on supervised learning. It performs a regression task. And here is the it is most widely used of finding out of the relation between variables and forecasting. And different regression models differ based on the kind of relationship and between dependent and independent variable. Where is the equation y is equals to theta 1 + theta 2 into x. Vitamin is a intercept and theatre to is the coefficient of x. Under. Is a logistic regression so a logistic regression is a supervised learning classification algorithm used to predict the probability of target variable the nature of the target or independent variable is. Which means there would be only two possible classes. It's sim in simple word the dependent variable is binary in nature having data coded. Is either 1 or 0 yes or no. Decision tree for decision tree algorithm fall under the category of supervised learning that can be used for solve both regression and classification problem. And a random forest so random forest it is a assemble techniques capable of performing both regression and classification. Task with the use of multiple decision tree and technique called put staple gowtham. And never be classified naive bayes classifier a collection of classification algorithms based on bias theorem. Supervised learning unsupervised learning is a machine learning technique where you do not need to supervise the model instead you need to allow the model to work on its on the to discover information it mainly deal with the unlabeled data. And algorithms of unsupervised learning here is the important algorithm in unsupervised learning hierarchical clustering came interesting and can understand for clustering is an important concept when it comes and supervised learning it mainly deal with finding the structure of pattern in collection of uncategorised data. The cal clustering algorithm will process your data and find natural clusters. In this graph hair cluster interview and cluster c. Cluster is 11 type and cluster beans another type and process is another type of. Calculating resting is an algorithm which builds a variety of cluster. And kimi clustering payment is it is an iterative clustering algorithm which helps you to find the highest value of every attrition. K nearest neighbours k nearest neighbour is the simplest of all the machine learning classify it differs from other machine learning techniques in that it does not produce a model. Even when there is the distance between example the learning speed is slow when the training set is large and. The distance calculation is non trivial. Reinforcement learning so reinforcement learning is an area of machine learning it is about taking suitable action to maximize river in the particular situation. And reinforcement learning differs from the supervised learning in a way that in supervised learning the training data has the. All answer key with it so the model is trained with the correct answer itself where in enforcement reinforcement learning there is no answer but the reinforcement agent decide what to do perform the task given task. The concept of machine learning system. And in concept of learning in ms system is learning is equals to improving the experience at some task. Where is the improved over task tea and with respect to performance measure ap and visual experience. Application of machine learning face recognition and speech recognition and self driving technologies. And so on and meaning. In conclusion as we move forward in into the digital age our technology continues to lives and. Straight forward this incredible from form of artificial intelligence is already being used in various industries and professions. From marketing to medicine and web security. This technology can improve our life in several numerous way. Thank you.",
    "keywords": "recorder,machine,regression,machine learn,supervise,supervise learn,learn,decision,decision tree,algorithms,unsupervised,unsupervised learn,experience,reinforcement,cluster",
    "domain": "Computer Science",
    "title": "Machine Learning",
    "faculty": "Kohli"
  },
  {
    "duration": "13:34 min",
    "video_url": "https://drive.google.com/file/d/1wseNdVxP-tR3GViRk1aKR91Znou-HJLu/preview?usp=share_link",
    "transcript": "9 chapter 6 going to move to rank retrieval. And. We're going to look at a model for information retrieval that is going to be different from. The boolean retrieval model that we have been considering sofa. The new model that we are one look at is called and retrieval and this is a. A model that. Closer to what. Real world search engines you. Because. In the boolean retrieval model. The semantics of. Abul enquiry was such that. Either document matches the query or doesn't match the query. There was no. Gradation of matching either a document matches the query order doesn't match depending on. Whether or not it satisfies that boolean expression or not. The problem with boolean query was that. The problem with the boolean retrieval model in general. What's that. It's not something that the majority of users would find useful. It was useful for. More sophisticated users. Is example of. Noise and westlaw. You have a precise understanding of their needs. And i can express that precise understanding in the form of boolean query. But we can expect ordinary users. Auto pk table off. Writing such long. And precise boolean queries. The other thing with boolean retrieval is that. It may be good for applications. Which consume the results of a search index. To ab if the results of. Offer query are not going to be consumed by a human but are going to be consumed by an application. This kind of a model may work because i applications can automatically. Pass. Thousands and thousands of reserves. But if you are going to return the search results to. Human user. Then. Problem is that if we have thousands of results. In in your. Apollo query. The users can't be expected to wait through so many results. An aesthetically crew of web search where users don't have that patience to. Look beyond the first no20 documents. And this is my ranking becomes useful because if you are going to be returning. Results that are. Thousands on millions of documents long as we saw for some queries in past lectures. Is very important to be able to rank. Those documents related to the query so that the users can find the most. Relevant documents. All documents that match the query most closely. And the verito. So that you don't have to. Consume so many results we can just look at. Who police the most important results. Suggest to elaborate on a couple of points. One of the problems with boolean search. Is that. Why do you have these houses of results. Aur. You get this other extreme. When you interpret too few results. Siri call how do. How do lawyers at westlaw use boolean queries. The start of the short query. And for very short query you can expect. Results to be. Very large number. Because your creamy not be precise to start with. And then when you get to money results more than what. You can actually pass. You could add some more terms to your query. And. Along get your query to make it. More precise. And that could hopefully cut down the results. The number of results that you are getting. What often happens is that. As you start making your query. Longer and longer. Number of results does decline but. It can often suddenly drops to zero when you along gate queries. For the beyond a certain point. Net per example. User query. Standard user dealings 650. This food. Exam point of few years ago at least this was dealing about 200 2000 hits. Undertaker search engine. Brij vihar displays no card found. It kills 0 hits. 100. The problem with boolean search here is that you either get up east of result for women officers. Kishor koi is too short you make it too many results that you can handle. Insert query is too long then you may get to pure results. And it takes a lot of skill to come up with a precise bully enquiry that will return. Manageable number of it's just enough that you can. Pass through. Keshav. Aur queries in general 10 to give to many results. And long. Conjunctive queries 10 to give you results. So we need some kind of. Trade off. All are we need to make life easier in that. We want to be able to. Match. Query. Match the query with documents even if. Match is not totally precise in case of boolean queries. Other document matches the query or it doesn't matter. What happens in a in an actual search engine is that. Instead of using boolean queries uses type in pretexts queries. It's very uncommon to find. People typing game a bull enquiry on google. Usually devil just type in a set of words. And. This kind of query is called the free textarea because those set of words don't necessarily specify any kind of a boolean operation. For example i could write a. Query like india. Capital. I am intend to. Get information about the capital of india. I can write a free text query like this. And. I need documents talking about the capital of india. But i can express it in this way. Interpreter as a free text query. So. Rather than. This query being in a particular query language. Boolean query language. Where we use terms and then connect them using operators. Where is just one or more words in human language. And. Rather than a particular document exactly. Satisfying this query on not satisfying this query. In ranked retrieval. In inder and retrieval model. Going to. Return. List of documents. Such that the documents at the top. Match the query better than documents. Order below in the list. Sudhar graduation in the quality of the match. It's not like a binary case where a document matches for it doesn't matter. Brother gradation of quality of match. Ism documents may match the query better than other documents and there is a. There is a continuous notion of how good are matches. Pawan can assign score. Given document and say that documents with the highest score match the query better. Night show. Brand factory sale. Has. Normally been associated with free texperia zameen. You can think of free text queries. Being combined with boolean retrieval model instead of boolean queries it so we had. Boolean retrieval model. Mera. Other document matches the query or it doesn't match and that's associated with boolean queries. And typically and retrieval model. The associated with free text queries. I want to see that. This is the kind of modal that is. Employed in. Search engines. Vishva. Is not common to have brand factory velocidad with full enquiries or boolean retrieval associated with free text meaning. This is how things go together. We don't get this feast of famine problem in ranked retrieval. Even if the resultset is very large. Send problem because. Your documents are ranked in decreasing order of. Proximity to the query order elements to the query. And we can always just show. The top 10 result like google does. You don't have to bombay the user with thousands and thousands of results. Under 2 in a scrambled order as an. Boolean retrieval pick and drank the. List of documents for the user doesn't get overwhelmed. And of course assume that we have a good ranking algorithm. So. How do we. Build such a system. We want to return documents. In decreasing order of. Some score. Decreasing order of relevance to the. User. Which we are going to try to quantify as a score. So we're going to order the documents. To rank order the documents with respect to a query. By coming up with some kind of the score. Aur every document. Underscore. Will be in the range of 0 to 100 indicates. Anu match score of 1 indicates. The best quality match. And the score will in general be. Real number between 0 and 1. So highest score would mean that the document is. Closer to the quarry. Satish continuous ko. Is going to measure how well the document enquiry match. Is again an idea of a match in ranked retrieval is not binary. Its continuous. So you can have one document matching a query better than other document. Something that you didn't have in. Golden retriever. Sohar we assign such as ko let's try to think about how we can come up how we can define such a score between a query. And document. So let's start with a simple example where we have. I want enquiry. Insert query is. India. Suppose this query term. Does not occur in the document. Sabir comparing. This query with every single document in the corpus. Looking at one particular document. B a document i. Suppose this query term india does not occur in the document. Can we say that the score should be as you. That is there is no match between the query and the document. Know if the word india occurs. In the document. Then we could look at. How many times it occurs in the document. And the idea is that if it occurs a large number of times in the document. Then the document is more important. Then another document where it may occur only once. The most frequently query term occurs in the document. You're going to make the score higher. How we are going to try to define the score. Kendra number of ways to diff two to come up with such as score. Which satisfy this condition that is when there is no match the the value of the score is 0. And the more number of times the. Query term occurs in the document. The higher the score is.",
    "keywords": "query,retrieval,rank retrieval,users,language,rank,flee,flee query,rank retrieval model,retrieval model,principle,feast,produce,precise,precise understand",
    "domain": "Computer Science",
    "title": "Ranked Retrieval",
    "faculty": "Sharma"
  },
  {
    "duration": "18:48 min",
    "video_url": "https://drive.google.com/file/d/1U44fP9-6fuhxFxkv4MesADoQW-Io05IV/preview?usp=share_link",
    "transcript": "Hello everyone in this video i am going to discuss about cyber security. English video. We're going to discuss these topics. Introduction and definition of cyber security in chetna cyber security. Common terms used in cyber security. There are some types i will discuss. Components of cyber security. What are the career opportunities in cyber security. Specialisations in cybersecurity and finally. Some preventive measures. Ok let's start. What is server security by the way why do we need security. Scenery. People getting connected to internet in a wide range. And there's not getting proper security. Due to lack of 7 minute most of the people are becoming victim to cyber attacks. I don't know they didn't have the knowledge to protect the data. Connected to the internet and sharing what are the files. Open internet. But they don't know how to secure just files. And how to get saved from the attacks. As a result many people becoming victim to cyber crimes. Which is a serious issue because. It's like robbing all the personal data. All the citizens of the country. Latest about formal definition. What does the term cyber actually means is. Is nothing but something related to computers information technology. Then the term cyber security we can simply say it. The security being provided to the devices which are connected online in simple words. It is a service. Itni security service. Which office security to online devices. The devices which are connected to the internet. The main thing is internet. Should get connected to internet. Let's. How look into the history how the cyber security. In the early 90s a person am bob thomas. A one slice that whenever we send a file or something in the internet. It needs to travel through some. Hopsin notes. Across the network. So what you found is where ever the file go. It will have something. It leaves some mark. On the every note it reaches. Using that idea he created a program name creeper. Which prints the message and the paper catch me if you can. On the binu ritviz. Which is. Something like a virus. Normally virus party does whatever wherever it goes. It destroys the system resources or print some messages. Are descriptor also doing the same thing. Wherever it goes network. What are the notes of surprises. At least this message on the paper catch me if you can. Letter a person named ray tomlinson this is the good guy who invented email. Then he design another program cal re per. Which we can also called as 1st antivirus because this program reaper. It says the creeper and destroys it. Ok this is something like in anti-virus reaper. The histry creeper and repair are. Analogous to cyber-attacks. You can even say these are the first cyber attacks. This is a demo creeper. She finally prince the message i am the creeper catch me if you can. New latest see what is the hacker weather. In simple words a person. Breaks into other systems. Without their permission. He doesn't have the authorisation to enter into other systems. But we somehow against administrator control. An intercept of the system. Hacking is completely legal because no one has the right to. Visit other systems without the permission right. So hacking is completely dead. Three types of hackers sofa. This white ha is nothing but. The hacker who performs hacking for the sake of good. Will perform hacking. So that he will come to eat and come to know what are the loopholes present in a system. Which can help him to rectify. Black hat hackers a person. Who performs. With bad intention doesn't have any good intention is completely performs. With the bad intention. Bye. Sometimes of financial sekar sometime. With some revenge. What is grey hat hacker he is not. Neither completely white not black hat hacker. He sometimes behaves as white hat and sometimes he might be black head. Is both here will be having both the properties. What is a malware virus. Mal where is nothing but malicious software in simple words. Which actually means that. This of this software should not be there in our system because. In the name itself malicious software. This software is not healthy for your sister. It can destroy your system resources. It can capture all of personal private information. Medicine to someone else. Usually use this kind of malware so that they can take revenge on the attack on the victim or deccan. Treating him for some financial. Benefits. These are some type from always virus adware rootkits 5 ransomware trojan horse remote access. Mahaveer maugham ki login. Ashtmi knowledge ransomware is the most powerful because. Wannacry ransomware is one of the ransomware which caused a lot of destruction to big companies in the world like sone not this company. They got affected by this i wanna cry ransomware. What happened was all the personal files. Parson files when the customer data also. Attack. Encrypted them and they demanded lot of. Money so that deccan i can decrypt the data. This we can say is due to some security breaches in the. Network. They might not be having proper security mechanisms. Another issue. Based on the intensity of attacks we can classify attacks into two types active and passive attacks. In activator. What happens is that are directly modify the message content. Message is being sent from. Source to destination. Aur ine auraton se sender receiver. Message which is sent from the sender. Will be sent to receiver. Data kareena ke beta please modify the message content. Under receivable come to know that the message content is modified and. In equator. Easy to identify because. They may cause. Light damage to system resources also. System resources means what are the hardware component event and forget them at some time. Button kaise baithe data. Sit silently. Just copy the message contents without altering them. Does a result this attack is. Not that much powerful this is powerful. Not easy to identify. We cannot. Come to know that this attack happened. Under system resources he doesn't damage he just all diseases copies or message content which is also not so accept acceptable. New latest. Please look into types of cyber criminal. Disawar. First type is this. This terminal the just perform. Crimes for the sake of recognition. Just want to get recognise everywhere in the society. Like a set of fun we can say. Cyber criminals and second type. They not interested in condition but the internationally. Offer mein tax. Remind me psychological perverted people and sometimes. Financially supporting actors. Type 3. These people are insider. Which means. Suppose we have an organisation x organisation. And the person who was the ex employee of the organisation. Assam career with that organisation and he international you want to describe the organisation. As we know we will be knowing all the secrets out organisation. Can easily perform better on the torque nation so that email i can damage. This type of criminals are in silence. Within the organisation. Aap briefly we can classify server crimes into. These categories against individual against property against organisation and against society. Nav latest about the components for cyber security. Components in what. What. What aspects. Constituted as a whole. In cyber security. Testing is critical infrastructure infrastructure is nothing but what are the. Components of the hardware components also we have. 2016 will these components will also be having equal importance because. Someone hack server cctv camera. When we do we don't know that the person hack the camera. But he will capture all your data and you can even. He will do whatever he were. Because. He is my dad. That we should also have some. Actions on architect online or infrastructural. Properly maintained. Cloud security. We are now a days everything is being connected to internet. Another thing is getting stored into the cloud. Cloud computing is in demand. So we should have. Security to our cloud also. Because whatever the users will be having your organisation. Delhi using our cloud environment. Don't provide much security. The uses which we have. Get some issues. Internet of things is nothing but. Connecting everything to the internet. What are the hardware components we have in our home also like tv fans. Refrigerator everything. We can remotely control them as we will be having. Connect as will be. Having access to them because that connected to internet we can remotely. Control m. Accepting them on turning them off. Is that i can gain control of this thing then he can even play with us. Network security setting but what are the network we have in our organisation we should protect it by installing some proper firewall. Are taking some. 700 tips. Finally. Whatever the. Organisation it might be. The employees of that organisation should. Should be trained in such a way that. They should not become victim to cybercrime because if the employees get victims. The other organisation will get affected. So the order employees should also have some knowledge on cyber security. These are some career opportunities in the area of cyber security. Security architect. Consultant p********** tester. Security consultant is a person who protects coronavirus and stator. Sanitation tester is nothing but an ethical hacker we can also say. Performs hacking. Find the weaknesses for vulnerabilities in the system which attackers in used to perform data. Chief information security officer is the highest level job position. Among all the career opportunities in cyber security. He can even have his own security measures because he is the superior of all the security officers. Photographer is a person who writes sports that hackers cannot track. Of course the main team of fees that thing. Converting a message. Inter sambandhit double format. Which we call it is encryption. We do that thing by having some key. Which is private between the sender and receiver. The receiver will only. Can only read the message. But decrypting using that private every having. System security analyst security engineer and security architect they seem to be analogous. What they do is they just. Digest. Take care of water vada security system. But the main differences. Accident. Security engineer is the entry level position after that security analyst. And finally cancer security architect. No these are the specialisation areas in cyber security. Satish acharya samsung. Application security cryptography cyber law for mca. Security. Pen testing. Policy management and governance. Risk assessment. Architecture. Application security is nothing but providing security to whatever the application see here. Cryptography is nothing but the process of. Encryption and decryption. Cyber laws is nothing but. Making lost so that attack. Will get punished. Foreign six years after the attack happened what are the steps we should take. So that we can recover from the data under 10 event. Trace the attack. Network security what are the what are the network theory using it should provide proper security to the network. Sanitation testing is nothing but. Ethical hacking. He performs 30 people perform hacking. With the permission of an organisation and. Will identify voter whatever the loopholes present in the coordination. Policy management. W for any organisation they will be having some cyber security policy. So that they should not become victim to cyber crime. Ss vintage. Assessing the risk. Judging the raised water to place of the cyber security. Security architecture. I think we will discuss in a slide. Vishal things. Finally deserve these are some common attacks malviya we discussed. Fishing man in the middle denial-of-service. Sql injection. Zeroed exploit cross 6:15. Elicited vecancy. The cosmic destruction. We should. Stay away from this exam in which should get protected. Odisha tax. Finally i would like to share some preventive measure common preventive measures. I should have strong password is consist of. 8 characters minimum of 8 characters. Capital letter. Murder case. Amit small letters numbers. As illustration character. Securing a computer by installing proper antivirus software. Shouldn't we can i install anti spyware software. Then that they can block spyware attack. Amenities fibre software. In social media we should take preventive measures like for example what are the what are the social media we have instagram and facebook. Providing their own security measure. Like. New step authorisation. 2 standard things you better enable them so that we can get saved from this attack. We should secure mobile devices by having strong passwords. Not. Bi install. Should not install any suspicious applications on server. It protect our data. Why not sharing order the first information we have. Weather. Wireless network what are the wi-fi network or a thing we have you should have strong password. So that we can secure network. Living product overy identity. I mean we should not get expose watch online. Because. Juta online activity also detector may come to know. Password 7. Finally we should avoid being scam. For example. Should not open any suspicious or malicious. Links which we get message. Mobile messages. You should. Have some ever so that we can get saved from my listing. Finally thank you.",
    "keywords": "security,cyber,cyber security,hackers,attack,specialization,malware,hacker,keeper,measure,software,damage,cybercriminals,engineer,cybercrime",
    "domain": "Computer Science",
    "title": "Cyber Security",
    "faculty": "Chopra"
  }
]